zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2022 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K358_GMAC.h
 * @version 1.1
 * @date 2022-10-01
 * @brief Peripheral Access Layer for S32K358_GMAC
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K358_GMAC_H_)  /* Check if memory map has not been already included */
#define S32K358_GMAC_H_

#include "S32K358_COMMON.h"

/* ----------------------------------------------------------------------------
   -- GMAC Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup GMAC_Peripheral_Access_Layer GMAC Peripheral Access Layer
 * @{
 */

/** GMAC - Register Layout Typedef */
typedef struct {
  __IO uint32_t MAC_CONFIGURATION;                 /**< , offset: 0x0 */
  __IO uint32_t MAC_EXT_CONFIGURATION;             /**< , offset: 0x4 */
  __IO uint32_t MAC_PACKET_FILTER;                 /**< , offset: 0x8 */
  __IO uint32_t MAC_WATCHDOG_TIMEOUT;              /**< , offset: 0xC */
  __IO uint32_t MAC_HASH_TABLE_REG0;               /**< , offset: 0x10 */
  __IO uint32_t MAC_HASH_TABLE_REG1;               /**< , offset: 0x14 */
  __IO uint32_t MAC_HASH_TABLE_REG2;               /**< , offset: 0x18 */
  __IO uint32_t MAC_HASH_TABLE_REG3;               /**< , offset: 0x1C */
  __IO uint32_t MAC_HASH_TABLE_REG4;               /**< , offset: 0x20 */
  __IO uint32_t MAC_HASH_TABLE_REG5;               /**< , offset: 0x24 */
  __IO uint32_t MAC_HASH_TABLE_REG6;               /**< , offset: 0x28 */
  __IO uint32_t MAC_HASH_TABLE_REG7;               /**< , offset: 0x2C */
  uint8_t RESERVED_0[32];
  __IO uint32_t MAC_VLAN_TAG_CTRL;                 /**< , offset: 0x50 */
  union {                                          /* offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_DATA;                 /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER0;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER1;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER2;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER3;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER4;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER5;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER6;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER7;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER8;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER9;              /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER10;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER11;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER12;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER13;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER14;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER15;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER16;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER17;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER18;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER19;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER20;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER21;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER22;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER23;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER24;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER25;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER26;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER27;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER28;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER29;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER30;             /**< , offset: 0x54 */
    __IO uint32_t MAC_VLAN_TAG_FILTER31;             /**< , offset: 0x54 */
  } MAC_VLAN_TAG_DATA;
  __IO uint32_t MAC_VLAN_HASH_TABLE;               /**< , offset: 0x58 */
  uint8_t RESERVED_1[4];
  union {                                          /* offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL;                     /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL0;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL1;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL2;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL3;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL4;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL5;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL6;                    /**< , offset: 0x60 */
    __IO uint32_t MAC_VLAN_INCL7;                    /**< , offset: 0x60 */
  } MAC_VLAN_INCL;
  __IO uint32_t MAC_INNER_VLAN_INCL;               /**< , offset: 0x64 */
  uint8_t RESERVED_2[8];
  __IO uint32_t MAC_Q0_TX_FLOW_CTRL;               /**< , offset: 0x70 */
  __IO uint32_t MAC_Q1_TX_FLOW_CTRL;               /**< , offset: 0x74 */
  __IO uint32_t MAC_Q2_TX_FLOW_CTRL;               /**< , offset: 0x78 */
  uint8_t RESERVED_3[20];
  __IO uint32_t MAC_RX_FLOW_CTRL;                  /**< , offset: 0x90 */
  __IO uint32_t MAC_RXQ_CTRL4;                     /**< , offset: 0x94 */
  __IO uint32_t MAC_TXQ_PRTY_MAP0;                 /**< , offset: 0x98 */
  uint8_t RESERVED_4[4];
  __IO uint32_t MAC_RXQ_CTRL0;                     /**< , offset: 0xA0 */
  __IO uint32_t MAC_RXQ_CTRL1;                     /**< , offset: 0xA4 */
  __IO uint32_t MAC_RXQ_CTRL2;                     /**< , offset: 0xA8 */
  uint8_t RESERVED_5[4];
  __I  uint32_t MAC_INTERRUPT_STATUS;              /**< , offset: 0xB0 */
  __IO uint32_t MAC_INTERRUPT_ENABLE;              /**< , offset: 0xB4 */
  __I  uint32_t MAC_RX_TX_STATUS;                  /**< , offset: 0xB8 */
  uint8_t RESERVED_6[60];
  __IO uint32_t MAC_PHYIF_CONTROL_STATUS;          /**< , offset: 0xF8 */
  uint8_t RESERVED_7[20];
  __I  uint32_t MAC_VERSION;                       /**< , offset: 0x110 */
  __I  uint32_t MAC_DEBUG;                         /**< , offset: 0x114 */
  uint8_t RESERVED_8[4];
  __I  uint32_t MAC_HW_FEATURE0;                   /**< , offset: 0x11C */
  __I  uint32_t MAC_HW_FEATURE1;                   /**< , offset: 0x120 */
  __I  uint32_t MAC_HW_FEATURE2;                   /**< , offset: 0x124 */
  __I  uint32_t MAC_HW_FEATURE3;                   /**< , offset: 0x128 */
  uint8_t RESERVED_9[20];
  __IO uint32_t MAC_DPP_FSM_INTERRUPT_STATUS;      /**< , offset: 0x140 */
  uint8_t RESERVED_10[4];
  __IO uint32_t MAC_FSM_CONTROL;                   /**< , offset: 0x148 */
  __IO uint32_t MAC_FSM_ACT_TIMER;                 /**< , offset: 0x14C */
  __IO uint32_t SCS_REG1;                          /**< , offset: 0x150 */
  uint8_t RESERVED_11[172];
  __IO uint32_t MAC_MDIO_ADDRESS;                  /**< , offset: 0x200 */
  __IO uint32_t MAC_MDIO_DATA;                     /**< , offset: 0x204 */
  uint8_t RESERVED_12[8];
  __IO uint32_t MAC_ARP_ADDRESS;                   /**< , offset: 0x210 */
  uint8_t RESERVED_13[28];
  __IO uint32_t MAC_CSR_SW_CTRL;                   /**< , offset: 0x230 */
  __IO uint32_t MAC_FPE_CTRL_STS;                  /**< , offset: 0x234 */
  __IO uint32_t MAC_EXT_CFG1;                      /**< , offset: 0x238 */
  uint8_t RESERVED_14[4];
  __I  uint32_t MAC_PRESN_TIME_NS;                 /**< , offset: 0x240 */
  __IO uint32_t MAC_PRESN_TIME_UPDT;               /**< , offset: 0x244 */
  uint8_t RESERVED_15[184];
  __IO uint32_t MAC_ADDRESS0_HIGH;                 /**< , offset: 0x300 */
  __IO uint32_t MAC_ADDRESS0_LOW;                  /**< , offset: 0x304 */
  __IO uint32_t MAC_ADDRESS1_HIGH;                 /**< , offset: 0x308 */
  __IO uint32_t MAC_ADDRESS1_LOW;                  /**< , offset: 0x30C */
  __IO uint32_t MAC_ADDRESS2_HIGH;                 /**< , offset: 0x310 */
  __IO uint32_t MAC_ADDRESS2_LOW;                  /**< , offset: 0x314 */
  uint8_t RESERVED_16[1000];
  __IO uint32_t MMC_CONTROL;                       /**< , offset: 0x700 */
  __I  uint32_t MMC_RX_INTERRUPT;                  /**< , offset: 0x704 */
  __I  uint32_t MMC_TX_INTERRUPT;                  /**< , offset: 0x708 */
  __IO uint32_t MMC_RX_INTERRUPT_MASK;             /**< , offset: 0x70C */
  __IO uint32_t MMC_TX_INTERRUPT_MASK;             /**< , offset: 0x710 */
  __I  uint32_t TX_OCTET_COUNT_GOOD_BAD;           /**< , offset: 0x714 */
  __I  uint32_t TX_PACKET_COUNT_GOOD_BAD;          /**< , offset: 0x718 */
  __I  uint32_t TX_BROADCAST_PACKETS_GOOD;         /**< , offset: 0x71C */
  __I  uint32_t TX_MULTICAST_PACKETS_GOOD;         /**< , offset: 0x720 */
  __I  uint32_t TX_64OCTETS_PACKETS_GOOD_BAD;      /**< , offset: 0x724 */
  __I  uint32_t TX_65TO127OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x728 */
  __I  uint32_t TX_128TO255OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x72C */
  __I  uint32_t TX_256TO511OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x730 */
  __I  uint32_t TX_512TO1023OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x734 */
  __I  uint32_t TX_1024TOMAXOCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x738 */
  __I  uint32_t TX_UNICAST_PACKETS_GOOD_BAD;       /**< , offset: 0x73C */
  __I  uint32_t TX_MULTICAST_PACKETS_GOOD_BAD;     /**< , offset: 0x740 */
  __I  uint32_t TX_BROADCAST_PACKETS_GOOD_BAD;     /**< , offset: 0x744 */
  __I  uint32_t TX_UNDERFLOW_ERROR_PACKETS;        /**< , offset: 0x748 */
  __I  uint32_t TX_SINGLE_COLLISION_GOOD_PACKETS;  /**< , offset: 0x74C */
  __I  uint32_t TX_MULTIPLE_COLLISION_GOOD_PACKETS; /**< , offset: 0x750 */
  __I  uint32_t TX_DEFERRED_PACKETS;               /**< , offset: 0x754 */
  __I  uint32_t TX_LATE_COLLISION_PACKETS;         /**< , offset: 0x758 */
  __I  uint32_t TX_EXCESSIVE_COLLISION_PACKETS;    /**< , offset: 0x75C */
  __I  uint32_t TX_CARRIER_ERROR_PACKETS;          /**< , offset: 0x760 */
  __I  uint32_t TX_OCTET_COUNT_GOOD;               /**< , offset: 0x764 */
  __I  uint32_t TX_PACKET_COUNT_GOOD;              /**< , offset: 0x768 */
  __I  uint32_t TX_EXCESSIVE_DEFERRAL_ERROR;       /**< , offset: 0x76C */
  __I  uint32_t TX_PAUSE_PACKETS;                  /**< , offset: 0x770 */
  __I  uint32_t TX_VLAN_PACKETS_GOOD;              /**< , offset: 0x774 */
  __I  uint32_t TX_OSIZE_PACKETS_GOOD;             /**< , offset: 0x778 */
  uint8_t RESERVED_17[4];
  __I  uint32_t RX_PACKETS_COUNT_GOOD_BAD;         /**< , offset: 0x780 */
  __I  uint32_t RX_OCTET_COUNT_GOOD_BAD;           /**< , offset: 0x784 */
  __I  uint32_t RX_OCTET_COUNT_GOOD;               /**< , offset: 0x788 */
  __I  uint32_t RX_BROADCAST_PACKETS_GOOD;         /**< , offset: 0x78C */
  __I  uint32_t RX_MULTICAST_PACKETS_GOOD;         /**< , offset: 0x790 */
  __I  uint32_t RX_CRC_ERROR_PACKETS;              /**< , offset: 0x794 */
  __I  uint32_t RX_ALIGNMENT_ERROR_PACKETS;        /**< , offset: 0x798 */
  __I  uint32_t RX_RUNT_ERROR_PACKETS;             /**< , offset: 0x79C */
  __I  uint32_t RX_JABBER_ERROR_PACKETS;           /**< , offset: 0x7A0 */
  __I  uint32_t RX_UNDERSIZE_PACKETS_GOOD;         /**< , offset: 0x7A4 */
  __I  uint32_t RX_OVERSIZE_PACKETS_GOOD;          /**< , offset: 0x7A8 */
  __I  uint32_t RX_64OCTETS_PACKETS_GOOD_BAD;      /**< , offset: 0x7AC */
  __I  uint32_t RX_65TO127OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x7B0 */
  __I  uint32_t RX_128TO255OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x7B4 */
  __I  uint32_t RX_256TO511OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x7B8 */
  __I  uint32_t RX_512TO1023OCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x7BC */
  __I  uint32_t RX_1024TOMAXOCTETS_PACKETS_GOOD_BAD; /**< , offset: 0x7C0 */
  __I  uint32_t RX_UNICAST_PACKETS_GOOD;           /**< , offset: 0x7C4 */
  __I  uint32_t RX_LENGTH_ERROR_PACKETS;           /**< , offset: 0x7C8 */
  __I  uint32_t RX_OUT_OF_RANGE_TYPE_PACKETS;      /**< , offset: 0x7CC */
  __I  uint32_t RX_PAUSE_PACKETS;                  /**< , offset: 0x7D0 */
  __I  uint32_t RX_FIFO_OVERFLOW_PACKETS;          /**< , offset: 0x7D4 */
  __I  uint32_t RX_VLAN_PACKETS_GOOD_BAD;          /**< , offset: 0x7D8 */
  __I  uint32_t RX_WATCHDOG_ERROR_PACKETS;         /**< , offset: 0x7DC */
  __I  uint32_t RX_RECEIVE_ERROR_PACKETS;          /**< , offset: 0x7E0 */
  __I  uint32_t RX_CONTROL_PACKETS_GOOD;           /**< , offset: 0x7E4 */
  uint8_t RESERVED_18[184];
  __I  uint32_t MMC_FPE_TX_INTERRUPT;              /**< , offset: 0x8A0 */
  __IO uint32_t MMC_FPE_TX_INTERRUPT_MASK;         /**< , offset: 0x8A4 */
  __I  uint32_t MMC_TX_FPE_FRAGMENT_CNTR;          /**< , offset: 0x8A8 */
  __I  uint32_t MMC_TX_HOLD_REQ_CNTR;              /**< , offset: 0x8AC */
  uint8_t RESERVED_19[16];
  __I  uint32_t MMC_FPE_RX_INTERRUPT;              /**< , offset: 0x8C0 */
  __IO uint32_t MMC_FPE_RX_INTERRUPT_MASK;         /**< , offset: 0x8C4 */
  __I  uint32_t MMC_RX_PACKET_ASSEMBLY_ERR_CNTR;   /**< , offset: 0x8C8 */
  __I  uint32_t MMC_RX_PACKET_SMD_ERR_CNTR;        /**< , offset: 0x8CC */
  __I  uint32_t MMC_RX_PACKET_ASSEMBLY_OK_CNTR;    /**< , offset: 0x8D0 */
  __I  uint32_t MMC_RX_FPE_FRAGMENT_CNTR;          /**< , offset: 0x8D4 */
  uint8_t RESERVED_20[40];
  __IO uint32_t MAC_L3_L4_CONTROL0;                /**< , offset: 0x900 */
  __IO uint32_t MAC_LAYER4_ADDRESS0;               /**< , offset: 0x904 */
  uint8_t RESERVED_21[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG0;             /**< , offset: 0x910 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG0;             /**< , offset: 0x914 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG0;             /**< , offset: 0x918 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG0;             /**< , offset: 0x91C */
  uint8_t RESERVED_22[16];
  __IO uint32_t MAC_L3_L4_CONTROL1;                /**< , offset: 0x930 */
  __IO uint32_t MAC_LAYER4_ADDRESS1;               /**< , offset: 0x934 */
  uint8_t RESERVED_23[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG1;             /**< , offset: 0x940 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG1;             /**< , offset: 0x944 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG1;             /**< , offset: 0x948 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG1;             /**< , offset: 0x94C */
  uint8_t RESERVED_24[16];
  __IO uint32_t MAC_L3_L4_CONTROL2;                /**< , offset: 0x960 */
  __IO uint32_t MAC_LAYER4_ADDRESS2;               /**< , offset: 0x964 */
  uint8_t RESERVED_25[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG2;             /**< , offset: 0x970 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG2;             /**< , offset: 0x974 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG2;             /**< , offset: 0x978 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG2;             /**< , offset: 0x97C */
  uint8_t RESERVED_26[16];
  __IO uint32_t MAC_L3_L4_CONTROL3;                /**< , offset: 0x990 */
  __IO uint32_t MAC_LAYER4_ADDRESS3;               /**< , offset: 0x994 */
  uint8_t RESERVED_27[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG3;             /**< , offset: 0x9A0 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG3;             /**< , offset: 0x9A4 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG3;             /**< , offset: 0x9A8 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG3;             /**< , offset: 0x9AC */
  uint8_t RESERVED_28[16];
  __IO uint32_t MAC_L3_L4_CONTROL4;                /**< , offset: 0x9C0 */
  __IO uint32_t MAC_LAYER4_ADDRESS4;               /**< , offset: 0x9C4 */
  uint8_t RESERVED_29[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG4;             /**< , offset: 0x9D0 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG4;             /**< , offset: 0x9D4 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG4;             /**< , offset: 0x9D8 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG4;             /**< , offset: 0x9DC */
  uint8_t RESERVED_30[16];
  __IO uint32_t MAC_L3_L4_CONTROL5;                /**< , offset: 0x9F0 */
  __IO uint32_t MAC_LAYER4_ADDRESS5;               /**< , offset: 0x9F4 */
  uint8_t RESERVED_31[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG5;             /**< , offset: 0xA00 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG5;             /**< , offset: 0xA04 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG5;             /**< , offset: 0xA08 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG5;             /**< , offset: 0xA0C */
  uint8_t RESERVED_32[16];
  __IO uint32_t MAC_L3_L4_CONTROL6;                /**< , offset: 0xA20 */
  __IO uint32_t MAC_LAYER4_ADDRESS6;               /**< , offset: 0xA24 */
  uint8_t RESERVED_33[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG6;             /**< , offset: 0xA30 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG6;             /**< , offset: 0xA34 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG6;             /**< , offset: 0xA38 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG6;             /**< , offset: 0xA3C */
  uint8_t RESERVED_34[16];
  __IO uint32_t MAC_L3_L4_CONTROL7;                /**< , offset: 0xA50 */
  __IO uint32_t MAC_LAYER4_ADDRESS7;               /**< , offset: 0xA54 */
  uint8_t RESERVED_35[8];
  __IO uint32_t MAC_LAYER3_ADDR0_REG7;             /**< , offset: 0xA60 */
  __IO uint32_t MAC_LAYER3_ADDR1_REG7;             /**< , offset: 0xA64 */
  __IO uint32_t MAC_LAYER3_ADDR2_REG7;             /**< , offset: 0xA68 */
  __IO uint32_t MAC_LAYER3_ADDR3_REG7;             /**< , offset: 0xA6C */
  __IO uint32_t MAC_INDIR_ACCESS_CTRL;             /**< , offset: 0xA70 */
  union {                                          /* offset: 0xA74 */
    __IO uint32_t MAC_INDIR_ACCESS_DATA;             /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS0;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS1;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS2;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS3;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS4;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS5;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS6;                    /**< , offset: 0xA74 */
    __IO uint32_t MAC_TMRQ_REGS7;                    /**< , offset: 0xA74 */
  } MAC_INDIR_ACCESS_DATA;
  uint8_t RESERVED_36[136];
  __IO uint32_t MAC_TIMESTAMP_CONTROL;             /**< , offset: 0xB00 */
  __IO uint32_t MAC_SUB_SECOND_INCREMENT;          /**< , offset: 0xB04 */
  __I  uint32_t MAC_SYSTEM_TIME_SECONDS;           /**< , offset: 0xB08 */
  __I  uint32_t MAC_SYSTEM_TIME_NANOSECONDS;       /**< , offset: 0xB0C */
  __IO uint32_t MAC_SYSTEM_TIME_SECONDS_UPDATE;    /**< , offset: 0xB10 */
  __IO uint32_t MAC_SYSTEM_TIME_NANOSECONDS_UPDATE; /**< , offset: 0xB14 */
  __IO uint32_t MAC_TIMESTAMP_ADDEND;              /**< , offset: 0xB18 */
  __IO uint32_t MAC_SYSTEM_TIME_HIGHER_WORD_SECONDS; /**< , offset: 0xB1C */
  __I  uint32_t MAC_TIMESTAMP_STATUS;              /**< , offset: 0xB20 */
  uint8_t RESERVED_37[12];
  __I  uint32_t MAC_TX_TIMESTAMP_STATUS_NANOSECONDS; /**< , offset: 0xB30 */
  __I  uint32_t MAC_TX_TIMESTAMP_STATUS_SECONDS;   /**< , offset: 0xB34 */
  uint8_t RESERVED_38[24];
  __IO uint32_t MAC_TIMESTAMP_INGRESS_ASYM_CORR;   /**< , offset: 0xB50 */
  __IO uint32_t MAC_TIMESTAMP_EGRESS_ASYM_CORR;    /**< , offset: 0xB54 */
  __IO uint32_t MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND; /**< , offset: 0xB58 */
  __IO uint32_t MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND; /**< , offset: 0xB5C */
  __IO uint32_t MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC; /**< , offset: 0xB60 */
  __IO uint32_t MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC; /**< , offset: 0xB64 */
  __I  uint32_t MAC_TIMESTAMP_INGRESS_LATENCY;     /**< , offset: 0xB68 */
  __I  uint32_t MAC_TIMESTAMP_EGRESS_LATENCY;      /**< , offset: 0xB6C */
  __IO uint32_t MAC_PPS_CONTROL;                   /**< , offset: 0xB70 */
  uint8_t RESERVED_39[12];
  __IO uint32_t MAC_PPS0_TARGET_TIME_SECONDS;      /**< , offset: 0xB80 */
  __IO uint32_t MAC_PPS0_TARGET_TIME_NANOSECONDS;  /**< , offset: 0xB84 */
  __IO uint32_t MAC_PPS0_INTERVAL;                 /**< , offset: 0xB88 */
  __IO uint32_t MAC_PPS0_WIDTH;                    /**< , offset: 0xB8C */
  __IO uint32_t MAC_PPS1_TARGET_TIME_SECONDS;      /**< , offset: 0xB90 */
  __IO uint32_t MAC_PPS1_TARGET_TIME_NANOSECONDS;  /**< , offset: 0xB94 */
  __IO uint32_t MAC_PPS1_INTERVAL;                 /**< , offset: 0xB98 */
  __IO uint32_t MAC_PPS1_WIDTH;                    /**< , offset: 0xB9C */
  __IO uint32_t MAC_PPS2_TARGET_TIME_SECONDS;      /**< , offset: 0xBA0 */
  __IO uint32_t MAC_PPS2_TARGET_TIME_NANOSECONDS;  /**< , offset: 0xBA4 */
  __IO uint32_t MAC_PPS2_INTERVAL;                 /**< , offset: 0xBA8 */
  __IO uint32_t MAC_PPS2_WIDTH;                    /**< , offset: 0xBAC */
  __IO uint32_t MAC_PPS3_TARGET_TIME_SECONDS;      /**< , offset: 0xBB0 */
  __IO uint32_t MAC_PPS3_TARGET_TIME_NANOSECONDS;  /**< , offset: 0xBB4 */
  __IO uint32_t MAC_PPS3_INTERVAL;                 /**< , offset: 0xBB8 */
  __IO uint32_t MAC_PPS3_WIDTH;                    /**< , offset: 0xBBC */
  uint8_t RESERVED_40[64];
  __IO uint32_t MTL_OPERATION_MODE;                /**< , offset: 0xC00 */
  uint8_t RESERVED_41[4];
  __IO uint32_t MTL_DBG_CTL;                       /**< , offset: 0xC08 */
  __IO uint32_t MTL_DBG_STS;                       /**< , offset: 0xC0C */
  __IO uint32_t MTL_FIFO_DEBUG_DATA;               /**< , offset: 0xC10 */
  uint8_t RESERVED_42[12];
  __I  uint32_t MTL_INTERRUPT_STATUS;              /**< , offset: 0xC20 */
  uint8_t RESERVED_43[12];
  __IO uint32_t MTL_RXQ_DMA_MAP0;                  /**< , offset: 0xC30 */
  uint8_t RESERVED_44[12];
  __IO uint32_t MTL_TBS_CTRL;                      /**< , offset: 0xC40 */
  uint8_t RESERVED_45[12];
  __IO uint32_t MTL_EST_CONTROL;                   /**< , offset: 0xC50 */
  __IO uint32_t MTL_EST_EXT_CONTROL;               /**< , offset: 0xC54 */
  __IO uint32_t MTL_EST_STATUS;                    /**< , offset: 0xC58 */
  uint8_t RESERVED_46[4];
  __IO uint32_t MTL_EST_SCH_ERROR;                 /**< , offset: 0xC60 */
  __IO uint32_t MTL_EST_FRM_SIZE_ERROR;            /**< , offset: 0xC64 */
  __I  uint32_t MTL_EST_FRM_SIZE_CAPTURE;          /**< , offset: 0xC68 */
