zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_CONFIGURATION_S2KP_MASK         (0x400000U)
#define GMAC_MAC_CONFIGURATION_S2KP_SHIFT        (22U)
#define GMAC_MAC_CONFIGURATION_S2KP_WIDTH        (1U)
#define GMAC_MAC_CONFIGURATION_S2KP(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_S2KP_SHIFT)) & GMAC_MAC_CONFIGURATION_S2KP_MASK)

#define GMAC_MAC_CONFIGURATION_GPSLCE_MASK       (0x800000U)
#define GMAC_MAC_CONFIGURATION_GPSLCE_SHIFT      (23U)
#define GMAC_MAC_CONFIGURATION_GPSLCE_WIDTH      (1U)
#define GMAC_MAC_CONFIGURATION_GPSLCE(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_GPSLCE_SHIFT)) & GMAC_MAC_CONFIGURATION_GPSLCE_MASK)

#define GMAC_MAC_CONFIGURATION_IPG_MASK          (0x7000000U)
#define GMAC_MAC_CONFIGURATION_IPG_SHIFT         (24U)
#define GMAC_MAC_CONFIGURATION_IPG_WIDTH         (3U)
#define GMAC_MAC_CONFIGURATION_IPG(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_IPG_SHIFT)) & GMAC_MAC_CONFIGURATION_IPG_MASK)

#define GMAC_MAC_CONFIGURATION_IPC_MASK          (0x8000000U)
#define GMAC_MAC_CONFIGURATION_IPC_SHIFT         (27U)
#define GMAC_MAC_CONFIGURATION_IPC_WIDTH         (1U)
#define GMAC_MAC_CONFIGURATION_IPC(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_IPC_SHIFT)) & GMAC_MAC_CONFIGURATION_IPC_MASK)

#define GMAC_MAC_CONFIGURATION_SARC_MASK         (0x70000000U)
#define GMAC_MAC_CONFIGURATION_SARC_SHIFT        (28U)
#define GMAC_MAC_CONFIGURATION_SARC_WIDTH        (3U)
#define GMAC_MAC_CONFIGURATION_SARC(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_SARC_SHIFT)) & GMAC_MAC_CONFIGURATION_SARC_MASK)

#define GMAC_MAC_CONFIGURATION_ARPEN_MASK        (0x80000000U)
#define GMAC_MAC_CONFIGURATION_ARPEN_SHIFT       (31U)
#define GMAC_MAC_CONFIGURATION_ARPEN_WIDTH       (1U)
#define GMAC_MAC_CONFIGURATION_ARPEN(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CONFIGURATION_ARPEN_SHIFT)) & GMAC_MAC_CONFIGURATION_ARPEN_MASK)
/*! @} */

/*! @name MAC_EXT_CONFIGURATION -  */
/*! @{ */

#define GMAC_MAC_EXT_CONFIGURATION_GPSL_MASK     (0x3FFFU)
#define GMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT    (0U)
#define GMAC_MAC_EXT_CONFIGURATION_GPSL_WIDTH    (14U)
#define GMAC_MAC_EXT_CONFIGURATION_GPSL(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_GPSL_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_Reserved_15_14_MASK (0xC000U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_15_14_SHIFT (14U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_15_14_WIDTH (2U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_15_14(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_Reserved_15_14_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_Reserved_15_14_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_DCRCC_MASK    (0x10000U)
#define GMAC_MAC_EXT_CONFIGURATION_DCRCC_SHIFT   (16U)
#define GMAC_MAC_EXT_CONFIGURATION_DCRCC_WIDTH   (1U)
#define GMAC_MAC_EXT_CONFIGURATION_DCRCC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_DCRCC_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_DCRCC_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_SPEN_MASK     (0x20000U)
#define GMAC_MAC_EXT_CONFIGURATION_SPEN_SHIFT    (17U)
#define GMAC_MAC_EXT_CONFIGURATION_SPEN_WIDTH    (1U)
#define GMAC_MAC_EXT_CONFIGURATION_SPEN(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_SPEN_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_SPEN_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_USP_MASK      (0x40000U)
#define GMAC_MAC_EXT_CONFIGURATION_USP_SHIFT     (18U)
#define GMAC_MAC_EXT_CONFIGURATION_USP_WIDTH     (1U)
#define GMAC_MAC_EXT_CONFIGURATION_USP(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_USP_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_USP_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_PDC_MASK      (0x80000U)
#define GMAC_MAC_EXT_CONFIGURATION_PDC_SHIFT     (19U)
#define GMAC_MAC_EXT_CONFIGURATION_PDC_WIDTH     (1U)
#define GMAC_MAC_EXT_CONFIGURATION_PDC(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_PDC_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_PDC_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_HDSMS_MASK    (0x700000U)
#define GMAC_MAC_EXT_CONFIGURATION_HDSMS_SHIFT   (20U)
#define GMAC_MAC_EXT_CONFIGURATION_HDSMS_WIDTH   (3U)
#define GMAC_MAC_EXT_CONFIGURATION_HDSMS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_HDSMS_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_HDSMS_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_Reserved_23_MASK (0x800000U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_23_SHIFT (23U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_23_WIDTH (1U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_23(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_Reserved_23_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_Reserved_23_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_EIPGEN_MASK   (0x1000000U)
#define GMAC_MAC_EXT_CONFIGURATION_EIPGEN_SHIFT  (24U)
#define GMAC_MAC_EXT_CONFIGURATION_EIPGEN_WIDTH  (1U)
#define GMAC_MAC_EXT_CONFIGURATION_EIPGEN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_EIPGEN_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_EIPGEN_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_EIPG_MASK     (0x3E000000U)
#define GMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT    (25U)
#define GMAC_MAC_EXT_CONFIGURATION_EIPG_WIDTH    (5U)
#define GMAC_MAC_EXT_CONFIGURATION_EIPG(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_EIPG_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_APDIM_MASK    (0x40000000U)
#define GMAC_MAC_EXT_CONFIGURATION_APDIM_SHIFT   (30U)
#define GMAC_MAC_EXT_CONFIGURATION_APDIM_WIDTH   (1U)
#define GMAC_MAC_EXT_CONFIGURATION_APDIM(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_APDIM_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_APDIM_MASK)

#define GMAC_MAC_EXT_CONFIGURATION_Reserved_FHE_MASK (0x80000000U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_FHE_SHIFT (31U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_FHE_WIDTH (1U)
#define GMAC_MAC_EXT_CONFIGURATION_Reserved_FHE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CONFIGURATION_Reserved_FHE_SHIFT)) & GMAC_MAC_EXT_CONFIGURATION_Reserved_FHE_MASK)
/*! @} */

/*! @name MAC_PACKET_FILTER -  */
/*! @{ */

