zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_HASH_TABLE_REG0 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG0_HT31T0_MASK     (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT    (0U)
#define GMAC_MAC_HASH_TABLE_REG0_HT31T0_WIDTH    (32U)
#define GMAC_MAC_HASH_TABLE_REG0_HT31T0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT)) & GMAC_MAC_HASH_TABLE_REG0_HT31T0_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG1 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG1_HT63T32_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT   (0U)
#define GMAC_MAC_HASH_TABLE_REG1_HT63T32_WIDTH   (32U)
#define GMAC_MAC_HASH_TABLE_REG1_HT63T32(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT)) & GMAC_MAC_HASH_TABLE_REG1_HT63T32_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG2 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG2_HT95T64_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG2_HT95T64_SHIFT   (0U)
#define GMAC_MAC_HASH_TABLE_REG2_HT95T64_WIDTH   (32U)
#define GMAC_MAC_HASH_TABLE_REG2_HT95T64(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG2_HT95T64_SHIFT)) & GMAC_MAC_HASH_TABLE_REG2_HT95T64_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG3 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG3_HT127T96_MASK   (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG3_HT127T96_SHIFT  (0U)
#define GMAC_MAC_HASH_TABLE_REG3_HT127T96_WIDTH  (32U)
#define GMAC_MAC_HASH_TABLE_REG3_HT127T96(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG3_HT127T96_SHIFT)) & GMAC_MAC_HASH_TABLE_REG3_HT127T96_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG4 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG4_HT159T128_MASK  (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG4_HT159T128_SHIFT (0U)
#define GMAC_MAC_HASH_TABLE_REG4_HT159T128_WIDTH (32U)
#define GMAC_MAC_HASH_TABLE_REG4_HT159T128(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG4_HT159T128_SHIFT)) & GMAC_MAC_HASH_TABLE_REG4_HT159T128_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG5 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG5_HT191T160_MASK  (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG5_HT191T160_SHIFT (0U)
#define GMAC_MAC_HASH_TABLE_REG5_HT191T160_WIDTH (32U)
#define GMAC_MAC_HASH_TABLE_REG5_HT191T160(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG5_HT191T160_SHIFT)) & GMAC_MAC_HASH_TABLE_REG5_HT191T160_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG6 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG6_HT223T192_MASK  (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG6_HT223T192_SHIFT (0U)
#define GMAC_MAC_HASH_TABLE_REG6_HT223T192_WIDTH (32U)
#define GMAC_MAC_HASH_TABLE_REG6_HT223T192(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG6_HT223T192_SHIFT)) & GMAC_MAC_HASH_TABLE_REG6_HT223T192_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG7 -  */
/*! @{ */

#define GMAC_MAC_HASH_TABLE_REG7_HT255T224_MASK  (0xFFFFFFFFU)
#define GMAC_MAC_HASH_TABLE_REG7_HT255T224_SHIFT (0U)
#define GMAC_MAC_HASH_TABLE_REG7_HT255T224_WIDTH (32U)
#define GMAC_MAC_HASH_TABLE_REG7_HT255T224(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HASH_TABLE_REG7_HT255T224_SHIFT)) & GMAC_MAC_HASH_TABLE_REG7_HT255T224_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_CTRL -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_CTRL_OB_MASK           (0x1U)
#define GMAC_MAC_VLAN_TAG_CTRL_OB_SHIFT          (0U)
#define GMAC_MAC_VLAN_TAG_CTRL_OB_WIDTH          (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_OB(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_OB_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_OB_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_CT_MASK           (0x2U)
#define GMAC_MAC_VLAN_TAG_CTRL_CT_SHIFT          (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_CT_WIDTH          (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_CT(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_CT_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_CT_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_OFS_MASK          (0x7CU)
#define GMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT         (2U)
#define GMAC_MAC_VLAN_TAG_CTRL_OFS_WIDTH         (5U)
#define GMAC_MAC_VLAN_TAG_CTRL_OFS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_OFS_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_15_y_MASK (0xFF80U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_15_y_SHIFT (7U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_15_y_WIDTH (9U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_15_y(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_Reserved_15_y_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_Reserved_15_y_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_ETV_MASK          (0x10000U)
#define GMAC_MAC_VLAN_TAG_CTRL_ETV_SHIFT         (16U)
#define GMAC_MAC_VLAN_TAG_CTRL_ETV_WIDTH         (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_ETV(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_VTIM_MASK         (0x20000U)
#define GMAC_MAC_VLAN_TAG_CTRL_VTIM_SHIFT        (17U)
#define GMAC_MAC_VLAN_TAG_CTRL_VTIM_WIDTH        (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_VTIM(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_VTIM_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_VTIM_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_ESVL_MASK         (0x40000U)
#define GMAC_MAC_VLAN_TAG_CTRL_ESVL_SHIFT        (18U)
#define GMAC_MAC_VLAN_TAG_CTRL_ESVL_WIDTH        (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_ESVL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_ESVL_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_ESVL_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_ERSVLM_MASK       (0x80000U)
#define GMAC_MAC_VLAN_TAG_CTRL_ERSVLM_SHIFT      (19U)
#define GMAC_MAC_VLAN_TAG_CTRL_ERSVLM_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_ERSVLM(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_DOVLTC_MASK       (0x100000U)
#define GMAC_MAC_VLAN_TAG_CTRL_DOVLTC_SHIFT      (20U)
#define GMAC_MAC_VLAN_TAG_CTRL_DOVLTC_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_DOVLTC(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_EVLS_MASK         (0x600000U)
#define GMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT        (21U)
#define GMAC_MAC_VLAN_TAG_CTRL_EVLS_WIDTH        (2U)
#define GMAC_MAC_VLAN_TAG_CTRL_EVLS(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_EVLS_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_23_MASK  (0x800000U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_23_SHIFT (23U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_23_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_23(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_Reserved_23_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_Reserved_23_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_EVLRXS_MASK       (0x1000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_EVLRXS_SHIFT      (24U)
#define GMAC_MAC_VLAN_TAG_CTRL_EVLRXS_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_EVLRXS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_EVLRXS_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_EVLRXS_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_VTHM_MASK         (0x2000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_VTHM_SHIFT        (25U)
#define GMAC_MAC_VLAN_TAG_CTRL_VTHM_WIDTH        (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_VTHM(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_VTHM_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_VTHM_MASK)

