zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_VLAN_TAG_CTRL_EDVLP_MASK        (0x4000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_EDVLP_SHIFT       (26U)
#define GMAC_MAC_VLAN_TAG_CTRL_EDVLP_WIDTH       (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_EDVLP(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_EDVLP_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_EDVLP_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_ERIVLT_MASK       (0x8000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_ERIVLT_SHIFT      (27U)
#define GMAC_MAC_VLAN_TAG_CTRL_ERIVLT_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_ERIVLT(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_EIVLS_MASK        (0x30000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT       (28U)
#define GMAC_MAC_VLAN_TAG_CTRL_EIVLS_WIDTH       (2U)
#define GMAC_MAC_VLAN_TAG_CTRL_EIVLS(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_EIVLS_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_30_MASK  (0x40000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_30_SHIFT (30U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_30_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_Reserved_30(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_Reserved_30_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_Reserved_30_MASK)

#define GMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_MASK      (0x80000000U)
#define GMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_SHIFT     (31U)
#define GMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_CTRL_EIVLRXS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_SHIFT)) & GMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_DATA -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_DATA_VID_MASK          (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_DATA_VID_SHIFT         (0U)
#define GMAC_MAC_VLAN_TAG_DATA_VID_WIDTH         (16U)
#define GMAC_MAC_VLAN_TAG_DATA_VID(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_VID_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_VEN_MASK          (0x10000U)
#define GMAC_MAC_VLAN_TAG_DATA_VEN_SHIFT         (16U)
#define GMAC_MAC_VLAN_TAG_DATA_VEN_WIDTH         (1U)
#define GMAC_MAC_VLAN_TAG_DATA_VEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_ETV_MASK          (0x20000U)
#define GMAC_MAC_VLAN_TAG_DATA_ETV_SHIFT         (17U)
#define GMAC_MAC_VLAN_TAG_DATA_ETV_WIDTH         (1U)
#define GMAC_MAC_VLAN_TAG_DATA_ETV(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_DOVLTC_MASK       (0x40000U)
#define GMAC_MAC_VLAN_TAG_DATA_DOVLTC_SHIFT      (18U)
#define GMAC_MAC_VLAN_TAG_DATA_DOVLTC_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_DATA_DOVLTC(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_ERSVLM_MASK       (0x80000U)
#define GMAC_MAC_VLAN_TAG_DATA_ERSVLM_SHIFT      (19U)
#define GMAC_MAC_VLAN_TAG_DATA_ERSVLM_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_DATA_ERSVLM(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_ERIVLT_MASK       (0x100000U)
#define GMAC_MAC_VLAN_TAG_DATA_ERIVLT_SHIFT      (20U)
#define GMAC_MAC_VLAN_TAG_DATA_ERIVLT_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_DATA_ERIVLT(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_DATA_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_DATA_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_DATA_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_DMACHEN_MASK      (0x1000000U)
#define GMAC_MAC_VLAN_TAG_DATA_DMACHEN_SHIFT     (24U)
#define GMAC_MAC_VLAN_TAG_DATA_DMACHEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_DATA_DMACHEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_DMACHN_MASK       (0x6000000U)
#define GMAC_MAC_VLAN_TAG_DATA_DMACHN_SHIFT      (25U)
#define GMAC_MAC_VLAN_TAG_DATA_DMACHN_WIDTH      (2U)
#define GMAC_MAC_VLAN_TAG_DATA_DMACHN(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_DATA_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_DATA_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_DATA_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_DATA_Reserved_31_y(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_DATA_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_DATA_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER0 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER0_VID_MASK       (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT      (0U)
#define GMAC_MAC_VLAN_TAG_FILTER0_VID_WIDTH      (16U)
#define GMAC_MAC_VLAN_TAG_FILTER0_VID(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_VEN_MASK       (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_VEN_SHIFT      (16U)
#define GMAC_MAC_VLAN_TAG_FILTER0_VEN_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_FILTER0_VEN(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_ETV_MASK       (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ETV_SHIFT      (17U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ETV_WIDTH      (1U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ETV(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_MASK    (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_SHIFT   (18U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_MASK    (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_SHIFT   (19U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_MASK    (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_SHIFT   (20U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_WIDTH   (1U)
#define GMAC_MAC_VLAN_TAG_FILTER0_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_MASK   (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_SHIFT  (24U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHN_MASK    (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHN_SHIFT   (25U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHN_WIDTH   (2U)
#define GMAC_MAC_VLAN_TAG_FILTER0_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER0_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER0_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER0_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER1 -  */
/*! @{ */

