zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_VLAN_TAG_FILTER15 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER15_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER15_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER15_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER15_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER15_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER15_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER15_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER15_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER15_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER15_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER15_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER16 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER16_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER16_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER16_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER16_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER16_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER16_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER16_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER16_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER16_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER16_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER16_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER17 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER17_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER17_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER17_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER17_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER17_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER17_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER17_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER17_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER17_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER17_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER17_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER17_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER17_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER17_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER17_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER17_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER17_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER17_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER17_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER17_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER17_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER17_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER17_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER17_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER17_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER17_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER17_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER17_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER17_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER17_ERSVLM_MASK)

