zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER21_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER21_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER21_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER21_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER21_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER21_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER22 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER22_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER22_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER22_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER22_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER22_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER22_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER22_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER22_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER22_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER22_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER22_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER23 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER23_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER23_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER23_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER23_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER23_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER23_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER23_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER23_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER23_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER23_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER23_Reserved_23_21_MASK)

