zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER26_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER26_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER26_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER26_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER26_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER26_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER26_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER26_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER26_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER26_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER26_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER27 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER27_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER27_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER27_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER27_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER27_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER27_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER27_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER27_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER27_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER27_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER27_DMACHEN_MASK)

