zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_VLAN_TAG_FILTER30_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER30_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER30_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER30_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER30_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER30_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER31 -  */
/*! @{ */

#define GMAC_MAC_VLAN_TAG_FILTER31_VID_MASK      (0xFFFFU)
#define GMAC_MAC_VLAN_TAG_FILTER31_VID_SHIFT     (0U)
#define GMAC_MAC_VLAN_TAG_FILTER31_VID_WIDTH     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER31_VID(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_VID_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_VID_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_VEN_MASK      (0x10000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_VEN_SHIFT     (16U)
#define GMAC_MAC_VLAN_TAG_FILTER31_VEN_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER31_VEN(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_VEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_VEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_ETV_MASK      (0x20000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ETV_SHIFT     (17U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ETV_WIDTH     (1U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ETV(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_ETV_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_ETV_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_DOVLTC_MASK   (0x40000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DOVLTC_SHIFT  (18U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DOVLTC_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DOVLTC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_DOVLTC_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_DOVLTC_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_ERSVLM_MASK   (0x80000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ERSVLM_SHIFT  (19U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ERSVLM_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ERSVLM(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_ERSVLM_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_ERSVLM_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_ERIVLT_MASK   (0x100000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ERIVLT_SHIFT  (20U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ERIVLT_WIDTH  (1U)
#define GMAC_MAC_VLAN_TAG_FILTER31_ERIVLT(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_ERIVLT_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_ERIVLT_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_23_21_SHIFT (21U)
#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_23_21_WIDTH (3U)
#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_23_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_Reserved_23_21_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_Reserved_23_21_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHEN_MASK  (0x1000000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHEN_SHIFT (24U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHEN_WIDTH (1U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_DMACHEN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_DMACHEN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHN_MASK   (0x6000000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHN_SHIFT  (25U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHN_WIDTH  (2U)
#define GMAC_MAC_VLAN_TAG_FILTER31_DMACHN(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_DMACHN_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_DMACHN_MASK)

#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_31_y_MASK (0xF8000000U)
#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_31_y_SHIFT (27U)
#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_31_y_WIDTH (5U)
#define GMAC_MAC_VLAN_TAG_FILTER31_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_TAG_FILTER31_Reserved_31_y_SHIFT)) & GMAC_MAC_VLAN_TAG_FILTER31_Reserved_31_y_MASK)
/*! @} */

/*! @name MAC_VLAN_HASH_TABLE -  */
/*! @{ */

#define GMAC_MAC_VLAN_HASH_TABLE_VLHT_MASK       (0xFFFFU)
#define GMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT      (0U)
#define GMAC_MAC_VLAN_HASH_TABLE_VLHT_WIDTH      (16U)
#define GMAC_MAC_VLAN_HASH_TABLE_VLHT(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT)) & GMAC_MAC_VLAN_HASH_TABLE_VLHT_MASK)

#define GMAC_MAC_VLAN_HASH_TABLE_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_MAC_VLAN_HASH_TABLE_Reserved_31_16_SHIFT (16U)
#define GMAC_MAC_VLAN_HASH_TABLE_Reserved_31_16_WIDTH (16U)
#define GMAC_MAC_VLAN_HASH_TABLE_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_HASH_TABLE_Reserved_31_16_SHIFT)) & GMAC_MAC_VLAN_HASH_TABLE_Reserved_31_16_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL -  */
/*! @{ */

