zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_VLAN_INCL_VLT_MASK              (0xFFFFU)
#define GMAC_MAC_VLAN_INCL_VLT_SHIFT             (0U)
#define GMAC_MAC_VLAN_INCL_VLT_WIDTH             (16U)
#define GMAC_MAC_VLAN_INCL_VLT(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL_VLT_MASK)

#define GMAC_MAC_VLAN_INCL_VLC_MASK              (0x30000U)
#define GMAC_MAC_VLAN_INCL_VLC_SHIFT             (16U)
#define GMAC_MAC_VLAN_INCL_VLC_WIDTH             (2U)
#define GMAC_MAC_VLAN_INCL_VLC(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_VLC_SHIFT)) & GMAC_MAC_VLAN_INCL_VLC_MASK)

#define GMAC_MAC_VLAN_INCL_VLP_MASK              (0x40000U)
#define GMAC_MAC_VLAN_INCL_VLP_SHIFT             (18U)
#define GMAC_MAC_VLAN_INCL_VLP_WIDTH             (1U)
#define GMAC_MAC_VLAN_INCL_VLP(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_VLP_SHIFT)) & GMAC_MAC_VLAN_INCL_VLP_MASK)

#define GMAC_MAC_VLAN_INCL_CSVL_MASK             (0x80000U)
#define GMAC_MAC_VLAN_INCL_CSVL_SHIFT            (19U)
#define GMAC_MAC_VLAN_INCL_CSVL_WIDTH            (1U)
#define GMAC_MAC_VLAN_INCL_CSVL(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL_VLTI_MASK             (0x100000U)
#define GMAC_MAC_VLAN_INCL_VLTI_SHIFT            (20U)
#define GMAC_MAC_VLAN_INCL_VLTI_WIDTH            (1U)
#define GMAC_MAC_VLAN_INCL_VLTI(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_VLTI_SHIFT)) & GMAC_MAC_VLAN_INCL_VLTI_MASK)

#define GMAC_MAC_VLAN_INCL_CBTI_MASK             (0x200000U)
#define GMAC_MAC_VLAN_INCL_CBTI_SHIFT            (21U)
#define GMAC_MAC_VLAN_INCL_CBTI_WIDTH            (1U)
#define GMAC_MAC_VLAN_INCL_CBTI(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_CBTI_SHIFT)) & GMAC_MAC_VLAN_INCL_CBTI_MASK)

#define GMAC_MAC_VLAN_INCL_Reserved_23_22_MASK   (0xC00000U)
#define GMAC_MAC_VLAN_INCL_Reserved_23_22_SHIFT  (22U)
#define GMAC_MAC_VLAN_INCL_Reserved_23_22_WIDTH  (2U)
#define GMAC_MAC_VLAN_INCL_Reserved_23_22(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_Reserved_23_22_SHIFT)) & GMAC_MAC_VLAN_INCL_Reserved_23_22_MASK)

#define GMAC_MAC_VLAN_INCL_ADDR_MASK             (0x3000000U)
#define GMAC_MAC_VLAN_INCL_ADDR_SHIFT            (24U)
#define GMAC_MAC_VLAN_INCL_ADDR_WIDTH            (2U)
#define GMAC_MAC_VLAN_INCL_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_ADDR_SHIFT)) & GMAC_MAC_VLAN_INCL_ADDR_MASK)

#define GMAC_MAC_VLAN_INCL_Reserved_29_y_MASK    (0x3C000000U)
#define GMAC_MAC_VLAN_INCL_Reserved_29_y_SHIFT   (26U)
#define GMAC_MAC_VLAN_INCL_Reserved_29_y_WIDTH   (4U)
#define GMAC_MAC_VLAN_INCL_Reserved_29_y(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_Reserved_29_y_SHIFT)) & GMAC_MAC_VLAN_INCL_Reserved_29_y_MASK)

#define GMAC_MAC_VLAN_INCL_RDWR_MASK             (0x40000000U)
#define GMAC_MAC_VLAN_INCL_RDWR_SHIFT            (30U)
#define GMAC_MAC_VLAN_INCL_RDWR_WIDTH            (1U)
#define GMAC_MAC_VLAN_INCL_RDWR(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_RDWR_SHIFT)) & GMAC_MAC_VLAN_INCL_RDWR_MASK)

#define GMAC_MAC_VLAN_INCL_BUSY_MASK             (0x80000000U)
#define GMAC_MAC_VLAN_INCL_BUSY_SHIFT            (31U)
#define GMAC_MAC_VLAN_INCL_BUSY_WIDTH            (1U)
#define GMAC_MAC_VLAN_INCL_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL_BUSY_SHIFT)) & GMAC_MAC_VLAN_INCL_BUSY_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL0 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL0_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL0_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL0_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL0_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL0_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL0_VLT_MASK)

#define GMAC_MAC_VLAN_INCL0_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL0_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL0_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL0_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL0_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL0_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL0_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL0_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL0_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL0_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL0_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL0_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL0_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL0_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL0_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL0_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL0_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL0_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL1 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL1_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL1_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL1_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL1_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL1_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL1_VLT_MASK)

#define GMAC_MAC_VLAN_INCL1_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL1_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL1_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL1_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL1_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL1_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL1_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL1_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL1_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL1_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL1_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL1_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL1_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL1_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL1_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL1_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL1_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL1_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL2 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL2_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL2_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL2_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL2_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL2_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL2_VLT_MASK)

#define GMAC_MAC_VLAN_INCL2_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL2_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL2_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL2_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL2_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL2_Reserved_18_16_MASK)

