zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_VLAN_INCL7 -  */
/*! @{ */

#define GMAC_MAC_VLAN_INCL7_VLT_MASK             (0xFFFFU)
#define GMAC_MAC_VLAN_INCL7_VLT_SHIFT            (0U)
#define GMAC_MAC_VLAN_INCL7_VLT_WIDTH            (16U)
#define GMAC_MAC_VLAN_INCL7_VLT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL7_VLT_SHIFT)) & GMAC_MAC_VLAN_INCL7_VLT_MASK)

#define GMAC_MAC_VLAN_INCL7_Reserved_18_16_MASK  (0x70000U)
#define GMAC_MAC_VLAN_INCL7_Reserved_18_16_SHIFT (16U)
#define GMAC_MAC_VLAN_INCL7_Reserved_18_16_WIDTH (3U)
#define GMAC_MAC_VLAN_INCL7_Reserved_18_16(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL7_Reserved_18_16_SHIFT)) & GMAC_MAC_VLAN_INCL7_Reserved_18_16_MASK)

#define GMAC_MAC_VLAN_INCL7_CSVL_MASK            (0x80000U)
#define GMAC_MAC_VLAN_INCL7_CSVL_SHIFT           (19U)
#define GMAC_MAC_VLAN_INCL7_CSVL_WIDTH           (1U)
#define GMAC_MAC_VLAN_INCL7_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL7_CSVL_SHIFT)) & GMAC_MAC_VLAN_INCL7_CSVL_MASK)

#define GMAC_MAC_VLAN_INCL7_Reserved_31_20_MASK  (0xFFF00000U)
#define GMAC_MAC_VLAN_INCL7_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_VLAN_INCL7_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_VLAN_INCL7_Reserved_31_20(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_VLAN_INCL7_Reserved_31_20_SHIFT)) & GMAC_MAC_VLAN_INCL7_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_INNER_VLAN_INCL -  */
/*! @{ */

#define GMAC_MAC_INNER_VLAN_INCL_VLT_MASK        (0xFFFFU)
#define GMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT       (0U)
#define GMAC_MAC_INNER_VLAN_INCL_VLT_WIDTH       (16U)
#define GMAC_MAC_INNER_VLAN_INCL_VLT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT)) & GMAC_MAC_INNER_VLAN_INCL_VLT_MASK)

#define GMAC_MAC_INNER_VLAN_INCL_VLC_MASK        (0x30000U)
#define GMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT       (16U)
#define GMAC_MAC_INNER_VLAN_INCL_VLC_WIDTH       (2U)
#define GMAC_MAC_INNER_VLAN_INCL_VLC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT)) & GMAC_MAC_INNER_VLAN_INCL_VLC_MASK)

#define GMAC_MAC_INNER_VLAN_INCL_VLP_MASK        (0x40000U)
#define GMAC_MAC_INNER_VLAN_INCL_VLP_SHIFT       (18U)
#define GMAC_MAC_INNER_VLAN_INCL_VLP_WIDTH       (1U)
#define GMAC_MAC_INNER_VLAN_INCL_VLP(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INNER_VLAN_INCL_VLP_SHIFT)) & GMAC_MAC_INNER_VLAN_INCL_VLP_MASK)

#define GMAC_MAC_INNER_VLAN_INCL_CSVL_MASK       (0x80000U)
#define GMAC_MAC_INNER_VLAN_INCL_CSVL_SHIFT      (19U)
#define GMAC_MAC_INNER_VLAN_INCL_CSVL_WIDTH      (1U)
#define GMAC_MAC_INNER_VLAN_INCL_CSVL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INNER_VLAN_INCL_CSVL_SHIFT)) & GMAC_MAC_INNER_VLAN_INCL_CSVL_MASK)

#define GMAC_MAC_INNER_VLAN_INCL_VLTI_MASK       (0x100000U)
#define GMAC_MAC_INNER_VLAN_INCL_VLTI_SHIFT      (20U)
#define GMAC_MAC_INNER_VLAN_INCL_VLTI_WIDTH      (1U)
#define GMAC_MAC_INNER_VLAN_INCL_VLTI(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INNER_VLAN_INCL_VLTI_SHIFT)) & GMAC_MAC_INNER_VLAN_INCL_VLTI_MASK)

#define GMAC_MAC_INNER_VLAN_INCL_Reserved_31_21_MASK (0xFFE00000U)
#define GMAC_MAC_INNER_VLAN_INCL_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_INNER_VLAN_INCL_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_INNER_VLAN_INCL_Reserved_31_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_INNER_VLAN_INCL_Reserved_31_21_SHIFT)) & GMAC_MAC_INNER_VLAN_INCL_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_Q0_TX_FLOW_CTRL -  */
/*! @{ */

#define GMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_MASK    (0x1U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_SHIFT   (0U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_WIDTH   (1U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_FCB_BPA_MASK)

#define GMAC_MAC_Q0_TX_FLOW_CTRL_TFE_MASK        (0x2U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_TFE_SHIFT       (1U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_TFE_WIDTH       (1U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_TFE(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_TFE_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_TFE_MASK)

#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_3_2_MASK (0xCU)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_3_2_SHIFT (2U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_3_2_WIDTH (2U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_3_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_3_2_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_3_2_MASK)

#define GMAC_MAC_Q0_TX_FLOW_CTRL_PLT_MASK        (0x70U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_PLT_SHIFT       (4U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_PLT_WIDTH       (3U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_PLT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_PLT_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_PLT_MASK)

#define GMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ_MASK       (0x80U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ_SHIFT      (7U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ_WIDTH      (1U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_DZPQ_MASK)

#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_15_8_MASK (0xFF00U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_15_8_SHIFT (8U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_15_8_WIDTH (8U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_15_8_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_Reserved_15_8_MASK)

#define GMAC_MAC_Q0_TX_FLOW_CTRL_PT_MASK         (0xFFFF0000U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_PT_SHIFT        (16U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_PT_WIDTH        (16U)
#define GMAC_MAC_Q0_TX_FLOW_CTRL_PT(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q0_TX_FLOW_CTRL_PT_SHIFT)) & GMAC_MAC_Q0_TX_FLOW_CTRL_PT_MASK)
/*! @} */

/*! @name MAC_Q1_TX_FLOW_CTRL -  */
/*! @{ */

#define GMAC_MAC_Q1_TX_FLOW_CTRL_FCB_BPA_MASK    (0x1U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_FCB_BPA_SHIFT   (0U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_FCB_BPA_WIDTH   (1U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_FCB_BPA(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_FCB_BPA_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_FCB_BPA_MASK)

