zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_Q1_TX_FLOW_CTRL_TFE_MASK        (0x2U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_TFE_SHIFT       (1U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_TFE_WIDTH       (1U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_TFE(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_TFE_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_TFE_MASK)

#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_3_2_MASK (0xCU)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_3_2_SHIFT (2U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_3_2_WIDTH (2U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_3_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_3_2_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_3_2_MASK)

#define GMAC_MAC_Q1_TX_FLOW_CTRL_PLT_MASK        (0x70U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_PLT_SHIFT       (4U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_PLT_WIDTH       (3U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_PLT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_PLT_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_PLT_MASK)

#define GMAC_MAC_Q1_TX_FLOW_CTRL_DZPQ_MASK       (0x80U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_DZPQ_SHIFT      (7U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_DZPQ_WIDTH      (1U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_DZPQ(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_DZPQ_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_DZPQ_MASK)

#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_15_8_MASK (0xFF00U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_15_8_SHIFT (8U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_15_8_WIDTH (8U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_15_8_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_Reserved_15_8_MASK)

#define GMAC_MAC_Q1_TX_FLOW_CTRL_PT_MASK         (0xFFFF0000U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_PT_SHIFT        (16U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_PT_WIDTH        (16U)
#define GMAC_MAC_Q1_TX_FLOW_CTRL_PT(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q1_TX_FLOW_CTRL_PT_SHIFT)) & GMAC_MAC_Q1_TX_FLOW_CTRL_PT_MASK)
/*! @} */

/*! @name MAC_Q2_TX_FLOW_CTRL -  */
/*! @{ */

#define GMAC_MAC_Q2_TX_FLOW_CTRL_FCB_BPA_MASK    (0x1U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_FCB_BPA_SHIFT   (0U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_FCB_BPA_WIDTH   (1U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_FCB_BPA(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_FCB_BPA_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_FCB_BPA_MASK)

#define GMAC_MAC_Q2_TX_FLOW_CTRL_TFE_MASK        (0x2U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_TFE_SHIFT       (1U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_TFE_WIDTH       (1U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_TFE(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_TFE_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_TFE_MASK)

#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_3_2_MASK (0xCU)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_3_2_SHIFT (2U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_3_2_WIDTH (2U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_3_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_3_2_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_3_2_MASK)

#define GMAC_MAC_Q2_TX_FLOW_CTRL_PLT_MASK        (0x70U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_PLT_SHIFT       (4U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_PLT_WIDTH       (3U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_PLT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_PLT_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_PLT_MASK)

#define GMAC_MAC_Q2_TX_FLOW_CTRL_DZPQ_MASK       (0x80U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_DZPQ_SHIFT      (7U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_DZPQ_WIDTH      (1U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_DZPQ(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_DZPQ_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_DZPQ_MASK)

#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_15_8_MASK (0xFF00U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_15_8_SHIFT (8U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_15_8_WIDTH (8U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_15_8_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_Reserved_15_8_MASK)

#define GMAC_MAC_Q2_TX_FLOW_CTRL_PT_MASK         (0xFFFF0000U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_PT_SHIFT        (16U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_PT_WIDTH        (16U)
#define GMAC_MAC_Q2_TX_FLOW_CTRL_PT(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_Q2_TX_FLOW_CTRL_PT_SHIFT)) & GMAC_MAC_Q2_TX_FLOW_CTRL_PT_MASK)
/*! @} */

/*! @name MAC_RX_FLOW_CTRL -  */
/*! @{ */

#define GMAC_MAC_RX_FLOW_CTRL_RFE_MASK           (0x1U)
#define GMAC_MAC_RX_FLOW_CTRL_RFE_SHIFT          (0U)
#define GMAC_MAC_RX_FLOW_CTRL_RFE_WIDTH          (1U)
#define GMAC_MAC_RX_FLOW_CTRL_RFE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_FLOW_CTRL_RFE_SHIFT)) & GMAC_MAC_RX_FLOW_CTRL_RFE_MASK)

#define GMAC_MAC_RX_FLOW_CTRL_UP_MASK            (0x2U)
#define GMAC_MAC_RX_FLOW_CTRL_UP_SHIFT           (1U)
#define GMAC_MAC_RX_FLOW_CTRL_UP_WIDTH           (1U)
#define GMAC_MAC_RX_FLOW_CTRL_UP(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_FLOW_CTRL_UP_SHIFT)) & GMAC_MAC_RX_FLOW_CTRL_UP_MASK)

#define GMAC_MAC_RX_FLOW_CTRL_Reserved_7_2_MASK  (0xFCU)
#define GMAC_MAC_RX_FLOW_CTRL_Reserved_7_2_SHIFT (2U)
#define GMAC_MAC_RX_FLOW_CTRL_Reserved_7_2_WIDTH (6U)
#define GMAC_MAC_RX_FLOW_CTRL_Reserved_7_2(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_FLOW_CTRL_Reserved_7_2_SHIFT)) & GMAC_MAC_RX_FLOW_CTRL_Reserved_7_2_MASK)

#define GMAC_MAC_RX_FLOW_CTRL_PFCE_MASK          (0x100U)
#define GMAC_MAC_RX_FLOW_CTRL_PFCE_SHIFT         (8U)
#define GMAC_MAC_RX_FLOW_CTRL_PFCE_WIDTH         (1U)
#define GMAC_MAC_RX_FLOW_CTRL_PFCE(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_FLOW_CTRL_PFCE_SHIFT)) & GMAC_MAC_RX_FLOW_CTRL_PFCE_MASK)

#define GMAC_MAC_RX_FLOW_CTRL_Reserved_31_9_MASK (0xFFFFFE00U)
#define GMAC_MAC_RX_FLOW_CTRL_Reserved_31_9_SHIFT (9U)
#define GMAC_MAC_RX_FLOW_CTRL_Reserved_31_9_WIDTH (23U)
#define GMAC_MAC_RX_FLOW_CTRL_Reserved_31_9(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RX_FLOW_CTRL_Reserved_31_9_SHIFT)) & GMAC_MAC_RX_FLOW_CTRL_Reserved_31_9_MASK)
/*! @} */

/*! @name MAC_RXQ_CTRL4 -  */
/*! @{ */

#define GMAC_MAC_RXQ_CTRL4_UFFQE_MASK            (0x1U)
#define GMAC_MAC_RXQ_CTRL4_UFFQE_SHIFT           (0U)
#define GMAC_MAC_RXQ_CTRL4_UFFQE_WIDTH           (1U)
#define GMAC_MAC_RXQ_CTRL4_UFFQE(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_UFFQE_SHIFT)) & GMAC_MAC_RXQ_CTRL4_UFFQE_MASK)

#define GMAC_MAC_RXQ_CTRL4_UFFQ_MASK             (0x6U)
#define GMAC_MAC_RXQ_CTRL4_UFFQ_SHIFT            (1U)
#define GMAC_MAC_RXQ_CTRL4_UFFQ_WIDTH            (2U)
#define GMAC_MAC_RXQ_CTRL4_UFFQ(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_RXQ_CTRL4_UFFQ_SHIFT)) & GMAC_MAC_RXQ_CTRL4_UFFQ_MASK)

