zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_HW_FEATURE0_RXCOESEL_MASK       (0x10000U)
#define GMAC_MAC_HW_FEATURE0_RXCOESEL_SHIFT      (16U)
#define GMAC_MAC_HW_FEATURE0_RXCOESEL_WIDTH      (1U)
#define GMAC_MAC_HW_FEATURE0_RXCOESEL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_RXCOESEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_RXCOESEL_MASK)

#define GMAC_MAC_HW_FEATURE0_Reserved_17_MASK    (0x20000U)
#define GMAC_MAC_HW_FEATURE0_Reserved_17_SHIFT   (17U)
#define GMAC_MAC_HW_FEATURE0_Reserved_17_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE0_Reserved_17(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_Reserved_17_SHIFT)) & GMAC_MAC_HW_FEATURE0_Reserved_17_MASK)

#define GMAC_MAC_HW_FEATURE0_ADDMACADRSEL_MASK   (0x7C0000U)
#define GMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT  (18U)
#define GMAC_MAC_HW_FEATURE0_ADDMACADRSEL_WIDTH  (5U)
#define GMAC_MAC_HW_FEATURE0_ADDMACADRSEL(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_ADDMACADRSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_ADDMACADRSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_MACADR32SEL_MASK    (0x800000U)
#define GMAC_MAC_HW_FEATURE0_MACADR32SEL_SHIFT   (23U)
#define GMAC_MAC_HW_FEATURE0_MACADR32SEL_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE0_MACADR32SEL(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_MACADR32SEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_MACADR32SEL_MASK)

#define GMAC_MAC_HW_FEATURE0_MACADR64SEL_MASK    (0x1000000U)
#define GMAC_MAC_HW_FEATURE0_MACADR64SEL_SHIFT   (24U)
#define GMAC_MAC_HW_FEATURE0_MACADR64SEL_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE0_MACADR64SEL(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_MACADR64SEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_MACADR64SEL_MASK)

#define GMAC_MAC_HW_FEATURE0_TSSTSSEL_MASK       (0x6000000U)
#define GMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT      (25U)
#define GMAC_MAC_HW_FEATURE0_TSSTSSEL_WIDTH      (2U)
#define GMAC_MAC_HW_FEATURE0_TSSTSSEL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_TSSTSSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_TSSTSSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_SAVLANINS_MASK      (0x8000000U)
#define GMAC_MAC_HW_FEATURE0_SAVLANINS_SHIFT     (27U)
#define GMAC_MAC_HW_FEATURE0_SAVLANINS_WIDTH     (1U)
#define GMAC_MAC_HW_FEATURE0_SAVLANINS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_SAVLANINS_SHIFT)) & GMAC_MAC_HW_FEATURE0_SAVLANINS_MASK)

#define GMAC_MAC_HW_FEATURE0_ACTPHYSEL_MASK      (0x70000000U)
#define GMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT     (28U)
#define GMAC_MAC_HW_FEATURE0_ACTPHYSEL_WIDTH     (3U)
#define GMAC_MAC_HW_FEATURE0_ACTPHYSEL(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_ACTPHYSEL_SHIFT)) & GMAC_MAC_HW_FEATURE0_ACTPHYSEL_MASK)

#define GMAC_MAC_HW_FEATURE0_Reserved_31_MASK    (0x80000000U)
#define GMAC_MAC_HW_FEATURE0_Reserved_31_SHIFT   (31U)
#define GMAC_MAC_HW_FEATURE0_Reserved_31_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE0_Reserved_31(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE0_Reserved_31_SHIFT)) & GMAC_MAC_HW_FEATURE0_Reserved_31_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE1 -  */
/*! @{ */

#define GMAC_MAC_HW_FEATURE1_RXFIFOSIZE_MASK     (0x1FU)
#define GMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT    (0U)
#define GMAC_MAC_HW_FEATURE1_RXFIFOSIZE_WIDTH    (5U)
#define GMAC_MAC_HW_FEATURE1_RXFIFOSIZE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_RXFIFOSIZE_SHIFT)) & GMAC_MAC_HW_FEATURE1_RXFIFOSIZE_MASK)

#define GMAC_MAC_HW_FEATURE1_SPRAM_MASK          (0x20U)
#define GMAC_MAC_HW_FEATURE1_SPRAM_SHIFT         (5U)
#define GMAC_MAC_HW_FEATURE1_SPRAM_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_SPRAM(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_SPRAM_SHIFT)) & GMAC_MAC_HW_FEATURE1_SPRAM_MASK)

#define GMAC_MAC_HW_FEATURE1_TXFIFOSIZE_MASK     (0x7C0U)
#define GMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT    (6U)
#define GMAC_MAC_HW_FEATURE1_TXFIFOSIZE_WIDTH    (5U)
#define GMAC_MAC_HW_FEATURE1_TXFIFOSIZE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_TXFIFOSIZE_SHIFT)) & GMAC_MAC_HW_FEATURE1_TXFIFOSIZE_MASK)

#define GMAC_MAC_HW_FEATURE1_OSTEN_MASK          (0x800U)
#define GMAC_MAC_HW_FEATURE1_OSTEN_SHIFT         (11U)
#define GMAC_MAC_HW_FEATURE1_OSTEN_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_OSTEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_OSTEN_SHIFT)) & GMAC_MAC_HW_FEATURE1_OSTEN_MASK)

#define GMAC_MAC_HW_FEATURE1_PTOEN_MASK          (0x1000U)
#define GMAC_MAC_HW_FEATURE1_PTOEN_SHIFT         (12U)
#define GMAC_MAC_HW_FEATURE1_PTOEN_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_PTOEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_PTOEN_SHIFT)) & GMAC_MAC_HW_FEATURE1_PTOEN_MASK)

#define GMAC_MAC_HW_FEATURE1_ADVTHWORD_MASK      (0x2000U)
#define GMAC_MAC_HW_FEATURE1_ADVTHWORD_SHIFT     (13U)
#define GMAC_MAC_HW_FEATURE1_ADVTHWORD_WIDTH     (1U)
#define GMAC_MAC_HW_FEATURE1_ADVTHWORD(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_ADVTHWORD_SHIFT)) & GMAC_MAC_HW_FEATURE1_ADVTHWORD_MASK)

#define GMAC_MAC_HW_FEATURE1_ADDR64_MASK         (0xC000U)
#define GMAC_MAC_HW_FEATURE1_ADDR64_SHIFT        (14U)
#define GMAC_MAC_HW_FEATURE1_ADDR64_WIDTH        (2U)
#define GMAC_MAC_HW_FEATURE1_ADDR64(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_ADDR64_SHIFT)) & GMAC_MAC_HW_FEATURE1_ADDR64_MASK)

#define GMAC_MAC_HW_FEATURE1_DCBEN_MASK          (0x10000U)
#define GMAC_MAC_HW_FEATURE1_DCBEN_SHIFT         (16U)
#define GMAC_MAC_HW_FEATURE1_DCBEN_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_DCBEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_DCBEN_SHIFT)) & GMAC_MAC_HW_FEATURE1_DCBEN_MASK)

#define GMAC_MAC_HW_FEATURE1_SPHEN_MASK          (0x20000U)
#define GMAC_MAC_HW_FEATURE1_SPHEN_SHIFT         (17U)
#define GMAC_MAC_HW_FEATURE1_SPHEN_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_SPHEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_SPHEN_SHIFT)) & GMAC_MAC_HW_FEATURE1_SPHEN_MASK)

#define GMAC_MAC_HW_FEATURE1_TSOEN_MASK          (0x40000U)
#define GMAC_MAC_HW_FEATURE1_TSOEN_SHIFT         (18U)
#define GMAC_MAC_HW_FEATURE1_TSOEN_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_TSOEN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_TSOEN_SHIFT)) & GMAC_MAC_HW_FEATURE1_TSOEN_MASK)

#define GMAC_MAC_HW_FEATURE1_DBGMEMA_MASK        (0x80000U)
#define GMAC_MAC_HW_FEATURE1_DBGMEMA_SHIFT       (19U)
#define GMAC_MAC_HW_FEATURE1_DBGMEMA_WIDTH       (1U)
#define GMAC_MAC_HW_FEATURE1_DBGMEMA(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_DBGMEMA_SHIFT)) & GMAC_MAC_HW_FEATURE1_DBGMEMA_MASK)

#define GMAC_MAC_HW_FEATURE1_AVSEL_MASK          (0x100000U)
#define GMAC_MAC_HW_FEATURE1_AVSEL_SHIFT         (20U)
#define GMAC_MAC_HW_FEATURE1_AVSEL_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE1_AVSEL(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_AVSEL_SHIFT)) & GMAC_MAC_HW_FEATURE1_AVSEL_MASK)

#define GMAC_MAC_HW_FEATURE1_RAVSEL_MASK         (0x200000U)
#define GMAC_MAC_HW_FEATURE1_RAVSEL_SHIFT        (21U)
#define GMAC_MAC_HW_FEATURE1_RAVSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE1_RAVSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_RAVSEL_SHIFT)) & GMAC_MAC_HW_FEATURE1_RAVSEL_MASK)

#define GMAC_MAC_HW_FEATURE1_Reserved_22_MASK    (0x400000U)
#define GMAC_MAC_HW_FEATURE1_Reserved_22_SHIFT   (22U)
#define GMAC_MAC_HW_FEATURE1_Reserved_22_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE1_Reserved_22(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_Reserved_22_SHIFT)) & GMAC_MAC_HW_FEATURE1_Reserved_22_MASK)

