zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_HW_FEATURE1_POUOST_MASK         (0x800000U)
#define GMAC_MAC_HW_FEATURE1_POUOST_SHIFT        (23U)
#define GMAC_MAC_HW_FEATURE1_POUOST_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE1_POUOST(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_POUOST_SHIFT)) & GMAC_MAC_HW_FEATURE1_POUOST_MASK)

#define GMAC_MAC_HW_FEATURE1_HASHTBLSZ_MASK      (0x3000000U)
#define GMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT     (24U)
#define GMAC_MAC_HW_FEATURE1_HASHTBLSZ_WIDTH     (2U)
#define GMAC_MAC_HW_FEATURE1_HASHTBLSZ(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_HASHTBLSZ_SHIFT)) & GMAC_MAC_HW_FEATURE1_HASHTBLSZ_MASK)

#define GMAC_MAC_HW_FEATURE1_Reserved_26_MASK    (0x4000000U)
#define GMAC_MAC_HW_FEATURE1_Reserved_26_SHIFT   (26U)
#define GMAC_MAC_HW_FEATURE1_Reserved_26_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE1_Reserved_26(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_Reserved_26_SHIFT)) & GMAC_MAC_HW_FEATURE1_Reserved_26_MASK)

#define GMAC_MAC_HW_FEATURE1_L3L4FNUM_MASK       (0x78000000U)
#define GMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT      (27U)
#define GMAC_MAC_HW_FEATURE1_L3L4FNUM_WIDTH      (4U)
#define GMAC_MAC_HW_FEATURE1_L3L4FNUM(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_L3L4FNUM_SHIFT)) & GMAC_MAC_HW_FEATURE1_L3L4FNUM_MASK)

#define GMAC_MAC_HW_FEATURE1_Reserved_31_MASK    (0x80000000U)
#define GMAC_MAC_HW_FEATURE1_Reserved_31_SHIFT   (31U)
#define GMAC_MAC_HW_FEATURE1_Reserved_31_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE1_Reserved_31(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE1_Reserved_31_SHIFT)) & GMAC_MAC_HW_FEATURE1_Reserved_31_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE2 -  */
/*! @{ */

#define GMAC_MAC_HW_FEATURE2_RXQCNT_MASK         (0xFU)
#define GMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT        (0U)
#define GMAC_MAC_HW_FEATURE2_RXQCNT_WIDTH        (4U)
#define GMAC_MAC_HW_FEATURE2_RXQCNT(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_RXQCNT_SHIFT)) & GMAC_MAC_HW_FEATURE2_RXQCNT_MASK)

#define GMAC_MAC_HW_FEATURE2_Reserved_5_4_MASK   (0x30U)
#define GMAC_MAC_HW_FEATURE2_Reserved_5_4_SHIFT  (4U)
#define GMAC_MAC_HW_FEATURE2_Reserved_5_4_WIDTH  (2U)
#define GMAC_MAC_HW_FEATURE2_Reserved_5_4(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_Reserved_5_4_SHIFT)) & GMAC_MAC_HW_FEATURE2_Reserved_5_4_MASK)

#define GMAC_MAC_HW_FEATURE2_TXQCNT_MASK         (0x3C0U)
#define GMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT        (6U)
#define GMAC_MAC_HW_FEATURE2_TXQCNT_WIDTH        (4U)
#define GMAC_MAC_HW_FEATURE2_TXQCNT(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_TXQCNT_SHIFT)) & GMAC_MAC_HW_FEATURE2_TXQCNT_MASK)

#define GMAC_MAC_HW_FEATURE2_Reserved_11_10_MASK (0xC00U)
#define GMAC_MAC_HW_FEATURE2_Reserved_11_10_SHIFT (10U)
#define GMAC_MAC_HW_FEATURE2_Reserved_11_10_WIDTH (2U)
#define GMAC_MAC_HW_FEATURE2_Reserved_11_10(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_Reserved_11_10_SHIFT)) & GMAC_MAC_HW_FEATURE2_Reserved_11_10_MASK)

#define GMAC_MAC_HW_FEATURE2_RXCHCNT_MASK        (0xF000U)
#define GMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT       (12U)
#define GMAC_MAC_HW_FEATURE2_RXCHCNT_WIDTH       (4U)
#define GMAC_MAC_HW_FEATURE2_RXCHCNT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_RXCHCNT_SHIFT)) & GMAC_MAC_HW_FEATURE2_RXCHCNT_MASK)

#define GMAC_MAC_HW_FEATURE2_RDCSZ_MASK          (0x30000U)
#define GMAC_MAC_HW_FEATURE2_RDCSZ_SHIFT         (16U)
#define GMAC_MAC_HW_FEATURE2_RDCSZ_WIDTH         (2U)
#define GMAC_MAC_HW_FEATURE2_RDCSZ(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_RDCSZ_SHIFT)) & GMAC_MAC_HW_FEATURE2_RDCSZ_MASK)

#define GMAC_MAC_HW_FEATURE2_TXCHCNT_MASK        (0x3C0000U)
#define GMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT       (18U)
#define GMAC_MAC_HW_FEATURE2_TXCHCNT_WIDTH       (4U)
#define GMAC_MAC_HW_FEATURE2_TXCHCNT(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_TXCHCNT_SHIFT)) & GMAC_MAC_HW_FEATURE2_TXCHCNT_MASK)

#define GMAC_MAC_HW_FEATURE2_TDCSZ_MASK          (0xC00000U)
#define GMAC_MAC_HW_FEATURE2_TDCSZ_SHIFT         (22U)
#define GMAC_MAC_HW_FEATURE2_TDCSZ_WIDTH         (2U)
#define GMAC_MAC_HW_FEATURE2_TDCSZ(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_TDCSZ_SHIFT)) & GMAC_MAC_HW_FEATURE2_TDCSZ_MASK)

#define GMAC_MAC_HW_FEATURE2_PPSOUTNUM_MASK      (0x7000000U)
#define GMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT     (24U)
#define GMAC_MAC_HW_FEATURE2_PPSOUTNUM_WIDTH     (3U)
#define GMAC_MAC_HW_FEATURE2_PPSOUTNUM(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_PPSOUTNUM_SHIFT)) & GMAC_MAC_HW_FEATURE2_PPSOUTNUM_MASK)

#define GMAC_MAC_HW_FEATURE2_Reserved_27_MASK    (0x8000000U)
#define GMAC_MAC_HW_FEATURE2_Reserved_27_SHIFT   (27U)
#define GMAC_MAC_HW_FEATURE2_Reserved_27_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE2_Reserved_27(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_Reserved_27_SHIFT)) & GMAC_MAC_HW_FEATURE2_Reserved_27_MASK)

#define GMAC_MAC_HW_FEATURE2_AUXSNAPNUM_MASK     (0x70000000U)
#define GMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT    (28U)
#define GMAC_MAC_HW_FEATURE2_AUXSNAPNUM_WIDTH    (3U)
#define GMAC_MAC_HW_FEATURE2_AUXSNAPNUM(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_AUXSNAPNUM_SHIFT)) & GMAC_MAC_HW_FEATURE2_AUXSNAPNUM_MASK)

#define GMAC_MAC_HW_FEATURE2_Reserved_31_MASK    (0x80000000U)
#define GMAC_MAC_HW_FEATURE2_Reserved_31_SHIFT   (31U)
#define GMAC_MAC_HW_FEATURE2_Reserved_31_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE2_Reserved_31(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE2_Reserved_31_SHIFT)) & GMAC_MAC_HW_FEATURE2_Reserved_31_MASK)
/*! @} */

/*! @name MAC_HW_FEATURE3 -  */
/*! @{ */

#define GMAC_MAC_HW_FEATURE3_NRVF_MASK           (0x7U)
#define GMAC_MAC_HW_FEATURE3_NRVF_SHIFT          (0U)
#define GMAC_MAC_HW_FEATURE3_NRVF_WIDTH          (3U)
#define GMAC_MAC_HW_FEATURE3_NRVF(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_NRVF_SHIFT)) & GMAC_MAC_HW_FEATURE3_NRVF_MASK)

