zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_HW_FEATURE3_Reserved_3_MASK     (0x8U)
#define GMAC_MAC_HW_FEATURE3_Reserved_3_SHIFT    (3U)
#define GMAC_MAC_HW_FEATURE3_Reserved_3_WIDTH    (1U)
#define GMAC_MAC_HW_FEATURE3_Reserved_3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_Reserved_3_SHIFT)) & GMAC_MAC_HW_FEATURE3_Reserved_3_MASK)

#define GMAC_MAC_HW_FEATURE3_CBTISEL_MASK        (0x10U)
#define GMAC_MAC_HW_FEATURE3_CBTISEL_SHIFT       (4U)
#define GMAC_MAC_HW_FEATURE3_CBTISEL_WIDTH       (1U)
#define GMAC_MAC_HW_FEATURE3_CBTISEL(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_CBTISEL_SHIFT)) & GMAC_MAC_HW_FEATURE3_CBTISEL_MASK)

#define GMAC_MAC_HW_FEATURE3_DVLAN_MASK          (0x20U)
#define GMAC_MAC_HW_FEATURE3_DVLAN_SHIFT         (5U)
#define GMAC_MAC_HW_FEATURE3_DVLAN_WIDTH         (1U)
#define GMAC_MAC_HW_FEATURE3_DVLAN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_DVLAN_SHIFT)) & GMAC_MAC_HW_FEATURE3_DVLAN_MASK)

#define GMAC_MAC_HW_FEATURE3_Reserved_7_6_MASK   (0x1C0U)
#define GMAC_MAC_HW_FEATURE3_Reserved_7_6_SHIFT  (6U)
#define GMAC_MAC_HW_FEATURE3_Reserved_7_6_WIDTH  (3U)
#define GMAC_MAC_HW_FEATURE3_Reserved_7_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_Reserved_7_6_SHIFT)) & GMAC_MAC_HW_FEATURE3_Reserved_7_6_MASK)

#define GMAC_MAC_HW_FEATURE3_PDUPSEL_MASK        (0x200U)
#define GMAC_MAC_HW_FEATURE3_PDUPSEL_SHIFT       (9U)
#define GMAC_MAC_HW_FEATURE3_PDUPSEL_WIDTH       (1U)
#define GMAC_MAC_HW_FEATURE3_PDUPSEL(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_PDUPSEL_SHIFT)) & GMAC_MAC_HW_FEATURE3_PDUPSEL_MASK)

#define GMAC_MAC_HW_FEATURE3_FRPSEL_MASK         (0x400U)
#define GMAC_MAC_HW_FEATURE3_FRPSEL_SHIFT        (10U)
#define GMAC_MAC_HW_FEATURE3_FRPSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE3_FRPSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_FRPSEL_SHIFT)) & GMAC_MAC_HW_FEATURE3_FRPSEL_MASK)

#define GMAC_MAC_HW_FEATURE3_FRPBS_MASK          (0x1800U)
#define GMAC_MAC_HW_FEATURE3_FRPBS_SHIFT         (11U)
#define GMAC_MAC_HW_FEATURE3_FRPBS_WIDTH         (2U)
#define GMAC_MAC_HW_FEATURE3_FRPBS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_FRPBS_SHIFT)) & GMAC_MAC_HW_FEATURE3_FRPBS_MASK)

#define GMAC_MAC_HW_FEATURE3_FRPES_MASK          (0x6000U)
#define GMAC_MAC_HW_FEATURE3_FRPES_SHIFT         (13U)
#define GMAC_MAC_HW_FEATURE3_FRPES_WIDTH         (2U)
#define GMAC_MAC_HW_FEATURE3_FRPES(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_FRPES_SHIFT)) & GMAC_MAC_HW_FEATURE3_FRPES_MASK)

#define GMAC_MAC_HW_FEATURE3_Reserved_15_MASK    (0x8000U)
#define GMAC_MAC_HW_FEATURE3_Reserved_15_SHIFT   (15U)
#define GMAC_MAC_HW_FEATURE3_Reserved_15_WIDTH   (1U)
#define GMAC_MAC_HW_FEATURE3_Reserved_15(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_Reserved_15_SHIFT)) & GMAC_MAC_HW_FEATURE3_Reserved_15_MASK)

#define GMAC_MAC_HW_FEATURE3_ESTSEL_MASK         (0x10000U)
#define GMAC_MAC_HW_FEATURE3_ESTSEL_SHIFT        (16U)
#define GMAC_MAC_HW_FEATURE3_ESTSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE3_ESTSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_ESTSEL_SHIFT)) & GMAC_MAC_HW_FEATURE3_ESTSEL_MASK)

#define GMAC_MAC_HW_FEATURE3_ESTDEP_MASK         (0xE0000U)
#define GMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT        (17U)
#define GMAC_MAC_HW_FEATURE3_ESTDEP_WIDTH        (3U)
#define GMAC_MAC_HW_FEATURE3_ESTDEP(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_ESTDEP_SHIFT)) & GMAC_MAC_HW_FEATURE3_ESTDEP_MASK)

#define GMAC_MAC_HW_FEATURE3_ESTWID_MASK         (0x300000U)
#define GMAC_MAC_HW_FEATURE3_ESTWID_SHIFT        (20U)
#define GMAC_MAC_HW_FEATURE3_ESTWID_WIDTH        (2U)
#define GMAC_MAC_HW_FEATURE3_ESTWID(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_ESTWID_SHIFT)) & GMAC_MAC_HW_FEATURE3_ESTWID_MASK)

#define GMAC_MAC_HW_FEATURE3_Reserved_25_22_MASK (0x3C00000U)
#define GMAC_MAC_HW_FEATURE3_Reserved_25_22_SHIFT (22U)
#define GMAC_MAC_HW_FEATURE3_Reserved_25_22_WIDTH (4U)
#define GMAC_MAC_HW_FEATURE3_Reserved_25_22(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_Reserved_25_22_SHIFT)) & GMAC_MAC_HW_FEATURE3_Reserved_25_22_MASK)

#define GMAC_MAC_HW_FEATURE3_FPESEL_MASK         (0x4000000U)
#define GMAC_MAC_HW_FEATURE3_FPESEL_SHIFT        (26U)
#define GMAC_MAC_HW_FEATURE3_FPESEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE3_FPESEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_FPESEL_SHIFT)) & GMAC_MAC_HW_FEATURE3_FPESEL_MASK)

#define GMAC_MAC_HW_FEATURE3_TBSSEL_MASK         (0x8000000U)
#define GMAC_MAC_HW_FEATURE3_TBSSEL_SHIFT        (27U)
#define GMAC_MAC_HW_FEATURE3_TBSSEL_WIDTH        (1U)
#define GMAC_MAC_HW_FEATURE3_TBSSEL(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_TBSSEL_SHIFT)) & GMAC_MAC_HW_FEATURE3_TBSSEL_MASK)

#define GMAC_MAC_HW_FEATURE3_ASP_MASK            (0x30000000U)
#define GMAC_MAC_HW_FEATURE3_ASP_SHIFT           (28U)
#define GMAC_MAC_HW_FEATURE3_ASP_WIDTH           (2U)
#define GMAC_MAC_HW_FEATURE3_ASP(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_ASP_SHIFT)) & GMAC_MAC_HW_FEATURE3_ASP_MASK)

#define GMAC_MAC_HW_FEATURE3_Reserved_31_30_MASK (0xC0000000U)
#define GMAC_MAC_HW_FEATURE3_Reserved_31_30_SHIFT (30U)
#define GMAC_MAC_HW_FEATURE3_Reserved_31_30_WIDTH (2U)
#define GMAC_MAC_HW_FEATURE3_Reserved_31_30(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_HW_FEATURE3_Reserved_31_30_SHIFT)) & GMAC_MAC_HW_FEATURE3_Reserved_31_30_MASK)
/*! @} */

/*! @name MAC_DPP_FSM_INTERRUPT_STATUS -  */
/*! @{ */

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ATPES_MASK (0x1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ATPES_SHIFT (0U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ATPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ATPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ATPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_ATPES_MASK)

