zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_MASK (0x1000000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_SHIFT (24U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES_MASK (0x2000000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES_SHIFT (25U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTBUPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES_MASK (0x4000000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES_SHIFT (26U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTFCPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES_MASK (0x8000000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES_SHIFT (27U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MRWCPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_DCPES_MASK (0x10000000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_DCPES_SHIFT (28U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_DCPES_WIDTH (1U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_DCPES(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_DCPES_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_DCPES_MASK)

#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_31_29_SHIFT)) & GMAC_MAC_DPP_FSM_INTERRUPT_STATUS_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_FSM_CONTROL -  */
/*! @{ */

#define GMAC_MAC_FSM_CONTROL_TMOUTEN_MASK        (0x1U)
#define GMAC_MAC_FSM_CONTROL_TMOUTEN_SHIFT       (0U)
#define GMAC_MAC_FSM_CONTROL_TMOUTEN_WIDTH       (1U)
#define GMAC_MAC_FSM_CONTROL_TMOUTEN(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_TMOUTEN_SHIFT)) & GMAC_MAC_FSM_CONTROL_TMOUTEN_MASK)

#define GMAC_MAC_FSM_CONTROL_PRTYEN_MASK         (0x2U)
#define GMAC_MAC_FSM_CONTROL_PRTYEN_SHIFT        (1U)
#define GMAC_MAC_FSM_CONTROL_PRTYEN_WIDTH        (1U)
#define GMAC_MAC_FSM_CONTROL_PRTYEN(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_PRTYEN_SHIFT)) & GMAC_MAC_FSM_CONTROL_PRTYEN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_7_2_MASK   (0xFCU)
#define GMAC_MAC_FSM_CONTROL_Reserved_7_2_SHIFT  (2U)
#define GMAC_MAC_FSM_CONTROL_Reserved_7_2_WIDTH  (6U)
#define GMAC_MAC_FSM_CONTROL_Reserved_7_2(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_7_2_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_7_2_MASK)

#define GMAC_MAC_FSM_CONTROL_TTEIN_MASK          (0x100U)
#define GMAC_MAC_FSM_CONTROL_TTEIN_SHIFT         (8U)
#define GMAC_MAC_FSM_CONTROL_TTEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_TTEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_TTEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_TTEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_RTEIN_MASK          (0x200U)
#define GMAC_MAC_FSM_CONTROL_RTEIN_SHIFT         (9U)
#define GMAC_MAC_FSM_CONTROL_RTEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_RTEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_RTEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_RTEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_CTEIN_MASK (0x400U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CTEIN_SHIFT (10U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CTEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_CTEIN(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_CTEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_CTEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_ATEIN_MASK          (0x800U)
#define GMAC_MAC_FSM_CONTROL_ATEIN_SHIFT         (11U)
#define GMAC_MAC_FSM_CONTROL_ATEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_ATEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_ATEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_ATEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_PTEIN_MASK          (0x1000U)
#define GMAC_MAC_FSM_CONTROL_PTEIN_SHIFT         (12U)
#define GMAC_MAC_FSM_CONTROL_PTEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_PTEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_PTEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_PTEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_T125TEIN_MASK (0x2000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125TEIN_SHIFT (13U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125TEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_T125TEIN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_T125TEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_T125TEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_R125TEIN_MASK (0x4000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125TEIN_SHIFT (14U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125TEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_R125TEIN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_R125TEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_R125TEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_Reserved_RVCTEIN_MASK (0x8000U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCTEIN_SHIFT (15U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCTEIN_WIDTH (1U)
#define GMAC_MAC_FSM_CONTROL_Reserved_RVCTEIN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_Reserved_RVCTEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_Reserved_RVCTEIN_MASK)

#define GMAC_MAC_FSM_CONTROL_TPEIN_MASK          (0x10000U)
#define GMAC_MAC_FSM_CONTROL_TPEIN_SHIFT         (16U)
#define GMAC_MAC_FSM_CONTROL_TPEIN_WIDTH         (1U)
#define GMAC_MAC_FSM_CONTROL_TPEIN(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_CONTROL_TPEIN_SHIFT)) & GMAC_MAC_FSM_CONTROL_TPEIN_MASK)

