zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_FSM_ACT_TIMER_LTMRMD_MASK       (0xF00000U)
#define GMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT      (20U)
#define GMAC_MAC_FSM_ACT_TIMER_LTMRMD_WIDTH      (4U)
#define GMAC_MAC_FSM_ACT_TIMER_LTMRMD(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT)) & GMAC_MAC_FSM_ACT_TIMER_LTMRMD_MASK)

#define GMAC_MAC_FSM_ACT_TIMER_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MAC_FSM_ACT_TIMER_Reserved_31_24_SHIFT (24U)
#define GMAC_MAC_FSM_ACT_TIMER_Reserved_31_24_WIDTH (8U)
#define GMAC_MAC_FSM_ACT_TIMER_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FSM_ACT_TIMER_Reserved_31_24_SHIFT)) & GMAC_MAC_FSM_ACT_TIMER_Reserved_31_24_MASK)
/*! @} */

/*! @name SCS_REG1 -  */
/*! @{ */

#define GMAC_SCS_REG1_MAC_SCS1_MASK              (0xFFFFFFFFU)
#define GMAC_SCS_REG1_MAC_SCS1_SHIFT             (0U)
#define GMAC_SCS_REG1_MAC_SCS1_WIDTH             (32U)
#define GMAC_SCS_REG1_MAC_SCS1(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_SCS_REG1_MAC_SCS1_SHIFT)) & GMAC_SCS_REG1_MAC_SCS1_MASK)
/*! @} */

/*! @name MAC_MDIO_ADDRESS -  */
/*! @{ */

#define GMAC_MAC_MDIO_ADDRESS_GB_MASK            (0x1U)
#define GMAC_MAC_MDIO_ADDRESS_GB_SHIFT           (0U)
#define GMAC_MAC_MDIO_ADDRESS_GB_WIDTH           (1U)
#define GMAC_MAC_MDIO_ADDRESS_GB(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_GB_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_GB_MASK)

#define GMAC_MAC_MDIO_ADDRESS_C45E_MASK          (0x2U)
#define GMAC_MAC_MDIO_ADDRESS_C45E_SHIFT         (1U)
#define GMAC_MAC_MDIO_ADDRESS_C45E_WIDTH         (1U)
#define GMAC_MAC_MDIO_ADDRESS_C45E(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_C45E_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_C45E_MASK)

#define GMAC_MAC_MDIO_ADDRESS_GOC_0_MASK         (0x4U)
#define GMAC_MAC_MDIO_ADDRESS_GOC_0_SHIFT        (2U)
#define GMAC_MAC_MDIO_ADDRESS_GOC_0_WIDTH        (1U)
#define GMAC_MAC_MDIO_ADDRESS_GOC_0(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_GOC_0_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_GOC_0_MASK)

#define GMAC_MAC_MDIO_ADDRESS_GOC_1_MASK         (0x8U)
#define GMAC_MAC_MDIO_ADDRESS_GOC_1_SHIFT        (3U)
#define GMAC_MAC_MDIO_ADDRESS_GOC_1_WIDTH        (1U)
#define GMAC_MAC_MDIO_ADDRESS_GOC_1(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_GOC_1_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_GOC_1_MASK)

#define GMAC_MAC_MDIO_ADDRESS_SKAP_MASK          (0x10U)
#define GMAC_MAC_MDIO_ADDRESS_SKAP_SHIFT         (4U)
#define GMAC_MAC_MDIO_ADDRESS_SKAP_WIDTH         (1U)
#define GMAC_MAC_MDIO_ADDRESS_SKAP(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_SKAP_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_SKAP_MASK)

#define GMAC_MAC_MDIO_ADDRESS_Reserved_7_5_MASK  (0xE0U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_7_5_SHIFT (5U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_7_5_WIDTH (3U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_7_5(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_Reserved_7_5_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_Reserved_7_5_MASK)

#define GMAC_MAC_MDIO_ADDRESS_CR_MASK            (0xF00U)
#define GMAC_MAC_MDIO_ADDRESS_CR_SHIFT           (8U)
#define GMAC_MAC_MDIO_ADDRESS_CR_WIDTH           (4U)
#define GMAC_MAC_MDIO_ADDRESS_CR(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_CR_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_CR_MASK)

#define GMAC_MAC_MDIO_ADDRESS_NTC_MASK           (0x7000U)
#define GMAC_MAC_MDIO_ADDRESS_NTC_SHIFT          (12U)
#define GMAC_MAC_MDIO_ADDRESS_NTC_WIDTH          (3U)
#define GMAC_MAC_MDIO_ADDRESS_NTC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_NTC_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_NTC_MASK)

#define GMAC_MAC_MDIO_ADDRESS_Reserved_15_MASK   (0x8000U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_15_SHIFT  (15U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_15_WIDTH  (1U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_15(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_Reserved_15_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_Reserved_15_MASK)

#define GMAC_MAC_MDIO_ADDRESS_RDA_MASK           (0x1F0000U)
#define GMAC_MAC_MDIO_ADDRESS_RDA_SHIFT          (16U)
#define GMAC_MAC_MDIO_ADDRESS_RDA_WIDTH          (5U)
#define GMAC_MAC_MDIO_ADDRESS_RDA(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_RDA_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_RDA_MASK)

#define GMAC_MAC_MDIO_ADDRESS_PA_MASK            (0x3E00000U)
#define GMAC_MAC_MDIO_ADDRESS_PA_SHIFT           (21U)
#define GMAC_MAC_MDIO_ADDRESS_PA_WIDTH           (5U)
#define GMAC_MAC_MDIO_ADDRESS_PA(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_PA_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_PA_MASK)

#define GMAC_MAC_MDIO_ADDRESS_BTB_MASK           (0x4000000U)
#define GMAC_MAC_MDIO_ADDRESS_BTB_SHIFT          (26U)
#define GMAC_MAC_MDIO_ADDRESS_BTB_WIDTH          (1U)
#define GMAC_MAC_MDIO_ADDRESS_BTB(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_BTB_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_BTB_MASK)

#define GMAC_MAC_MDIO_ADDRESS_PSE_MASK           (0x8000000U)
#define GMAC_MAC_MDIO_ADDRESS_PSE_SHIFT          (27U)
#define GMAC_MAC_MDIO_ADDRESS_PSE_WIDTH          (1U)
#define GMAC_MAC_MDIO_ADDRESS_PSE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_PSE_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_PSE_MASK)

#define GMAC_MAC_MDIO_ADDRESS_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_31_28_SHIFT (28U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_31_28_WIDTH (4U)
#define GMAC_MAC_MDIO_ADDRESS_Reserved_31_28(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_ADDRESS_Reserved_31_28_SHIFT)) & GMAC_MAC_MDIO_ADDRESS_Reserved_31_28_MASK)
/*! @} */

/*! @name MAC_MDIO_DATA -  */
/*! @{ */

#define GMAC_MAC_MDIO_DATA_GD_MASK               (0xFFFFU)
#define GMAC_MAC_MDIO_DATA_GD_SHIFT              (0U)
#define GMAC_MAC_MDIO_DATA_GD_WIDTH              (16U)
#define GMAC_MAC_MDIO_DATA_GD(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_DATA_GD_SHIFT)) & GMAC_MAC_MDIO_DATA_GD_MASK)

#define GMAC_MAC_MDIO_DATA_RA_MASK               (0xFFFF0000U)
#define GMAC_MAC_MDIO_DATA_RA_SHIFT              (16U)
#define GMAC_MAC_MDIO_DATA_RA_WIDTH              (16U)
#define GMAC_MAC_MDIO_DATA_RA(x)                 (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_MDIO_DATA_RA_SHIFT)) & GMAC_MAC_MDIO_DATA_RA_MASK)
/*! @} */

