zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_ARP_ADDRESS -  */
/*! @{ */

#define GMAC_MAC_ARP_ADDRESS_ARPPA_MASK          (0xFFFFFFFFU)
#define GMAC_MAC_ARP_ADDRESS_ARPPA_SHIFT         (0U)
#define GMAC_MAC_ARP_ADDRESS_ARPPA_WIDTH         (32U)
#define GMAC_MAC_ARP_ADDRESS_ARPPA(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_ARP_ADDRESS_ARPPA_SHIFT)) & GMAC_MAC_ARP_ADDRESS_ARPPA_MASK)
/*! @} */

/*! @name MAC_CSR_SW_CTRL -  */
/*! @{ */

#define GMAC_MAC_CSR_SW_CTRL_RCWE_MASK           (0x1U)
#define GMAC_MAC_CSR_SW_CTRL_RCWE_SHIFT          (0U)
#define GMAC_MAC_CSR_SW_CTRL_RCWE_WIDTH          (1U)
#define GMAC_MAC_CSR_SW_CTRL_RCWE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CSR_SW_CTRL_RCWE_SHIFT)) & GMAC_MAC_CSR_SW_CTRL_RCWE_MASK)

#define GMAC_MAC_CSR_SW_CTRL_Reserved_7_1_MASK   (0xFEU)
#define GMAC_MAC_CSR_SW_CTRL_Reserved_7_1_SHIFT  (1U)
#define GMAC_MAC_CSR_SW_CTRL_Reserved_7_1_WIDTH  (7U)
#define GMAC_MAC_CSR_SW_CTRL_Reserved_7_1(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CSR_SW_CTRL_Reserved_7_1_SHIFT)) & GMAC_MAC_CSR_SW_CTRL_Reserved_7_1_MASK)

#define GMAC_MAC_CSR_SW_CTRL_SEEN_MASK           (0x100U)
#define GMAC_MAC_CSR_SW_CTRL_SEEN_SHIFT          (8U)
#define GMAC_MAC_CSR_SW_CTRL_SEEN_WIDTH          (1U)
#define GMAC_MAC_CSR_SW_CTRL_SEEN(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CSR_SW_CTRL_SEEN_SHIFT)) & GMAC_MAC_CSR_SW_CTRL_SEEN_MASK)

#define GMAC_MAC_CSR_SW_CTRL_Reserved_31_9_MASK  (0xFFFFFE00U)
#define GMAC_MAC_CSR_SW_CTRL_Reserved_31_9_SHIFT (9U)
#define GMAC_MAC_CSR_SW_CTRL_Reserved_31_9_WIDTH (23U)
#define GMAC_MAC_CSR_SW_CTRL_Reserved_31_9(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_CSR_SW_CTRL_Reserved_31_9_SHIFT)) & GMAC_MAC_CSR_SW_CTRL_Reserved_31_9_MASK)
/*! @} */

/*! @name MAC_FPE_CTRL_STS -  */
/*! @{ */

#define GMAC_MAC_FPE_CTRL_STS_EFPE_MASK          (0x1U)
#define GMAC_MAC_FPE_CTRL_STS_EFPE_SHIFT         (0U)
#define GMAC_MAC_FPE_CTRL_STS_EFPE_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_EFPE(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_EFPE_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_EFPE_MASK)

#define GMAC_MAC_FPE_CTRL_STS_SVER_MASK          (0x2U)
#define GMAC_MAC_FPE_CTRL_STS_SVER_SHIFT         (1U)
#define GMAC_MAC_FPE_CTRL_STS_SVER_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_SVER(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_SVER_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_SVER_MASK)

#define GMAC_MAC_FPE_CTRL_STS_SRSP_MASK          (0x4U)
#define GMAC_MAC_FPE_CTRL_STS_SRSP_SHIFT         (2U)
#define GMAC_MAC_FPE_CTRL_STS_SRSP_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_SRSP(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_SRSP_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_SRSP_MASK)

#define GMAC_MAC_FPE_CTRL_STS_S1_SET_0_MASK      (0x8U)
#define GMAC_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT     (3U)
#define GMAC_MAC_FPE_CTRL_STS_S1_SET_0_WIDTH     (1U)
#define GMAC_MAC_FPE_CTRL_STS_S1_SET_0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_S1_SET_0_MASK)

#define GMAC_MAC_FPE_CTRL_STS_Reserved_15_4_MASK (0xFFF0U)
#define GMAC_MAC_FPE_CTRL_STS_Reserved_15_4_SHIFT (4U)
#define GMAC_MAC_FPE_CTRL_STS_Reserved_15_4_WIDTH (12U)
#define GMAC_MAC_FPE_CTRL_STS_Reserved_15_4(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_Reserved_15_4_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_Reserved_15_4_MASK)

#define GMAC_MAC_FPE_CTRL_STS_RVER_MASK          (0x10000U)
#define GMAC_MAC_FPE_CTRL_STS_RVER_SHIFT         (16U)
#define GMAC_MAC_FPE_CTRL_STS_RVER_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_RVER(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_RVER_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_RVER_MASK)

#define GMAC_MAC_FPE_CTRL_STS_RRSP_MASK          (0x20000U)
#define GMAC_MAC_FPE_CTRL_STS_RRSP_SHIFT         (17U)
#define GMAC_MAC_FPE_CTRL_STS_RRSP_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_RRSP(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_RRSP_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_RRSP_MASK)

#define GMAC_MAC_FPE_CTRL_STS_TVER_MASK          (0x40000U)
#define GMAC_MAC_FPE_CTRL_STS_TVER_SHIFT         (18U)
#define GMAC_MAC_FPE_CTRL_STS_TVER_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_TVER(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_TVER_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_TVER_MASK)

#define GMAC_MAC_FPE_CTRL_STS_TRSP_MASK          (0x80000U)
#define GMAC_MAC_FPE_CTRL_STS_TRSP_SHIFT         (19U)
#define GMAC_MAC_FPE_CTRL_STS_TRSP_WIDTH         (1U)
#define GMAC_MAC_FPE_CTRL_STS_TRSP(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_TRSP_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_TRSP_MASK)

#define GMAC_MAC_FPE_CTRL_STS_Reserved_31_20_MASK (0xFFF00000U)
#define GMAC_MAC_FPE_CTRL_STS_Reserved_31_20_SHIFT (20U)
#define GMAC_MAC_FPE_CTRL_STS_Reserved_31_20_WIDTH (12U)
#define GMAC_MAC_FPE_CTRL_STS_Reserved_31_20(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_FPE_CTRL_STS_Reserved_31_20_SHIFT)) & GMAC_MAC_FPE_CTRL_STS_Reserved_31_20_MASK)
/*! @} */

/*! @name MAC_EXT_CFG1 -  */
/*! @{ */

#define GMAC_MAC_EXT_CFG1_SPLOFST_MASK           (0x7FU)
#define GMAC_MAC_EXT_CFG1_SPLOFST_SHIFT          (0U)
#define GMAC_MAC_EXT_CFG1_SPLOFST_WIDTH          (7U)
#define GMAC_MAC_EXT_CFG1_SPLOFST(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_SPLOFST_SHIFT)) & GMAC_MAC_EXT_CFG1_SPLOFST_MASK)

#define GMAC_MAC_EXT_CFG1_Reserved_7_MASK        (0x80U)
#define GMAC_MAC_EXT_CFG1_Reserved_7_SHIFT       (7U)
#define GMAC_MAC_EXT_CFG1_Reserved_7_WIDTH       (1U)
#define GMAC_MAC_EXT_CFG1_Reserved_7(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_Reserved_7_SHIFT)) & GMAC_MAC_EXT_CFG1_Reserved_7_MASK)

#define GMAC_MAC_EXT_CFG1_SPLM_MASK              (0x300U)
#define GMAC_MAC_EXT_CFG1_SPLM_SHIFT             (8U)
#define GMAC_MAC_EXT_CFG1_SPLM_WIDTH             (2U)
#define GMAC_MAC_EXT_CFG1_SPLM(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_SPLM_SHIFT)) & GMAC_MAC_EXT_CFG1_SPLM_MASK)

#define GMAC_MAC_EXT_CFG1_Reserved_15_10_MASK    (0xFC00U)
#define GMAC_MAC_EXT_CFG1_Reserved_15_10_SHIFT   (10U)
#define GMAC_MAC_EXT_CFG1_Reserved_15_10_WIDTH   (6U)
#define GMAC_MAC_EXT_CFG1_Reserved_15_10(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_EXT_CFG1_Reserved_15_10_SHIFT)) & GMAC_MAC_EXT_CFG1_Reserved_15_10_MASK)

