zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MMC_RX_INTERRUPT_RXMCGPIS_MASK      (0x10U)
#define GMAC_MMC_RX_INTERRUPT_RXMCGPIS_SHIFT     (4U)
#define GMAC_MMC_RX_INTERRUPT_RXMCGPIS_WIDTH     (1U)
#define GMAC_MMC_RX_INTERRUPT_RXMCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXMCGPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXMCGPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXCRCERPIS_MASK    (0x20U)
#define GMAC_MMC_RX_INTERRUPT_RXCRCERPIS_SHIFT   (5U)
#define GMAC_MMC_RX_INTERRUPT_RXCRCERPIS_WIDTH   (1U)
#define GMAC_MMC_RX_INTERRUPT_RXCRCERPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXCRCERPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXCRCERPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXALGNERPIS_MASK   (0x40U)
#define GMAC_MMC_RX_INTERRUPT_RXALGNERPIS_SHIFT  (6U)
#define GMAC_MMC_RX_INTERRUPT_RXALGNERPIS_WIDTH  (1U)
#define GMAC_MMC_RX_INTERRUPT_RXALGNERPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXALGNERPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXALGNERPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXRUNTPIS_MASK     (0x80U)
#define GMAC_MMC_RX_INTERRUPT_RXRUNTPIS_SHIFT    (7U)
#define GMAC_MMC_RX_INTERRUPT_RXRUNTPIS_WIDTH    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXRUNTPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXRUNTPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXRUNTPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXJABERPIS_MASK    (0x100U)
#define GMAC_MMC_RX_INTERRUPT_RXJABERPIS_SHIFT   (8U)
#define GMAC_MMC_RX_INTERRUPT_RXJABERPIS_WIDTH   (1U)
#define GMAC_MMC_RX_INTERRUPT_RXJABERPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXJABERPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXJABERPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_MASK   (0x200U)
#define GMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_SHIFT  (9U)
#define GMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_WIDTH  (1U)
#define GMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_MASK   (0x400U)
#define GMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_SHIFT  (10U)
#define GMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_WIDTH  (1U)
#define GMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_MASK  (0x800U)
#define GMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_SHIFT (11U)
#define GMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_MASK (0x1000U)
#define GMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_SHIFT (12U)
#define GMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_MASK (0x2000U)
#define GMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_SHIFT (13U)
#define GMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_MASK (0x4000U)
#define GMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_SHIFT (14U)
#define GMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_MASK (0x8000U)
#define GMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_SHIFT (15U)
#define GMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_MASK (0x10000U)
#define GMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_SHIFT (16U)
#define GMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXUCGPIS_MASK      (0x20000U)
#define GMAC_MMC_RX_INTERRUPT_RXUCGPIS_SHIFT     (17U)
#define GMAC_MMC_RX_INTERRUPT_RXUCGPIS_WIDTH     (1U)
#define GMAC_MMC_RX_INTERRUPT_RXUCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXUCGPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXUCGPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXLENERPIS_MASK    (0x40000U)
#define GMAC_MMC_RX_INTERRUPT_RXLENERPIS_SHIFT   (18U)
#define GMAC_MMC_RX_INTERRUPT_RXLENERPIS_WIDTH   (1U)
#define GMAC_MMC_RX_INTERRUPT_RXLENERPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXLENERPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXLENERPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXORANGEPIS_MASK   (0x80000U)
#define GMAC_MMC_RX_INTERRUPT_RXORANGEPIS_SHIFT  (19U)
#define GMAC_MMC_RX_INTERRUPT_RXORANGEPIS_WIDTH  (1U)
#define GMAC_MMC_RX_INTERRUPT_RXORANGEPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXORANGEPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXORANGEPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXPAUSPIS_MASK     (0x100000U)
#define GMAC_MMC_RX_INTERRUPT_RXPAUSPIS_SHIFT    (20U)
#define GMAC_MMC_RX_INTERRUPT_RXPAUSPIS_WIDTH    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXPAUSPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXPAUSPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXPAUSPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXFOVPIS_MASK      (0x200000U)
#define GMAC_MMC_RX_INTERRUPT_RXFOVPIS_SHIFT     (21U)
#define GMAC_MMC_RX_INTERRUPT_RXFOVPIS_WIDTH     (1U)
#define GMAC_MMC_RX_INTERRUPT_RXFOVPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXFOVPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXFOVPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_MASK   (0x400000U)
#define GMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_SHIFT  (22U)
#define GMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_WIDTH  (1U)
#define GMAC_MMC_RX_INTERRUPT_RXVLANGBPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXWDOGPIS_MASK     (0x800000U)
#define GMAC_MMC_RX_INTERRUPT_RXWDOGPIS_SHIFT    (23U)
#define GMAC_MMC_RX_INTERRUPT_RXWDOGPIS_WIDTH    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXWDOGPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXWDOGPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXWDOGPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_MASK   (0x1000000U)
#define GMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_SHIFT  (24U)
#define GMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_WIDTH  (1U)
#define GMAC_MMC_RX_INTERRUPT_RXRCVERRPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_MASK)

