zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MMC_RX_INTERRUPT_RXCTRLPIS_MASK     (0x2000000U)
#define GMAC_MMC_RX_INTERRUPT_RXCTRLPIS_SHIFT    (25U)
#define GMAC_MMC_RX_INTERRUPT_RXCTRLPIS_WIDTH    (1U)
#define GMAC_MMC_RX_INTERRUPT_RXCTRLPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_RXCTRLPIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_RXCTRLPIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPIUSCIS_MASK (0x4000000U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPIUSCIS_SHIFT (26U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPIUSCIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPIUSCIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_Reserved_RXLPIUSCIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_Reserved_RXLPIUSCIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPITRCIS_MASK (0x8000000U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPITRCIS_SHIFT (27U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPITRCIS_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_RXLPITRCIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_Reserved_RXLPITRCIS_SHIFT)) & GMAC_MMC_RX_INTERRUPT_Reserved_RXLPITRCIS_MASK)

#define GMAC_MMC_RX_INTERRUPT_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_31_28_SHIFT (28U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_31_28_WIDTH (4U)
#define GMAC_MMC_RX_INTERRUPT_Reserved_31_28(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_Reserved_31_28_SHIFT)) & GMAC_MMC_RX_INTERRUPT_Reserved_31_28_MASK)
/*! @} */

/*! @name MMC_TX_INTERRUPT -  */
/*! @{ */

#define GMAC_MMC_TX_INTERRUPT_TXGBOCTIS_MASK     (0x1U)
#define GMAC_MMC_TX_INTERRUPT_TXGBOCTIS_SHIFT    (0U)
#define GMAC_MMC_TX_INTERRUPT_TXGBOCTIS_WIDTH    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXGBOCTIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXGBOCTIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXGBOCTIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXGBPKTIS_MASK     (0x2U)
#define GMAC_MMC_TX_INTERRUPT_TXGBPKTIS_SHIFT    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXGBPKTIS_WIDTH    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXGBPKTIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXGBPKTIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXGBPKTIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXBCGPIS_MASK      (0x4U)
#define GMAC_MMC_TX_INTERRUPT_TXBCGPIS_SHIFT     (2U)
#define GMAC_MMC_TX_INTERRUPT_TXBCGPIS_WIDTH     (1U)
#define GMAC_MMC_TX_INTERRUPT_TXBCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXBCGPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXBCGPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXMCGPIS_MASK      (0x8U)
#define GMAC_MMC_TX_INTERRUPT_TXMCGPIS_SHIFT     (3U)
#define GMAC_MMC_TX_INTERRUPT_TXMCGPIS_WIDTH     (1U)
#define GMAC_MMC_TX_INTERRUPT_TXMCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXMCGPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXMCGPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_MASK  (0x10U)
#define GMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_SHIFT (4U)
#define GMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_MASK (0x20U)
#define GMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_SHIFT (5U)
#define GMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_MASK (0x40U)
#define GMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_SHIFT (6U)
#define GMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_MASK (0x80U)
#define GMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_SHIFT (7U)
#define GMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_MASK (0x100U)
#define GMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_SHIFT (8U)
#define GMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_MASK (0x200U)
#define GMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_SHIFT (9U)
#define GMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXUCGBPIS_MASK     (0x400U)
#define GMAC_MMC_TX_INTERRUPT_TXUCGBPIS_SHIFT    (10U)
#define GMAC_MMC_TX_INTERRUPT_TXUCGBPIS_WIDTH    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXUCGBPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXUCGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXUCGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXMCGBPIS_MASK     (0x800U)
#define GMAC_MMC_TX_INTERRUPT_TXMCGBPIS_SHIFT    (11U)
#define GMAC_MMC_TX_INTERRUPT_TXMCGBPIS_WIDTH    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXMCGBPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXMCGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXMCGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXBCGBPIS_MASK     (0x1000U)
#define GMAC_MMC_TX_INTERRUPT_TXBCGBPIS_SHIFT    (12U)
#define GMAC_MMC_TX_INTERRUPT_TXBCGBPIS_WIDTH    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXBCGBPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXBCGBPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXBCGBPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_MASK  (0x2000U)
#define GMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_SHIFT (13U)
#define GMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_MASK    (0x4000U)
#define GMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_SHIFT   (14U)
#define GMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_WIDTH   (1U)
#define GMAC_MMC_TX_INTERRUPT_TXSCOLGPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_MASK    (0x8000U)
#define GMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_SHIFT   (15U)
#define GMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_WIDTH   (1U)
#define GMAC_MMC_TX_INTERRUPT_TXMCOLGPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXDEFPIS_MASK      (0x10000U)
#define GMAC_MMC_TX_INTERRUPT_TXDEFPIS_SHIFT     (16U)
#define GMAC_MMC_TX_INTERRUPT_TXDEFPIS_WIDTH     (1U)
#define GMAC_MMC_TX_INTERRUPT_TXDEFPIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXDEFPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXDEFPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_MASK   (0x20000U)
#define GMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_SHIFT  (17U)
#define GMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_WIDTH  (1U)
#define GMAC_MMC_TX_INTERRUPT_TXLATCOLPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_MASK    (0x40000U)
#define GMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_SHIFT   (18U)
#define GMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_WIDTH   (1U)
#define GMAC_MMC_TX_INTERRUPT_TXEXCOLPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_MASK)

