zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MMC_TX_INTERRUPT_TXCARERPIS_MASK    (0x80000U)
#define GMAC_MMC_TX_INTERRUPT_TXCARERPIS_SHIFT   (19U)
#define GMAC_MMC_TX_INTERRUPT_TXCARERPIS_WIDTH   (1U)
#define GMAC_MMC_TX_INTERRUPT_TXCARERPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXCARERPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXCARERPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXGOCTIS_MASK      (0x100000U)
#define GMAC_MMC_TX_INTERRUPT_TXGOCTIS_SHIFT     (20U)
#define GMAC_MMC_TX_INTERRUPT_TXGOCTIS_WIDTH     (1U)
#define GMAC_MMC_TX_INTERRUPT_TXGOCTIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXGOCTIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXGOCTIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXGPKTIS_MASK      (0x200000U)
#define GMAC_MMC_TX_INTERRUPT_TXGPKTIS_SHIFT     (21U)
#define GMAC_MMC_TX_INTERRUPT_TXGPKTIS_WIDTH     (1U)
#define GMAC_MMC_TX_INTERRUPT_TXGPKTIS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXGPKTIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXGPKTIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_MASK    (0x400000U)
#define GMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_SHIFT   (22U)
#define GMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_WIDTH   (1U)
#define GMAC_MMC_TX_INTERRUPT_TXEXDEFPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXPAUSPIS_MASK     (0x800000U)
#define GMAC_MMC_TX_INTERRUPT_TXPAUSPIS_SHIFT    (23U)
#define GMAC_MMC_TX_INTERRUPT_TXPAUSPIS_WIDTH    (1U)
#define GMAC_MMC_TX_INTERRUPT_TXPAUSPIS(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXPAUSPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXPAUSPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXVLANGPIS_MASK    (0x1000000U)
#define GMAC_MMC_TX_INTERRUPT_TXVLANGPIS_SHIFT   (24U)
#define GMAC_MMC_TX_INTERRUPT_TXVLANGPIS_WIDTH   (1U)
#define GMAC_MMC_TX_INTERRUPT_TXVLANGPIS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXVLANGPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXVLANGPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_MASK   (0x2000000U)
#define GMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_SHIFT  (25U)
#define GMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_WIDTH  (1U)
#define GMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPIUSCIS_MASK (0x4000000U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPIUSCIS_SHIFT (26U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPIUSCIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPIUSCIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_Reserved_TXLPIUSCIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_Reserved_TXLPIUSCIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPITRCIS_MASK (0x8000000U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPITRCIS_SHIFT (27U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPITRCIS_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_TXLPITRCIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_Reserved_TXLPITRCIS_SHIFT)) & GMAC_MMC_TX_INTERRUPT_Reserved_TXLPITRCIS_MASK)

#define GMAC_MMC_TX_INTERRUPT_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_31_28_SHIFT (28U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_31_28_WIDTH (4U)
#define GMAC_MMC_TX_INTERRUPT_Reserved_31_28(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_Reserved_31_28_SHIFT)) & GMAC_MMC_TX_INTERRUPT_Reserved_31_28_MASK)
/*! @} */

/*! @name MMC_RX_INTERRUPT_MASK -  */
/*! @{ */

#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_MASK (0x1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_SHIFT (0U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXGBPKTIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_MASK (0x2U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_SHIFT (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXGBOCTIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM_MASK (0x4U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM_SHIFT (2U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXGOCTIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM_MASK (0x8U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM_SHIFT (3U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXBCGPIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM_MASK (0x10U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM_SHIFT (4U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXMCGPIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_MASK (0x20U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_SHIFT (5U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXCRCERPIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_MASK (0x40U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_SHIFT (6U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXALGNERPIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_MASK (0x80U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_SHIFT (7U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXRUNTPIM_MASK)

#define GMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM_MASK (0x100U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM_SHIFT (8U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM_WIDTH (1U)
#define GMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM_SHIFT)) & GMAC_MMC_RX_INTERRUPT_MASK_RXJABERPIM_MASK)

