zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_MASK (0x8000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_SHIFT (15U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXMCOLGPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM_MASK (0x10000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM_SHIFT (16U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXDEFPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_MASK (0x20000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_SHIFT (17U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXLATCOLPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_MASK (0x40000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_SHIFT (18U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXEXCOLPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM_MASK (0x80000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM_SHIFT (19U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXCARERPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM_MASK (0x100000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM_SHIFT (20U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXGOCTIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM_MASK (0x200000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM_SHIFT (21U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXGPKTIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_MASK (0x400000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_SHIFT (22U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXEXDEFPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_MASK (0x800000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_SHIFT (23U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXPAUSPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_MASK (0x1000000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_SHIFT (24U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXVLANGPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_MASK (0x2000000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_SHIFT (25U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_TXOSIZEGPIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPIUSCIM_MASK (0x4000000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPIUSCIM_SHIFT (26U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPIUSCIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPIUSCIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPIUSCIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPIUSCIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPITRCIM_MASK (0x8000000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPITRCIM_SHIFT (27U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPITRCIM_WIDTH (1U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPITRCIM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPITRCIM_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_Reserved_TXLPITRCIM_MASK)

#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_31_28_SHIFT (28U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_31_28_WIDTH (4U)
#define GMAC_MMC_TX_INTERRUPT_MASK_Reserved_31_28(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_TX_INTERRUPT_MASK_Reserved_31_28_SHIFT)) & GMAC_MMC_TX_INTERRUPT_MASK_Reserved_31_28_MASK)
/*! @} */

/*! @name TX_OCTET_COUNT_GOOD_BAD -  */
/*! @{ */

#define GMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MASK (0xFFFFFFFFU)
#define GMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_SHIFT (0U)
#define GMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_WIDTH (32U)
#define GMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_SHIFT)) & GMAC_TX_OCTET_COUNT_GOOD_BAD_TXOCTGB_MASK)
/*! @} */

/*! @name TX_PACKET_COUNT_GOOD_BAD -  */
/*! @{ */

#define GMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_MASK (0xFFFFFFFFU)
#define GMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_SHIFT (0U)
#define GMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_WIDTH (32U)
#define GMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB(x) (((uint32_t)(((uint32_t)(x)) << GMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_SHIFT)) & GMAC_TX_PACKET_COUNT_GOOD_BAD_TXPKTGB_MASK)
/*! @} */

/*! @name TX_BROADCAST_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_MASK (0xFFFFFFFFU)
#define GMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_SHIFT (0U)
#define GMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_WIDTH (32U)
#define GMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_SHIFT)) & GMAC_TX_BROADCAST_PACKETS_GOOD_TXBCASTG_MASK)
/*! @} */

/*! @name TX_MULTICAST_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_MASK (0xFFFFFFFFU)
#define GMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_SHIFT (0U)
#define GMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_WIDTH (32U)
#define GMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_SHIFT)) & GMAC_TX_MULTICAST_PACKETS_GOOD_TXMCASTG_MASK)
/*! @} */

