zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_MASK (0xFFFFFFFFU)
#define GMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_SHIFT (0U)
#define GMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_WIDTH (32U)
#define GMAC_TX_CARRIER_ERROR_PACKETS_TXCARR(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_SHIFT)) & GMAC_TX_CARRIER_ERROR_PACKETS_TXCARR_MASK)
/*! @} */

/*! @name TX_OCTET_COUNT_GOOD -  */
/*! @{ */

#define GMAC_TX_OCTET_COUNT_GOOD_TXOCTG_MASK     (0xFFFFFFFFU)
#define GMAC_TX_OCTET_COUNT_GOOD_TXOCTG_SHIFT    (0U)
#define GMAC_TX_OCTET_COUNT_GOOD_TXOCTG_WIDTH    (32U)
#define GMAC_TX_OCTET_COUNT_GOOD_TXOCTG(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_TX_OCTET_COUNT_GOOD_TXOCTG_SHIFT)) & GMAC_TX_OCTET_COUNT_GOOD_TXOCTG_MASK)
/*! @} */

/*! @name TX_PACKET_COUNT_GOOD -  */
/*! @{ */

#define GMAC_TX_PACKET_COUNT_GOOD_TXPKTG_MASK    (0xFFFFFFFFU)
#define GMAC_TX_PACKET_COUNT_GOOD_TXPKTG_SHIFT   (0U)
#define GMAC_TX_PACKET_COUNT_GOOD_TXPKTG_WIDTH   (32U)
#define GMAC_TX_PACKET_COUNT_GOOD_TXPKTG(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_TX_PACKET_COUNT_GOOD_TXPKTG_SHIFT)) & GMAC_TX_PACKET_COUNT_GOOD_TXPKTG_MASK)
/*! @} */

/*! @name TX_EXCESSIVE_DEFERRAL_ERROR -  */
/*! @{ */

#define GMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MASK (0xFFFFFFFFU)
#define GMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_SHIFT (0U)
#define GMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_WIDTH (32U)
#define GMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF(x) (((uint32_t)(((uint32_t)(x)) << GMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_SHIFT)) & GMAC_TX_EXCESSIVE_DEFERRAL_ERROR_TXEXSDEF_MASK)
/*! @} */

/*! @name TX_PAUSE_PACKETS -  */
/*! @{ */

#define GMAC_TX_PAUSE_PACKETS_TXPAUSE_MASK       (0xFFFFFFFFU)
#define GMAC_TX_PAUSE_PACKETS_TXPAUSE_SHIFT      (0U)
#define GMAC_TX_PAUSE_PACKETS_TXPAUSE_WIDTH      (32U)
#define GMAC_TX_PAUSE_PACKETS_TXPAUSE(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_TX_PAUSE_PACKETS_TXPAUSE_SHIFT)) & GMAC_TX_PAUSE_PACKETS_TXPAUSE_MASK)
/*! @} */

/*! @name TX_VLAN_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_MASK   (0xFFFFFFFFU)
#define GMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_SHIFT  (0U)
#define GMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_WIDTH  (32U)
#define GMAC_TX_VLAN_PACKETS_GOOD_TXVLANG(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_SHIFT)) & GMAC_TX_VLAN_PACKETS_GOOD_TXVLANG_MASK)
/*! @} */

/*! @name TX_OSIZE_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_MASK  (0xFFFFFFFFU)
#define GMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_SHIFT (0U)
#define GMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_WIDTH (32U)
#define GMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_SHIFT)) & GMAC_TX_OSIZE_PACKETS_GOOD_TXOSIZG_MASK)
/*! @} */

/*! @name RX_PACKETS_COUNT_GOOD_BAD -  */
/*! @{ */

#define GMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_MASK (0xFFFFFFFFU)
#define GMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_SHIFT (0U)
#define GMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_WIDTH (32U)
#define GMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_SHIFT)) & GMAC_RX_PACKETS_COUNT_GOOD_BAD_RXPKTGB_MASK)
/*! @} */

/*! @name RX_OCTET_COUNT_GOOD_BAD -  */
/*! @{ */

#define GMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MASK (0xFFFFFFFFU)
#define GMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_SHIFT (0U)
#define GMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_WIDTH (32U)
#define GMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_SHIFT)) & GMAC_RX_OCTET_COUNT_GOOD_BAD_RXOCTGB_MASK)
/*! @} */

/*! @name RX_OCTET_COUNT_GOOD -  */
/*! @{ */

#define GMAC_RX_OCTET_COUNT_GOOD_RXOCTG_MASK     (0xFFFFFFFFU)
#define GMAC_RX_OCTET_COUNT_GOOD_RXOCTG_SHIFT    (0U)
#define GMAC_RX_OCTET_COUNT_GOOD_RXOCTG_WIDTH    (32U)
#define GMAC_RX_OCTET_COUNT_GOOD_RXOCTG(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_RX_OCTET_COUNT_GOOD_RXOCTG_SHIFT)) & GMAC_RX_OCTET_COUNT_GOOD_RXOCTG_MASK)
/*! @} */

/*! @name RX_BROADCAST_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_MASK (0xFFFFFFFFU)
#define GMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_SHIFT (0U)
#define GMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_WIDTH (32U)
#define GMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_SHIFT)) & GMAC_RX_BROADCAST_PACKETS_GOOD_RXBCASTG_MASK)
/*! @} */

/*! @name RX_MULTICAST_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_MASK (0xFFFFFFFFU)
#define GMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_SHIFT (0U)
#define GMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_WIDTH (32U)
#define GMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_SHIFT)) & GMAC_RX_MULTICAST_PACKETS_GOOD_RXMCASTG_MASK)
/*! @} */

/*! @name RX_CRC_ERROR_PACKETS -  */
/*! @{ */

#define GMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_MASK  (0xFFFFFFFFU)
#define GMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_SHIFT (0U)
#define GMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_WIDTH (32U)
#define GMAC_RX_CRC_ERROR_PACKETS_RXCRCERR(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_SHIFT)) & GMAC_RX_CRC_ERROR_PACKETS_RXCRCERR_MASK)
/*! @} */

/*! @name RX_ALIGNMENT_ERROR_PACKETS -  */
/*! @{ */

#define GMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_MASK (0xFFFFFFFFU)
#define GMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_SHIFT (0U)
#define GMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_WIDTH (32U)
#define GMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_SHIFT)) & GMAC_RX_ALIGNMENT_ERROR_PACKETS_RXALGNERR_MASK)
/*! @} */

/*! @name RX_RUNT_ERROR_PACKETS -  */
/*! @{ */

#define GMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_MASK (0xFFFFFFFFU)
#define GMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_SHIFT (0U)
#define GMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_WIDTH (32U)
#define GMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_SHIFT)) & GMAC_RX_RUNT_ERROR_PACKETS_RXRUNTERR_MASK)
/*! @} */

/*! @name RX_JABBER_ERROR_PACKETS -  */
/*! @{ */

#define GMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_MASK (0xFFFFFFFFU)
#define GMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_SHIFT (0U)
#define GMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_WIDTH (32U)
#define GMAC_RX_JABBER_ERROR_PACKETS_RXJABERR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_SHIFT)) & GMAC_RX_JABBER_ERROR_PACKETS_RXJABERR_MASK)
/*! @} */

/*! @name RX_UNDERSIZE_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_MASK (0xFFFFFFFFU)
#define GMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_SHIFT (0U)
#define GMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_WIDTH (32U)
#define GMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_SHIFT)) & GMAC_RX_UNDERSIZE_PACKETS_GOOD_RXUNDERSZG_MASK)
/*! @} */

/*! @name RX_OVERSIZE_PACKETS_GOOD -  */
/*! @{ */

#define GMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_MASK (0xFFFFFFFFU)
#define GMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_SHIFT (0U)
#define GMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_WIDTH (32U)
#define GMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG(x) (((uint32_t)(((uint32_t)(x)) << GMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_SHIFT)) & GMAC_RX_OVERSIZE_PACKETS_GOOD_RXOVERSZG_MASK)
/*! @} */

