zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM_MASK (0x8U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM_SHIFT (3U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM_WIDTH (1U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_MASK_FCIM_MASK)

#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_Reserved_31_4_MASK (0xFFFFFFF0U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_Reserved_31_4_SHIFT (4U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_Reserved_31_4_WIDTH (28U)
#define GMAC_MMC_FPE_RX_INTERRUPT_MASK_Reserved_31_4(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_FPE_RX_INTERRUPT_MASK_Reserved_31_4_SHIFT)) & GMAC_MMC_FPE_RX_INTERRUPT_MASK_Reserved_31_4_MASK)
/*! @} */

/*! @name MMC_RX_PACKET_ASSEMBLY_ERR_CNTR -  */
/*! @{ */

#define GMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_MASK (0xFFFFFFFFU)
#define GMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_SHIFT (0U)
#define GMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_WIDTH (32U)
#define GMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_SHIFT)) & GMAC_MMC_RX_PACKET_ASSEMBLY_ERR_CNTR_PAEC_MASK)
/*! @} */

/*! @name MMC_RX_PACKET_SMD_ERR_CNTR -  */
/*! @{ */

#define GMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_MASK (0xFFFFFFFFU)
#define GMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_SHIFT (0U)
#define GMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_WIDTH (32U)
#define GMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_SHIFT)) & GMAC_MMC_RX_PACKET_SMD_ERR_CNTR_PSEC_MASK)
/*! @} */

/*! @name MMC_RX_PACKET_ASSEMBLY_OK_CNTR -  */
/*! @{ */

#define GMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_MASK (0xFFFFFFFFU)
#define GMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_SHIFT (0U)
#define GMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_WIDTH (32U)
#define GMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_SHIFT)) & GMAC_MMC_RX_PACKET_ASSEMBLY_OK_CNTR_PAOC_MASK)
/*! @} */

/*! @name MMC_RX_FPE_FRAGMENT_CNTR -  */
/*! @{ */

#define GMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_MASK   (0xFFFFFFFFU)
#define GMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_SHIFT  (0U)
#define GMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_WIDTH  (32U)
#define GMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_SHIFT)) & GMAC_MMC_RX_FPE_FRAGMENT_CNTR_FFC_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL0 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL0_L3PEN0_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL0_L3PEN0_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL0_L3PEN0_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L3PEN0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3PEN0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3PEN0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L3SAM0_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL0_L3SAM0_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL0_L3SAM0_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L3SAM0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3SAM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3SAM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L3SAIM0_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL0_L3SAIM0_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL0_L3SAIM0_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L3SAIM0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3SAIM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3SAIM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L3DAM0_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL0_L3DAM0_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL0_L3DAM0_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L3DAM0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3DAM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3DAM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L3DAIM0_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL0_L3DAIM0_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL0_L3DAIM0_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L3DAIM0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3DAIM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3DAIM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L3HSBM0_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL0_L3HSBM0_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL0_L3HSBM0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3HSBM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L3HDBM0_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL0_L3HDBM0_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL0_L3HDBM0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L3HDBM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L4PEN0_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL0_L4PEN0_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL0_L4PEN0_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L4PEN0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L4PEN0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L4PEN0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L4SPM0_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL0_L4SPM0_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL0_L4SPM0_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L4SPM0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L4SPM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L4SPM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L4SPIM0_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL0_L4SPIM0_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL0_L4SPIM0_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L4SPIM0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L4SPIM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L4SPIM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L4DPM0_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL0_L4DPM0_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL0_L4DPM0_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L4DPM0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L4DPM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L4DPM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_L4DPIM0_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL0_L4DPIM0_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL0_L4DPIM0_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL0_L4DPIM0(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_L4DPIM0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_L4DPIM0_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL0_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL0_DMCHN0_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL0_DMCHN0_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL0_DMCHN0_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL0_DMCHN0(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL0_DMCHN0_SHIFT)) & GMAC_MAC_L3_L4_CONTROL0_DMCHN0_MASK)

