zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_L3_L4_CONTROL3 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL3_L3PEN3_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL3_L3PEN3_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL3_L3PEN3_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L3PEN3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3PEN3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3PEN3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L3SAM3_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL3_L3SAM3_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL3_L3SAM3_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L3SAM3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3SAM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3SAM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L3SAIM3_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL3_L3SAIM3_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL3_L3SAIM3_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L3SAIM3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3SAIM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3SAIM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L3DAM3_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL3_L3DAM3_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL3_L3DAM3_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L3DAM3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3DAM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3DAM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L3DAIM3_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL3_L3DAIM3_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL3_L3DAIM3_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L3DAIM3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3DAIM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3DAIM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL3_L3HSBM3_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL3_L3HSBM3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL3_L3HDBM3_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL3_L3HDBM3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L4PEN3_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL3_L4PEN3_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL3_L4PEN3_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L4PEN3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L4PEN3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L4PEN3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L4SPM3_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL3_L4SPM3_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL3_L4SPM3_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L4SPM3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L4SPM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L4SPM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L4SPIM3_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL3_L4SPIM3_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL3_L4SPIM3_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L4SPIM3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L4SPIM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L4SPIM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L4DPM3_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL3_L4DPM3_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL3_L4DPM3_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L4DPM3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L4DPM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L4DPM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_L4DPIM3_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL3_L4DPIM3_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL3_L4DPIM3_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL3_L4DPIM3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_L4DPIM3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_L4DPIM3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_DMCHN3_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL3_DMCHN3_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL3_DMCHN3_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL3_DMCHN3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_DMCHN3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_DMCHN3_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL3_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL3_DMCHEN3_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL3_DMCHEN3_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL3_DMCHEN3_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL3_DMCHEN3(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL3_DMCHEN3_SHIFT)) & GMAC_MAC_L3_L4_CONTROL3_DMCHEN3_MASK)

