zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL4_L4SPIM4_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL4_L4SPIM4_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL4_L4SPIM4_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L4SPIM4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L4SPIM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L4SPIM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L4DPM4_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL4_L4DPM4_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL4_L4DPM4_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L4DPM4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L4DPM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L4DPM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_L4DPIM4_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL4_L4DPIM4_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL4_L4DPIM4_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL4_L4DPIM4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_L4DPIM4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_L4DPIM4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_DMCHN4_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL4_DMCHN4_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL4_DMCHN4_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL4_DMCHN4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_DMCHN4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_DMCHN4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_DMCHEN4_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL4_DMCHEN4_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL4_DMCHEN4_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL4_DMCHEN4(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_DMCHEN4_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_DMCHEN4_MASK)

#define GMAC_MAC_L3_L4_CONTROL4_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL4_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL4_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL4_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS4 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS4_L4SP4_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS4_L4SP4_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS4_L4SP4_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS4_L4SP4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS4_L4SP4_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS4_L4SP4_MASK)

#define GMAC_MAC_LAYER4_ADDRESS4_L4DP4_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS4_L4DP4_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS4_L4DP4_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS4_L4DP4(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS4_L4DP4_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS4_L4DP4_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG4 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG4_L3A04_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG4_L3A04_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG4_L3A04_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG4_L3A04(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG4_L3A04_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG4_L3A04_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG4 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG4_L3A14_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG4_L3A14_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG4_L3A14_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG4_L3A14(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG4_L3A14_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG4_L3A14_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG4 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG4_L3A24_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG4_L3A24_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG4_L3A24_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG4_L3A24(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG4_L3A24_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG4_L3A24_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG4 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG4_L3A34_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG4_L3A34_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG4_L3A34_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG4_L3A34(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG4_L3A34_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG4_L3A34_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL5 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL5_L3PEN5_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL5_L3PEN5_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL5_L3PEN5_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L3PEN5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3PEN5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3PEN5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L3SAM5_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL5_L3SAM5_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL5_L3SAM5_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L3SAM5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3SAM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3SAM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L3SAIM5_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL5_L3SAIM5_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL5_L3SAIM5_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L3SAIM5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3SAIM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3SAIM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L3DAM5_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL5_L3DAM5_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL5_L3DAM5_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L3DAM5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3DAM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3DAM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L3DAIM5_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL5_L3DAIM5_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL5_L3DAIM5_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L3DAIM5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3DAIM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3DAIM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L3HSBM5_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL5_L3HSBM5_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL5_L3HSBM5_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL5_L3HSBM5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3HSBM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3HSBM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L3HDBM5_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL5_L3HDBM5_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL5_L3HDBM5_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL5_L3HDBM5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L3HDBM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L3HDBM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L4PEN5_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL5_L4PEN5_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL5_L4PEN5_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L4PEN5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L4PEN5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L4PEN5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL5_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L4SPM5_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL5_L4SPM5_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL5_L4SPM5_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L4SPM5(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L4SPM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L4SPM5_MASK)

#define GMAC_MAC_L3_L4_CONTROL5_L4SPIM5_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL5_L4SPIM5_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL5_L4SPIM5_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL5_L4SPIM5(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL5_L4SPIM5_SHIFT)) & GMAC_MAC_L3_L4_CONTROL5_L4SPIM5_MASK)

