zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL6_DMCHN6_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL6_DMCHN6_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL6_DMCHN6_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL6_DMCHN6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_DMCHN6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_DMCHN6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_DMCHEN6_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL6_DMCHEN6_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL6_DMCHEN6_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL6_DMCHEN6(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_DMCHEN6_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_DMCHEN6_MASK)

#define GMAC_MAC_L3_L4_CONTROL6_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL6_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL6_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL6_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS6 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS6_L4SP6_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS6_L4SP6_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS6_L4SP6_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS6_L4SP6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS6_L4SP6_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS6_L4SP6_MASK)

#define GMAC_MAC_LAYER4_ADDRESS6_L4DP6_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS6_L4DP6_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS6_L4DP6_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS6_L4DP6(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS6_L4DP6_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS6_L4DP6_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG6 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG6_L3A06_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG6_L3A06_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG6_L3A06_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG6_L3A06(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG6_L3A06_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG6_L3A06_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG6 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG6_L3A16_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG6_L3A16_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG6_L3A16_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG6_L3A16(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG6_L3A16_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG6_L3A16_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG6 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG6_L3A26_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG6_L3A26_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG6_L3A26_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG6_L3A26(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG6_L3A26_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG6_L3A26_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG6 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG6_L3A36_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG6_L3A36_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG6_L3A36_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG6_L3A36(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG6_L3A36_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG6_L3A36_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL7 -  */
/*! @{ */

#define GMAC_MAC_L3_L4_CONTROL7_L3PEN7_MASK      (0x1U)
#define GMAC_MAC_L3_L4_CONTROL7_L3PEN7_SHIFT     (0U)
#define GMAC_MAC_L3_L4_CONTROL7_L3PEN7_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L3PEN7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3PEN7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3PEN7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_Reserved_1_MASK  (0x2U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_1_SHIFT (1U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_1_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_1(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_Reserved_1_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_Reserved_1_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L3SAM7_MASK      (0x4U)
#define GMAC_MAC_L3_L4_CONTROL7_L3SAM7_SHIFT     (2U)
#define GMAC_MAC_L3_L4_CONTROL7_L3SAM7_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L3SAM7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3SAM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3SAM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L3SAIM7_MASK     (0x8U)
#define GMAC_MAC_L3_L4_CONTROL7_L3SAIM7_SHIFT    (3U)
#define GMAC_MAC_L3_L4_CONTROL7_L3SAIM7_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L3SAIM7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3SAIM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3SAIM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L3DAM7_MASK      (0x10U)
#define GMAC_MAC_L3_L4_CONTROL7_L3DAM7_SHIFT     (4U)
#define GMAC_MAC_L3_L4_CONTROL7_L3DAM7_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L3DAM7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3DAM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3DAM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L3DAIM7_MASK     (0x20U)
#define GMAC_MAC_L3_L4_CONTROL7_L3DAIM7_SHIFT    (5U)
#define GMAC_MAC_L3_L4_CONTROL7_L3DAIM7_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L3DAIM7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3DAIM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3DAIM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L3HSBM7_MASK     (0x7C0U)
#define GMAC_MAC_L3_L4_CONTROL7_L3HSBM7_SHIFT    (6U)
#define GMAC_MAC_L3_L4_CONTROL7_L3HSBM7_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL7_L3HSBM7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3HSBM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3HSBM7_MASK)

