zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_L3_L4_CONTROL7_L3HDBM7_MASK     (0xF800U)
#define GMAC_MAC_L3_L4_CONTROL7_L3HDBM7_SHIFT    (11U)
#define GMAC_MAC_L3_L4_CONTROL7_L3HDBM7_WIDTH    (5U)
#define GMAC_MAC_L3_L4_CONTROL7_L3HDBM7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L3HDBM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L3HDBM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L4PEN7_MASK      (0x10000U)
#define GMAC_MAC_L3_L4_CONTROL7_L4PEN7_SHIFT     (16U)
#define GMAC_MAC_L3_L4_CONTROL7_L4PEN7_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L4PEN7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L4PEN7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L4PEN7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_Reserved_17_MASK (0x20000U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_17_SHIFT (17U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_17_WIDTH (1U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_Reserved_17_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_Reserved_17_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L4SPM7_MASK      (0x40000U)
#define GMAC_MAC_L3_L4_CONTROL7_L4SPM7_SHIFT     (18U)
#define GMAC_MAC_L3_L4_CONTROL7_L4SPM7_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L4SPM7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L4SPM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L4SPM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L4SPIM7_MASK     (0x80000U)
#define GMAC_MAC_L3_L4_CONTROL7_L4SPIM7_SHIFT    (19U)
#define GMAC_MAC_L3_L4_CONTROL7_L4SPIM7_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L4SPIM7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L4SPIM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L4SPIM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L4DPM7_MASK      (0x100000U)
#define GMAC_MAC_L3_L4_CONTROL7_L4DPM7_SHIFT     (20U)
#define GMAC_MAC_L3_L4_CONTROL7_L4DPM7_WIDTH     (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L4DPM7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L4DPM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L4DPM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_L4DPIM7_MASK     (0x200000U)
#define GMAC_MAC_L3_L4_CONTROL7_L4DPIM7_SHIFT    (21U)
#define GMAC_MAC_L3_L4_CONTROL7_L4DPIM7_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL7_L4DPIM7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_L4DPIM7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_L4DPIM7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_Reserved_23_22_MASK (0xC00000U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_23_22_SHIFT (22U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_23_22_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_23_22(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_Reserved_23_22_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_Reserved_23_22_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_DMCHN7_MASK      (0x3000000U)
#define GMAC_MAC_L3_L4_CONTROL7_DMCHN7_SHIFT     (24U)
#define GMAC_MAC_L3_L4_CONTROL7_DMCHN7_WIDTH     (2U)
#define GMAC_MAC_L3_L4_CONTROL7_DMCHN7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_DMCHN7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_DMCHN7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_27_y_SHIFT (26U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_27_y_WIDTH (2U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_27_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_Reserved_27_y_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_Reserved_27_y_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_DMCHEN7_MASK     (0x10000000U)
#define GMAC_MAC_L3_L4_CONTROL7_DMCHEN7_SHIFT    (28U)
#define GMAC_MAC_L3_L4_CONTROL7_DMCHEN7_WIDTH    (1U)
#define GMAC_MAC_L3_L4_CONTROL7_DMCHEN7(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_DMCHEN7_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_DMCHEN7_MASK)

#define GMAC_MAC_L3_L4_CONTROL7_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_31_29_SHIFT (29U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_31_29_WIDTH (3U)
#define GMAC_MAC_L3_L4_CONTROL7_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_L3_L4_CONTROL7_Reserved_31_29_SHIFT)) & GMAC_MAC_L3_L4_CONTROL7_Reserved_31_29_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS7 -  */
/*! @{ */

#define GMAC_MAC_LAYER4_ADDRESS7_L4SP7_MASK      (0xFFFFU)
#define GMAC_MAC_LAYER4_ADDRESS7_L4SP7_SHIFT     (0U)
#define GMAC_MAC_LAYER4_ADDRESS7_L4SP7_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS7_L4SP7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS7_L4SP7_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS7_L4SP7_MASK)

#define GMAC_MAC_LAYER4_ADDRESS7_L4DP7_MASK      (0xFFFF0000U)
#define GMAC_MAC_LAYER4_ADDRESS7_L4DP7_SHIFT     (16U)
#define GMAC_MAC_LAYER4_ADDRESS7_L4DP7_WIDTH     (16U)
#define GMAC_MAC_LAYER4_ADDRESS7_L4DP7(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER4_ADDRESS7_L4DP7_SHIFT)) & GMAC_MAC_LAYER4_ADDRESS7_L4DP7_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG7 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR0_REG7_L3A07_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR0_REG7_L3A07_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR0_REG7_L3A07_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR0_REG7_L3A07(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR0_REG7_L3A07_SHIFT)) & GMAC_MAC_LAYER3_ADDR0_REG7_L3A07_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG7 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR1_REG7_L3A17_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR1_REG7_L3A17_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR1_REG7_L3A17_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR1_REG7_L3A17(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR1_REG7_L3A17_SHIFT)) & GMAC_MAC_LAYER3_ADDR1_REG7_L3A17_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG7 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR2_REG7_L3A27_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR2_REG7_L3A27_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR2_REG7_L3A27_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR2_REG7_L3A27(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR2_REG7_L3A27_SHIFT)) & GMAC_MAC_LAYER3_ADDR2_REG7_L3A27_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG7 -  */
/*! @{ */

#define GMAC_MAC_LAYER3_ADDR3_REG7_L3A37_MASK    (0xFFFFFFFFU)
#define GMAC_MAC_LAYER3_ADDR3_REG7_L3A37_SHIFT   (0U)
#define GMAC_MAC_LAYER3_ADDR3_REG7_L3A37_WIDTH   (32U)
#define GMAC_MAC_LAYER3_ADDR3_REG7_L3A37(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_LAYER3_ADDR3_REG7_L3A37_SHIFT)) & GMAC_MAC_LAYER3_ADDR3_REG7_L3A37_MASK)
/*! @} */

