zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_TMRQ_REGS2_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS2_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS2_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS2_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS2_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS2_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS3 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS3_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS3_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS3_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS3_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS3_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS3_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS3_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS3_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS3_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS3_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS3_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS3_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS3_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS3_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS3_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS3_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS3_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS3_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS3_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS3_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS3_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS3_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS3_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS3_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS3_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS3_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS3_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS3_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS3_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS3_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS4 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS4_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS4_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS4_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS4_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS4_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS4_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS4_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS4_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS4_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS4_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS4_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS4_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS4_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS4_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS4_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS4_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS4_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS4_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS4_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS4_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS4_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS4_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS4_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS4_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS4_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS4_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS4_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS4_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS4_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS4_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS5 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS5_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS5_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS5_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS5_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS5_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS5_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS5_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS5_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS5_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS5_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS5_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS5_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS5_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS5_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS5_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS5_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS5_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS5_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS5_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS5_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS5_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS5_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS5_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS5_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS5_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS5_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS5_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS5_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS5_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS5_Reserved_31_21_MASK)
/*! @} */

/*! @name MAC_TMRQ_REGS6 -  */
/*! @{ */

#define GMAC_MAC_TMRQ_REGS6_TYP_MASK             (0xFFFFU)
#define GMAC_MAC_TMRQ_REGS6_TYP_SHIFT            (0U)
#define GMAC_MAC_TMRQ_REGS6_TYP_WIDTH            (16U)
#define GMAC_MAC_TMRQ_REGS6_TYP(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS6_TYP_SHIFT)) & GMAC_MAC_TMRQ_REGS6_TYP_MASK)

#define GMAC_MAC_TMRQ_REGS6_TMRQ_MASK            (0x70000U)
#define GMAC_MAC_TMRQ_REGS6_TMRQ_SHIFT           (16U)
#define GMAC_MAC_TMRQ_REGS6_TMRQ_WIDTH           (3U)
#define GMAC_MAC_TMRQ_REGS6_TMRQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS6_TMRQ_SHIFT)) & GMAC_MAC_TMRQ_REGS6_TMRQ_MASK)

#define GMAC_MAC_TMRQ_REGS6_Reserved_19_MASK     (0x80000U)
#define GMAC_MAC_TMRQ_REGS6_Reserved_19_SHIFT    (19U)
#define GMAC_MAC_TMRQ_REGS6_Reserved_19_WIDTH    (1U)
#define GMAC_MAC_TMRQ_REGS6_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS6_Reserved_19_SHIFT)) & GMAC_MAC_TMRQ_REGS6_Reserved_19_MASK)

#define GMAC_MAC_TMRQ_REGS6_PFEX_MASK            (0x100000U)
#define GMAC_MAC_TMRQ_REGS6_PFEX_SHIFT           (20U)
#define GMAC_MAC_TMRQ_REGS6_PFEX_WIDTH           (1U)
#define GMAC_MAC_TMRQ_REGS6_PFEX(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS6_PFEX_SHIFT)) & GMAC_MAC_TMRQ_REGS6_PFEX_MASK)

#define GMAC_MAC_TMRQ_REGS6_Reserved_31_21_MASK  (0xFFE00000U)
#define GMAC_MAC_TMRQ_REGS6_Reserved_31_21_SHIFT (21U)
#define GMAC_MAC_TMRQ_REGS6_Reserved_31_21_WIDTH (11U)
#define GMAC_MAC_TMRQ_REGS6_Reserved_31_21(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TMRQ_REGS6_Reserved_31_21_SHIFT)) & GMAC_MAC_TMRQ_REGS6_Reserved_31_21_MASK)
/*! @} */

