zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MAC_TIMESTAMP_STATUS_TXTSSIS_MASK   (0x8000U)
#define GMAC_MAC_TIMESTAMP_STATUS_TXTSSIS_SHIFT  (15U)
#define GMAC_MAC_TIMESTAMP_STATUS_TXTSSIS_WIDTH  (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_TXTSSIS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_TXTSSIS_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_TXTSSIS_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTN_MASK (0xF0000U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTN_SHIFT (16U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTN_WIDTH (4U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTN_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTN_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_23_20_MASK (0xF00000U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_23_20_SHIFT (20U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_23_20_WIDTH (4U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_23_20(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_23_20_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_23_20_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTM_MASK (0x1000000U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTM_SHIFT (24U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTM_WIDTH (1U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTM(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTM_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSSTM_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSNS_MASK (0x3E000000U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSNS_SHIFT (25U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSNS_WIDTH (5U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSNS_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_ATSNS_MASK)

#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_31_30_MASK (0xC0000000U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_31_30_SHIFT (30U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_31_30_WIDTH (2U)
#define GMAC_MAC_TIMESTAMP_STATUS_Reserved_31_30(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_STATUS_Reserved_31_30_SHIFT)) & GMAC_MAC_TIMESTAMP_STATUS_Reserved_31_30_MASK)
/*! @} */

/*! @name MAC_TX_TIMESTAMP_STATUS_NANOSECONDS -  */
/*! @{ */

#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_MASK (0x7FFFFFFFU)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_SHIFT (0U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_WIDTH (31U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_SHIFT)) & GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSLO_MASK)

#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_MASK (0x80000000U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_SHIFT (31U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_WIDTH (1U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_SHIFT)) & GMAC_MAC_TX_TIMESTAMP_STATUS_NANOSECONDS_TXTSSMIS_MASK)
/*! @} */

/*! @name MAC_TX_TIMESTAMP_STATUS_SECONDS -  */
/*! @{ */

#define GMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_MASK (0xFFFFFFFFU)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_SHIFT (0U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_WIDTH (32U)
#define GMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_SHIFT)) & GMAC_MAC_TX_TIMESTAMP_STATUS_SECONDS_TXTSSHI_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_INGRESS_ASYM_CORR -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_MASK (0xFFFFFFFFU)
#define GMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_WIDTH (32U)
#define GMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_ASYM_CORR_OSTIAC_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_EGRESS_ASYM_CORR -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_MASK (0xFFFFFFFFU)
#define GMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_WIDTH (32U)
#define GMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_ASYM_CORR_OSTEAC_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_MASK (0xFFFFFFFFU)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_WIDTH (32U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_CORR_NANOSECOND_TSIC_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_MASK (0xFFFFFFFFU)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_WIDTH (32U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_CORR_NANOSECOND_TSEC_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_7_0_MASK (0xFFU)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_7_0_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_7_0_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_7_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_7_0_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_7_0_MASK)

#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_MASK (0xFF00U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_SHIFT (8U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_TSICSNS_MASK)

#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_31_16_SHIFT (16U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_31_16_WIDTH (16U)
#define GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_31_16_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_CORR_SUBNANOSEC_Reserved_31_16_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_7_0_MASK (0xFFU)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_7_0_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_7_0_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_7_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_7_0_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_7_0_MASK)

#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_MASK (0xFF00U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_SHIFT (8U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_TSECSNS_MASK)

#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_31_16_SHIFT (16U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_31_16_WIDTH (16U)
#define GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_31_16_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_CORR_SUBNANOSEC_Reserved_31_16_MASK)
/*! @} */

