zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_TIMESTAMP_INGRESS_LATENCY -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_7_0_MASK (0xFFU)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_7_0_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_7_0_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_7_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_7_0_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_7_0_MASK)

#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_MASK (0xFF00U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT (8U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_MASK)

#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_MASK (0xFFF0000U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT (16U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_WIDTH (12U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_MASK)

#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_31_28_SHIFT (28U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_31_28_WIDTH (4U)
#define GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_31_28(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_31_28_SHIFT)) & GMAC_MAC_TIMESTAMP_INGRESS_LATENCY_Reserved_31_28_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_EGRESS_LATENCY -  */
/*! @{ */

#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_7_0_MASK (0xFFU)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_7_0_SHIFT (0U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_7_0_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_7_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_7_0_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_7_0_MASK)

#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_MASK (0xFF00U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT (8U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_WIDTH (8U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_MASK)

#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_MASK (0xFFF0000U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT (16U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_WIDTH (12U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_MASK)

#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_31_28_MASK (0xF0000000U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_31_28_SHIFT (28U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_31_28_WIDTH (4U)
#define GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_31_28(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_31_28_SHIFT)) & GMAC_MAC_TIMESTAMP_EGRESS_LATENCY_Reserved_31_28_MASK)
/*! @} */

/*! @name MAC_PPS_CONTROL -  */
/*! @{ */

#define GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK (0xFU)
#define GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT (0U)
#define GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_WIDTH (4U)
#define GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT)) & GMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK)

#define GMAC_MAC_PPS_CONTROL_PPSEN0_MASK         (0x10U)
#define GMAC_MAC_PPS_CONTROL_PPSEN0_SHIFT        (4U)
#define GMAC_MAC_PPS_CONTROL_PPSEN0_WIDTH        (1U)
#define GMAC_MAC_PPS_CONTROL_PPSEN0(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_PPSEN0_SHIFT)) & GMAC_MAC_PPS_CONTROL_PPSEN0_MASK)

#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL0_MASK    (0x60U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT   (5U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL0_WIDTH   (2U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL0(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT)) & GMAC_MAC_PPS_CONTROL_TRGTMODSEL0_MASK)

#define GMAC_MAC_PPS_CONTROL_MCGREN0_MASK        (0x80U)
#define GMAC_MAC_PPS_CONTROL_MCGREN0_SHIFT       (7U)
#define GMAC_MAC_PPS_CONTROL_MCGREN0_WIDTH       (1U)
#define GMAC_MAC_PPS_CONTROL_MCGREN0(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_MCGREN0_SHIFT)) & GMAC_MAC_PPS_CONTROL_MCGREN0_MASK)

#define GMAC_MAC_PPS_CONTROL_PPSCMD1_MASK        (0xF00U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT       (8U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD1_WIDTH       (4U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD1(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT)) & GMAC_MAC_PPS_CONTROL_PPSCMD1_MASK)

#define GMAC_MAC_PPS_CONTROL_Reserved_12_MASK    (0x1000U)
#define GMAC_MAC_PPS_CONTROL_Reserved_12_SHIFT   (12U)
#define GMAC_MAC_PPS_CONTROL_Reserved_12_WIDTH   (1U)
#define GMAC_MAC_PPS_CONTROL_Reserved_12(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_Reserved_12_SHIFT)) & GMAC_MAC_PPS_CONTROL_Reserved_12_MASK)

#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL1_MASK    (0x6000U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT   (13U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL1_WIDTH   (2U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL1(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT)) & GMAC_MAC_PPS_CONTROL_TRGTMODSEL1_MASK)

#define GMAC_MAC_PPS_CONTROL_MCGREN1_MASK        (0x8000U)
#define GMAC_MAC_PPS_CONTROL_MCGREN1_SHIFT       (15U)
#define GMAC_MAC_PPS_CONTROL_MCGREN1_WIDTH       (1U)
#define GMAC_MAC_PPS_CONTROL_MCGREN1(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_MCGREN1_SHIFT)) & GMAC_MAC_PPS_CONTROL_MCGREN1_MASK)

#define GMAC_MAC_PPS_CONTROL_PPSCMD2_MASK        (0xF0000U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT       (16U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD2_WIDTH       (4U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD2(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT)) & GMAC_MAC_PPS_CONTROL_PPSCMD2_MASK)

#define GMAC_MAC_PPS_CONTROL_Reserved_20_MASK    (0x100000U)
#define GMAC_MAC_PPS_CONTROL_Reserved_20_SHIFT   (20U)
#define GMAC_MAC_PPS_CONTROL_Reserved_20_WIDTH   (1U)
#define GMAC_MAC_PPS_CONTROL_Reserved_20(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_Reserved_20_SHIFT)) & GMAC_MAC_PPS_CONTROL_Reserved_20_MASK)

#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL2_MASK    (0x600000U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT   (21U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL2_WIDTH   (2U)
#define GMAC_MAC_PPS_CONTROL_TRGTMODSEL2(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT)) & GMAC_MAC_PPS_CONTROL_TRGTMODSEL2_MASK)

#define GMAC_MAC_PPS_CONTROL_MCGREN2_MASK        (0x800000U)
#define GMAC_MAC_PPS_CONTROL_MCGREN2_SHIFT       (23U)
#define GMAC_MAC_PPS_CONTROL_MCGREN2_WIDTH       (1U)
#define GMAC_MAC_PPS_CONTROL_MCGREN2(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_MCGREN2_SHIFT)) & GMAC_MAC_PPS_CONTROL_MCGREN2_MASK)

#define GMAC_MAC_PPS_CONTROL_PPSCMD3_MASK        (0xF000000U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD3_SHIFT       (24U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD3_WIDTH       (4U)
#define GMAC_MAC_PPS_CONTROL_PPSCMD3(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS_CONTROL_PPSCMD3_SHIFT)) & GMAC_MAC_PPS_CONTROL_PPSCMD3_MASK)

