zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MAC_PPS2_INTERVAL -  */
/*! @{ */

#define GMAC_MAC_PPS2_INTERVAL_PPSINT2_MASK      (0xFFFFFFFFU)
#define GMAC_MAC_PPS2_INTERVAL_PPSINT2_SHIFT     (0U)
#define GMAC_MAC_PPS2_INTERVAL_PPSINT2_WIDTH     (32U)
#define GMAC_MAC_PPS2_INTERVAL_PPSINT2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS2_INTERVAL_PPSINT2_SHIFT)) & GMAC_MAC_PPS2_INTERVAL_PPSINT2_MASK)
/*! @} */

/*! @name MAC_PPS2_WIDTH -  */
/*! @{ */

#define GMAC_MAC_PPS2_WIDTH_PPSWIDTH2_MASK       (0xFFFFFFFFU)
#define GMAC_MAC_PPS2_WIDTH_PPSWIDTH2_SHIFT      (0U)
#define GMAC_MAC_PPS2_WIDTH_PPSWIDTH2_WIDTH      (32U)
#define GMAC_MAC_PPS2_WIDTH_PPSWIDTH2(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS2_WIDTH_PPSWIDTH2_SHIFT)) & GMAC_MAC_PPS2_WIDTH_PPSWIDTH2_MASK)
/*! @} */

/*! @name MAC_PPS3_TARGET_TIME_SECONDS -  */
/*! @{ */

#define GMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_MASK (0xFFFFFFFFU)
#define GMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT (0U)
#define GMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_WIDTH (32U)
#define GMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT)) & GMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_MASK)
/*! @} */

/*! @name MAC_PPS3_TARGET_TIME_NANOSECONDS -  */
/*! @{ */

#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_MASK (0x7FFFFFFFU)
#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT (0U)
#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_WIDTH (31U)
#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT)) & GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_MASK)

#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_MASK (0x80000000U)
#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_SHIFT (31U)
#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_WIDTH (1U)
#define GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_SHIFT)) & GMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_MASK)
/*! @} */

/*! @name MAC_PPS3_INTERVAL -  */
/*! @{ */

#define GMAC_MAC_PPS3_INTERVAL_PPSINT3_MASK      (0xFFFFFFFFU)
#define GMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT     (0U)
#define GMAC_MAC_PPS3_INTERVAL_PPSINT3_WIDTH     (32U)
#define GMAC_MAC_PPS3_INTERVAL_PPSINT3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT)) & GMAC_MAC_PPS3_INTERVAL_PPSINT3_MASK)
/*! @} */

/*! @name MAC_PPS3_WIDTH -  */
/*! @{ */

#define GMAC_MAC_PPS3_WIDTH_PPSWIDTH3_MASK       (0xFFFFFFFFU)
#define GMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT      (0U)
#define GMAC_MAC_PPS3_WIDTH_PPSWIDTH3_WIDTH      (32U)
#define GMAC_MAC_PPS3_WIDTH_PPSWIDTH3(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT)) & GMAC_MAC_PPS3_WIDTH_PPSWIDTH3_MASK)
/*! @} */

/*! @name MTL_OPERATION_MODE -  */
/*! @{ */

#define GMAC_MTL_OPERATION_MODE_Reserved_0_MASK  (0x1U)
#define GMAC_MTL_OPERATION_MODE_Reserved_0_SHIFT (0U)
#define GMAC_MTL_OPERATION_MODE_Reserved_0_WIDTH (1U)
#define GMAC_MTL_OPERATION_MODE_Reserved_0(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_Reserved_0_SHIFT)) & GMAC_MTL_OPERATION_MODE_Reserved_0_MASK)

#define GMAC_MTL_OPERATION_MODE_DTXSTS_MASK      (0x2U)
#define GMAC_MTL_OPERATION_MODE_DTXSTS_SHIFT     (1U)
#define GMAC_MTL_OPERATION_MODE_DTXSTS_WIDTH     (1U)
#define GMAC_MTL_OPERATION_MODE_DTXSTS(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_DTXSTS_SHIFT)) & GMAC_MTL_OPERATION_MODE_DTXSTS_MASK)

#define GMAC_MTL_OPERATION_MODE_RAA_MASK         (0x4U)
#define GMAC_MTL_OPERATION_MODE_RAA_SHIFT        (2U)
#define GMAC_MTL_OPERATION_MODE_RAA_WIDTH        (1U)
#define GMAC_MTL_OPERATION_MODE_RAA(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_RAA_SHIFT)) & GMAC_MTL_OPERATION_MODE_RAA_MASK)

#define GMAC_MTL_OPERATION_MODE_Reserved_4_3_MASK (0x18U)
#define GMAC_MTL_OPERATION_MODE_Reserved_4_3_SHIFT (3U)
#define GMAC_MTL_OPERATION_MODE_Reserved_4_3_WIDTH (2U)
#define GMAC_MTL_OPERATION_MODE_Reserved_4_3(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_Reserved_4_3_SHIFT)) & GMAC_MTL_OPERATION_MODE_Reserved_4_3_MASK)

#define GMAC_MTL_OPERATION_MODE_SCHALG_MASK      (0x60U)
#define GMAC_MTL_OPERATION_MODE_SCHALG_SHIFT     (5U)
#define GMAC_MTL_OPERATION_MODE_SCHALG_WIDTH     (2U)
#define GMAC_MTL_OPERATION_MODE_SCHALG(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_SCHALG_SHIFT)) & GMAC_MTL_OPERATION_MODE_SCHALG_MASK)

#define GMAC_MTL_OPERATION_MODE_Reserved_7_MASK  (0x80U)
#define GMAC_MTL_OPERATION_MODE_Reserved_7_SHIFT (7U)
#define GMAC_MTL_OPERATION_MODE_Reserved_7_WIDTH (1U)
#define GMAC_MTL_OPERATION_MODE_Reserved_7(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_Reserved_7_SHIFT)) & GMAC_MTL_OPERATION_MODE_Reserved_7_MASK)

#define GMAC_MTL_OPERATION_MODE_CNTPRST_MASK     (0x100U)
#define GMAC_MTL_OPERATION_MODE_CNTPRST_SHIFT    (8U)
#define GMAC_MTL_OPERATION_MODE_CNTPRST_WIDTH    (1U)
#define GMAC_MTL_OPERATION_MODE_CNTPRST(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_CNTPRST_SHIFT)) & GMAC_MTL_OPERATION_MODE_CNTPRST_MASK)

#define GMAC_MTL_OPERATION_MODE_CNTCLR_MASK      (0x200U)
#define GMAC_MTL_OPERATION_MODE_CNTCLR_SHIFT     (9U)
#define GMAC_MTL_OPERATION_MODE_CNTCLR_WIDTH     (1U)
#define GMAC_MTL_OPERATION_MODE_CNTCLR(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_CNTCLR_SHIFT)) & GMAC_MTL_OPERATION_MODE_CNTCLR_MASK)

#define GMAC_MTL_OPERATION_MODE_Reserved_13_10_MASK (0x3C00U)
#define GMAC_MTL_OPERATION_MODE_Reserved_13_10_SHIFT (10U)
#define GMAC_MTL_OPERATION_MODE_Reserved_13_10_WIDTH (4U)
#define GMAC_MTL_OPERATION_MODE_Reserved_13_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_Reserved_13_10_SHIFT)) & GMAC_MTL_OPERATION_MODE_Reserved_13_10_MASK)

#define GMAC_MTL_OPERATION_MODE_RXPED_MASK       (0x4000U)
#define GMAC_MTL_OPERATION_MODE_RXPED_SHIFT      (14U)
#define GMAC_MTL_OPERATION_MODE_RXPED_WIDTH      (1U)
#define GMAC_MTL_OPERATION_MODE_RXPED(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_RXPED_SHIFT)) & GMAC_MTL_OPERATION_MODE_RXPED_MASK)

#define GMAC_MTL_OPERATION_MODE_FRPE_MASK        (0x8000U)
#define GMAC_MTL_OPERATION_MODE_FRPE_SHIFT       (15U)
#define GMAC_MTL_OPERATION_MODE_FRPE_WIDTH       (1U)
#define GMAC_MTL_OPERATION_MODE_FRPE(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_FRPE_SHIFT)) & GMAC_MTL_OPERATION_MODE_FRPE_MASK)

#define GMAC_MTL_OPERATION_MODE_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_MTL_OPERATION_MODE_Reserved_31_16_SHIFT (16U)
#define GMAC_MTL_OPERATION_MODE_Reserved_31_16_WIDTH (16U)
#define GMAC_MTL_OPERATION_MODE_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_OPERATION_MODE_Reserved_31_16_SHIFT)) & GMAC_MTL_OPERATION_MODE_Reserved_31_16_MASK)
/*! @} */

/*! @name MTL_DBG_CTL -  */
/*! @{ */

#define GMAC_MTL_DBG_CTL_FDBGEN_MASK             (0x1U)
#define GMAC_MTL_DBG_CTL_FDBGEN_SHIFT            (0U)
#define GMAC_MTL_DBG_CTL_FDBGEN_WIDTH            (1U)
#define GMAC_MTL_DBG_CTL_FDBGEN(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_FDBGEN_SHIFT)) & GMAC_MTL_DBG_CTL_FDBGEN_MASK)

#define GMAC_MTL_DBG_CTL_DBGMOD_MASK             (0x2U)
#define GMAC_MTL_DBG_CTL_DBGMOD_SHIFT            (1U)
#define GMAC_MTL_DBG_CTL_DBGMOD_WIDTH            (1U)
#define GMAC_MTL_DBG_CTL_DBGMOD(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_DBGMOD_SHIFT)) & GMAC_MTL_DBG_CTL_DBGMOD_MASK)

#define GMAC_MTL_DBG_CTL_BYTEEN_MASK             (0xCU)
#define GMAC_MTL_DBG_CTL_BYTEEN_SHIFT            (2U)
#define GMAC_MTL_DBG_CTL_BYTEEN_WIDTH            (2U)
#define GMAC_MTL_DBG_CTL_BYTEEN(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_BYTEEN_SHIFT)) & GMAC_MTL_DBG_CTL_BYTEEN_MASK)

#define GMAC_MTL_DBG_CTL_Reserved_4_MASK         (0x10U)
#define GMAC_MTL_DBG_CTL_Reserved_4_SHIFT        (4U)
#define GMAC_MTL_DBG_CTL_Reserved_4_WIDTH        (1U)
#define GMAC_MTL_DBG_CTL_Reserved_4(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_Reserved_4_SHIFT)) & GMAC_MTL_DBG_CTL_Reserved_4_MASK)

#define GMAC_MTL_DBG_CTL_PKTSTATE_MASK           (0x60U)
#define GMAC_MTL_DBG_CTL_PKTSTATE_SHIFT          (5U)
#define GMAC_MTL_DBG_CTL_PKTSTATE_WIDTH          (2U)
#define GMAC_MTL_DBG_CTL_PKTSTATE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_PKTSTATE_SHIFT)) & GMAC_MTL_DBG_CTL_PKTSTATE_MASK)

#define GMAC_MTL_DBG_CTL_Reserved_7_MASK         (0x80U)
#define GMAC_MTL_DBG_CTL_Reserved_7_SHIFT        (7U)
#define GMAC_MTL_DBG_CTL_Reserved_7_WIDTH        (1U)
#define GMAC_MTL_DBG_CTL_Reserved_7(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_Reserved_7_SHIFT)) & GMAC_MTL_DBG_CTL_Reserved_7_MASK)

#define GMAC_MTL_DBG_CTL_RSTALL_MASK             (0x100U)
#define GMAC_MTL_DBG_CTL_RSTALL_SHIFT            (8U)
#define GMAC_MTL_DBG_CTL_RSTALL_WIDTH            (1U)
#define GMAC_MTL_DBG_CTL_RSTALL(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_RSTALL_SHIFT)) & GMAC_MTL_DBG_CTL_RSTALL_MASK)

#define GMAC_MTL_DBG_CTL_RSTSEL_MASK             (0x200U)
#define GMAC_MTL_DBG_CTL_RSTSEL_SHIFT            (9U)
#define GMAC_MTL_DBG_CTL_RSTSEL_WIDTH            (1U)
#define GMAC_MTL_DBG_CTL_RSTSEL(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_RSTSEL_SHIFT)) & GMAC_MTL_DBG_CTL_RSTSEL_MASK)

#define GMAC_MTL_DBG_CTL_FIFORDEN_MASK           (0x400U)
#define GMAC_MTL_DBG_CTL_FIFORDEN_SHIFT          (10U)
#define GMAC_MTL_DBG_CTL_FIFORDEN_WIDTH          (1U)
#define GMAC_MTL_DBG_CTL_FIFORDEN(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_FIFORDEN_SHIFT)) & GMAC_MTL_DBG_CTL_FIFORDEN_MASK)

#define GMAC_MTL_DBG_CTL_FIFOWREN_MASK           (0x800U)
#define GMAC_MTL_DBG_CTL_FIFOWREN_SHIFT          (11U)
#define GMAC_MTL_DBG_CTL_FIFOWREN_WIDTH          (1U)
#define GMAC_MTL_DBG_CTL_FIFOWREN(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_FIFOWREN_SHIFT)) & GMAC_MTL_DBG_CTL_FIFOWREN_MASK)

#define GMAC_MTL_DBG_CTL_FIFOSEL_MASK            (0x3000U)
#define GMAC_MTL_DBG_CTL_FIFOSEL_SHIFT           (12U)
#define GMAC_MTL_DBG_CTL_FIFOSEL_WIDTH           (2U)
#define GMAC_MTL_DBG_CTL_FIFOSEL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_FIFOSEL_SHIFT)) & GMAC_MTL_DBG_CTL_FIFOSEL_MASK)

#define GMAC_MTL_DBG_CTL_PKTIE_MASK              (0x4000U)
#define GMAC_MTL_DBG_CTL_PKTIE_SHIFT             (14U)
#define GMAC_MTL_DBG_CTL_PKTIE_WIDTH             (1U)
#define GMAC_MTL_DBG_CTL_PKTIE(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DBG_CTL_PKTIE_SHIFT)) & GMAC_MTL_DBG_CTL_PKTIE_MASK)

