zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_RXQ_DMA_MAP0_Q2MDMACH_MASK      (0x30000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q2MDMACH_SHIFT     (16U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q2MDMACH_WIDTH     (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q2MDMACH(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Q2MDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Q2MDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_19_y_MASK (0xC0000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_19_y_SHIFT (18U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_19_y_WIDTH (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_19_y(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_19_y_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_19_y_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Q2DDMACH_MASK      (0x100000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q2DDMACH_SHIFT     (20U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q2DDMACH_WIDTH     (1U)
#define GMAC_MTL_RXQ_DMA_MAP0_Q2DDMACH(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Q2DDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Q2DDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_23_21_MASK (0xE00000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_23_21_SHIFT (21U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_23_21_WIDTH (3U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_23_21(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_23_21_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_23_21_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3MDMACH_MASK (0x3000000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3MDMACH_SHIFT (24U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3MDMACH_WIDTH (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3MDMACH(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3MDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3MDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_27_y_MASK (0xC000000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_27_y_SHIFT (26U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_27_y_WIDTH (2U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_27_y(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_27_y_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_27_y_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3DDMACH_MASK (0x10000000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3DDMACH_SHIFT (28U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3DDMACH_WIDTH (1U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3DDMACH(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3DDMACH_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_Q3DDMACH_MASK)

#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_31_29_SHIFT (29U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_31_29_WIDTH (3U)
#define GMAC_MTL_RXQ_DMA_MAP0_Reserved_31_29(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ_DMA_MAP0_Reserved_31_29_SHIFT)) & GMAC_MTL_RXQ_DMA_MAP0_Reserved_31_29_MASK)
/*! @} */

/*! @name MTL_TBS_CTRL -  */
/*! @{ */

#define GMAC_MTL_TBS_CTRL_ESTM_MASK              (0x1U)
#define GMAC_MTL_TBS_CTRL_ESTM_SHIFT             (0U)
#define GMAC_MTL_TBS_CTRL_ESTM_WIDTH             (1U)
#define GMAC_MTL_TBS_CTRL_ESTM(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TBS_CTRL_ESTM_SHIFT)) & GMAC_MTL_TBS_CTRL_ESTM_MASK)

#define GMAC_MTL_TBS_CTRL_LEOV_MASK              (0x2U)
#define GMAC_MTL_TBS_CTRL_LEOV_SHIFT             (1U)
#define GMAC_MTL_TBS_CTRL_LEOV_WIDTH             (1U)
#define GMAC_MTL_TBS_CTRL_LEOV(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TBS_CTRL_LEOV_SHIFT)) & GMAC_MTL_TBS_CTRL_LEOV_MASK)

#define GMAC_MTL_TBS_CTRL_Reserved_3_2_MASK      (0xCU)
#define GMAC_MTL_TBS_CTRL_Reserved_3_2_SHIFT     (2U)
#define GMAC_MTL_TBS_CTRL_Reserved_3_2_WIDTH     (2U)
#define GMAC_MTL_TBS_CTRL_Reserved_3_2(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TBS_CTRL_Reserved_3_2_SHIFT)) & GMAC_MTL_TBS_CTRL_Reserved_3_2_MASK)

#define GMAC_MTL_TBS_CTRL_LEGOS_MASK             (0x70U)
#define GMAC_MTL_TBS_CTRL_LEGOS_SHIFT            (4U)
#define GMAC_MTL_TBS_CTRL_LEGOS_WIDTH            (3U)
#define GMAC_MTL_TBS_CTRL_LEGOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TBS_CTRL_LEGOS_SHIFT)) & GMAC_MTL_TBS_CTRL_LEGOS_MASK)

#define GMAC_MTL_TBS_CTRL_Reserved_7_MASK        (0x80U)
#define GMAC_MTL_TBS_CTRL_Reserved_7_SHIFT       (7U)
#define GMAC_MTL_TBS_CTRL_Reserved_7_WIDTH       (1U)
#define GMAC_MTL_TBS_CTRL_Reserved_7(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TBS_CTRL_Reserved_7_SHIFT)) & GMAC_MTL_TBS_CTRL_Reserved_7_MASK)

#define GMAC_MTL_TBS_CTRL_LEOS_MASK              (0xFFFFFF00U)
#define GMAC_MTL_TBS_CTRL_LEOS_SHIFT             (8U)
#define GMAC_MTL_TBS_CTRL_LEOS_WIDTH             (24U)
#define GMAC_MTL_TBS_CTRL_LEOS(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TBS_CTRL_LEOS_SHIFT)) & GMAC_MTL_TBS_CTRL_LEOS_MASK)
/*! @} */

/*! @name MTL_EST_CONTROL -  */
/*! @{ */

#define GMAC_MTL_EST_CONTROL_EEST_MASK           (0x1U)
#define GMAC_MTL_EST_CONTROL_EEST_SHIFT          (0U)
#define GMAC_MTL_EST_CONTROL_EEST_WIDTH          (1U)
#define GMAC_MTL_EST_CONTROL_EEST(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_EEST_SHIFT)) & GMAC_MTL_EST_CONTROL_EEST_MASK)

#define GMAC_MTL_EST_CONTROL_SSWL_MASK           (0x2U)
#define GMAC_MTL_EST_CONTROL_SSWL_SHIFT          (1U)
#define GMAC_MTL_EST_CONTROL_SSWL_WIDTH          (1U)
#define GMAC_MTL_EST_CONTROL_SSWL(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_SSWL_SHIFT)) & GMAC_MTL_EST_CONTROL_SSWL_MASK)

#define GMAC_MTL_EST_CONTROL_Reserved_2_MASK     (0x4U)
#define GMAC_MTL_EST_CONTROL_Reserved_2_SHIFT    (2U)
#define GMAC_MTL_EST_CONTROL_Reserved_2_WIDTH    (1U)
#define GMAC_MTL_EST_CONTROL_Reserved_2(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_Reserved_2_SHIFT)) & GMAC_MTL_EST_CONTROL_Reserved_2_MASK)

#define GMAC_MTL_EST_CONTROL_QHLBF_MASK          (0x8U)
#define GMAC_MTL_EST_CONTROL_QHLBF_SHIFT         (3U)
#define GMAC_MTL_EST_CONTROL_QHLBF_WIDTH         (1U)
#define GMAC_MTL_EST_CONTROL_QHLBF(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_QHLBF_SHIFT)) & GMAC_MTL_EST_CONTROL_QHLBF_MASK)

#define GMAC_MTL_EST_CONTROL_DDBF_MASK           (0x10U)
#define GMAC_MTL_EST_CONTROL_DDBF_SHIFT          (4U)
#define GMAC_MTL_EST_CONTROL_DDBF_WIDTH          (1U)
#define GMAC_MTL_EST_CONTROL_DDBF(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_DDBF_SHIFT)) & GMAC_MTL_EST_CONTROL_DDBF_MASK)

#define GMAC_MTL_EST_CONTROL_DFBS_MASK           (0x20U)
#define GMAC_MTL_EST_CONTROL_DFBS_SHIFT          (5U)
#define GMAC_MTL_EST_CONTROL_DFBS_WIDTH          (1U)
#define GMAC_MTL_EST_CONTROL_DFBS(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_DFBS_SHIFT)) & GMAC_MTL_EST_CONTROL_DFBS_MASK)

#define GMAC_MTL_EST_CONTROL_LCSE_MASK           (0xC0U)
#define GMAC_MTL_EST_CONTROL_LCSE_SHIFT          (6U)
#define GMAC_MTL_EST_CONTROL_LCSE_WIDTH          (2U)
#define GMAC_MTL_EST_CONTROL_LCSE(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_LCSE_SHIFT)) & GMAC_MTL_EST_CONTROL_LCSE_MASK)

#define GMAC_MTL_EST_CONTROL_TILS_MASK           (0x700U)
#define GMAC_MTL_EST_CONTROL_TILS_SHIFT          (8U)
#define GMAC_MTL_EST_CONTROL_TILS_WIDTH          (3U)
#define GMAC_MTL_EST_CONTROL_TILS(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_CONTROL_TILS_SHIFT)) & GMAC_MTL_EST_CONTROL_TILS_MASK)

