zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEC_MASK    (0x800000U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT   (23U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEC_WIDTH   (1U)
#define GMAC_MTL_EST_GCL_CONTROL_ESTEIEC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_ESTEIEC_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_ESTEIEC_MASK)

#define GMAC_MTL_EST_GCL_CONTROL_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_31_24_SHIFT (24U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_31_24_WIDTH (8U)
#define GMAC_MTL_EST_GCL_CONTROL_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_CONTROL_Reserved_31_24_SHIFT)) & GMAC_MTL_EST_GCL_CONTROL_Reserved_31_24_MASK)
/*! @} */

/*! @name MTL_EST_GCL_DATA -  */
/*! @{ */

#define GMAC_MTL_EST_GCL_DATA_GCD_MASK           (0xFFFFFFFFU)
#define GMAC_MTL_EST_GCL_DATA_GCD_SHIFT          (0U)
#define GMAC_MTL_EST_GCL_DATA_GCD_WIDTH          (32U)
#define GMAC_MTL_EST_GCL_DATA_GCD(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_EST_GCL_DATA_GCD_SHIFT)) & GMAC_MTL_EST_GCL_DATA_GCD_MASK)
/*! @} */

/*! @name MTL_FPE_CTRL_STS -  */
/*! @{ */

#define GMAC_MTL_FPE_CTRL_STS_AFSZ_MASK          (0x3U)
#define GMAC_MTL_FPE_CTRL_STS_AFSZ_SHIFT         (0U)
#define GMAC_MTL_FPE_CTRL_STS_AFSZ_WIDTH         (2U)
#define GMAC_MTL_FPE_CTRL_STS_AFSZ(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_AFSZ_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_AFSZ_MASK)

#define GMAC_MTL_FPE_CTRL_STS_Reserved_7_2_MASK  (0xFCU)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_7_2_SHIFT (2U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_7_2_WIDTH (6U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_7_2(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_Reserved_7_2_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_Reserved_7_2_MASK)

#define GMAC_MTL_FPE_CTRL_STS_PEC_MASK           (0x700U)
#define GMAC_MTL_FPE_CTRL_STS_PEC_SHIFT          (8U)
#define GMAC_MTL_FPE_CTRL_STS_PEC_WIDTH          (3U)
#define GMAC_MTL_FPE_CTRL_STS_PEC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_PEC_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_PEC_MASK)

#define GMAC_MTL_FPE_CTRL_STS_Reserved_15_y_MASK (0xF800U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_15_y_SHIFT (11U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_15_y_WIDTH (5U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_15_y(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_Reserved_15_y_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_Reserved_15_y_MASK)

#define GMAC_MTL_FPE_CTRL_STS_Reserved_27_16_MASK (0xFFF0000U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_27_16_SHIFT (16U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_27_16_WIDTH (12U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_27_16(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_Reserved_27_16_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_Reserved_27_16_MASK)

#define GMAC_MTL_FPE_CTRL_STS_HRS_MASK           (0x10000000U)
#define GMAC_MTL_FPE_CTRL_STS_HRS_SHIFT          (28U)
#define GMAC_MTL_FPE_CTRL_STS_HRS_WIDTH          (1U)
#define GMAC_MTL_FPE_CTRL_STS_HRS(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_HRS_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_HRS_MASK)

#define GMAC_MTL_FPE_CTRL_STS_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_31_29_SHIFT (29U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_31_29_WIDTH (3U)
#define GMAC_MTL_FPE_CTRL_STS_Reserved_31_29(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_CTRL_STS_Reserved_31_29_SHIFT)) & GMAC_MTL_FPE_CTRL_STS_Reserved_31_29_MASK)
/*! @} */

/*! @name MTL_FPE_ADVANCE -  */
/*! @{ */

#define GMAC_MTL_FPE_ADVANCE_HADV_MASK           (0xFFFFU)
#define GMAC_MTL_FPE_ADVANCE_HADV_SHIFT          (0U)
#define GMAC_MTL_FPE_ADVANCE_HADV_WIDTH          (16U)
#define GMAC_MTL_FPE_ADVANCE_HADV(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_ADVANCE_HADV_SHIFT)) & GMAC_MTL_FPE_ADVANCE_HADV_MASK)

#define GMAC_MTL_FPE_ADVANCE_RADV_MASK           (0xFFFF0000U)
#define GMAC_MTL_FPE_ADVANCE_RADV_SHIFT          (16U)
#define GMAC_MTL_FPE_ADVANCE_RADV_WIDTH          (16U)
#define GMAC_MTL_FPE_ADVANCE_RADV(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_FPE_ADVANCE_RADV_SHIFT)) & GMAC_MTL_FPE_ADVANCE_RADV_MASK)
/*! @} */

/*! @name MTL_RXP_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_MTL_RXP_CONTROL_STATUS_NVE_MASK     (0x3FU)
#define GMAC_MTL_RXP_CONTROL_STATUS_NVE_SHIFT    (0U)
#define GMAC_MTL_RXP_CONTROL_STATUS_NVE_WIDTH    (6U)
#define GMAC_MTL_RXP_CONTROL_STATUS_NVE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_CONTROL_STATUS_NVE_SHIFT)) & GMAC_MTL_RXP_CONTROL_STATUS_NVE_MASK)

#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_15_x_MASK (0xFFC0U)
#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_15_x_SHIFT (6U)
#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_15_x_WIDTH (10U)
#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_15_x(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_CONTROL_STATUS_Reserved_15_x_SHIFT)) & GMAC_MTL_RXP_CONTROL_STATUS_Reserved_15_x_MASK)

#define GMAC_MTL_RXP_CONTROL_STATUS_NPE_MASK     (0x3F0000U)
#define GMAC_MTL_RXP_CONTROL_STATUS_NPE_SHIFT    (16U)
#define GMAC_MTL_RXP_CONTROL_STATUS_NPE_WIDTH    (6U)
#define GMAC_MTL_RXP_CONTROL_STATUS_NPE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_CONTROL_STATUS_NPE_SHIFT)) & GMAC_MTL_RXP_CONTROL_STATUS_NPE_MASK)

#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_29_x_MASK (0x3FC00000U)
#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_29_x_SHIFT (22U)
#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_29_x_WIDTH (8U)
#define GMAC_MTL_RXP_CONTROL_STATUS_Reserved_29_x(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_CONTROL_STATUS_Reserved_29_x_SHIFT)) & GMAC_MTL_RXP_CONTROL_STATUS_Reserved_29_x_MASK)

#define GMAC_MTL_RXP_CONTROL_STATUS_ELIRS_MASK   (0x40000000U)
#define GMAC_MTL_RXP_CONTROL_STATUS_ELIRS_SHIFT  (30U)
#define GMAC_MTL_RXP_CONTROL_STATUS_ELIRS_WIDTH  (1U)
#define GMAC_MTL_RXP_CONTROL_STATUS_ELIRS(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_CONTROL_STATUS_ELIRS_SHIFT)) & GMAC_MTL_RXP_CONTROL_STATUS_ELIRS_MASK)

#define GMAC_MTL_RXP_CONTROL_STATUS_RXPI_MASK    (0x80000000U)
#define GMAC_MTL_RXP_CONTROL_STATUS_RXPI_SHIFT   (31U)
#define GMAC_MTL_RXP_CONTROL_STATUS_RXPI_WIDTH   (1U)
#define GMAC_MTL_RXP_CONTROL_STATUS_RXPI(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_CONTROL_STATUS_RXPI_SHIFT)) & GMAC_MTL_RXP_CONTROL_STATUS_RXPI_MASK)
/*! @} */

/*! @name MTL_RXP_INTERRUPT_CONTROL_STATUS -  */
/*! @{ */

