zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS_MASK (0x1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS_SHIFT (0U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIS_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS_MASK (0x2U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS_SHIFT (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIS_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS_MASK (0x4U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS_SHIFT (2U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIS_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS_MASK (0x8U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS_SHIFT (3U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIS_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_15_4_MASK (0xFFF0U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_15_4_SHIFT (4U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_15_4_WIDTH (12U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_15_4(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_15_4_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_15_4_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE_MASK (0x10000U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE_SHIFT (16U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NVEOVIE_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE_MASK (0x20000U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE_SHIFT (17U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_NPEOVIE_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE_MASK (0x40000U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE_SHIFT (18U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_FOOVIE_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE_MASK (0x80000U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE_SHIFT (19U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE_WIDTH (1U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_PDRFIE_MASK)

#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_31_20_MASK (0xFFF00000U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_31_20_SHIFT (20U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_31_20_WIDTH (12U)
#define GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_31_20(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_31_20_SHIFT)) & GMAC_MTL_RXP_INTERRUPT_CONTROL_STATUS_Reserved_31_20_MASK)
/*! @} */

/*! @name MTL_RXP_DROP_CNT -  */
/*! @{ */

#define GMAC_MTL_RXP_DROP_CNT_RXPDC_MASK         (0x7FFFFFFFU)
#define GMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT        (0U)
#define GMAC_MTL_RXP_DROP_CNT_RXPDC_WIDTH        (31U)
#define GMAC_MTL_RXP_DROP_CNT_RXPDC(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT)) & GMAC_MTL_RXP_DROP_CNT_RXPDC_MASK)

#define GMAC_MTL_RXP_DROP_CNT_RXPDCOVF_MASK      (0x80000000U)
#define GMAC_MTL_RXP_DROP_CNT_RXPDCOVF_SHIFT     (31U)
#define GMAC_MTL_RXP_DROP_CNT_RXPDCOVF_WIDTH     (1U)
#define GMAC_MTL_RXP_DROP_CNT_RXPDCOVF(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_DROP_CNT_RXPDCOVF_SHIFT)) & GMAC_MTL_RXP_DROP_CNT_RXPDCOVF_MASK)
/*! @} */

/*! @name MTL_RXP_ERROR_CNT -  */
/*! @{ */

#define GMAC_MTL_RXP_ERROR_CNT_RXPEC_MASK        (0x7FFFFFFFU)
#define GMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT       (0U)
#define GMAC_MTL_RXP_ERROR_CNT_RXPEC_WIDTH       (31U)
#define GMAC_MTL_RXP_ERROR_CNT_RXPEC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT)) & GMAC_MTL_RXP_ERROR_CNT_RXPEC_MASK)

#define GMAC_MTL_RXP_ERROR_CNT_RXPECOVF_MASK     (0x80000000U)
#define GMAC_MTL_RXP_ERROR_CNT_RXPECOVF_SHIFT    (31U)
#define GMAC_MTL_RXP_ERROR_CNT_RXPECOVF_WIDTH    (1U)
#define GMAC_MTL_RXP_ERROR_CNT_RXPECOVF(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_ERROR_CNT_RXPECOVF_SHIFT)) & GMAC_MTL_RXP_ERROR_CNT_RXPECOVF_MASK)
/*! @} */

/*! @name MTL_RXP_INDIRECT_ACC_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_MASK (0xFFU)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT (0U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_WIDTH (8U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_15_x_MASK (0xFF00U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_15_x_SHIFT (8U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_15_x_WIDTH (8U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_15_x(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_15_x_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_15_x_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_MASK (0x10000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_SHIFT (16U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_WIDTH (1U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_19_17_MASK (0xE0000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_19_17_SHIFT (17U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_19_17_WIDTH (3U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_19_17(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_19_17_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_19_17_MASK)

