zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_MASK (0x100000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_SHIFT (20U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_WIDTH (1U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE_MASK (0x200000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE_SHIFT (21U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE_WIDTH (1U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIAEE_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_MASK (0x400000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT (22U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_WIDTH (1U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_30_23_MASK (0x7F800000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_30_23_SHIFT (23U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_30_23_WIDTH (8U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_30_23(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_30_23_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_Reserved_30_23_MASK)

#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_MASK (0x80000000U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_SHIFT (31U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_WIDTH (1U)
#define GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_MASK)
/*! @} */

/*! @name MTL_RXP_INDIRECT_ACC_DATA -  */
/*! @{ */

#define GMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_MASK (0xFFFFFFFFU)
#define GMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT (0U)
#define GMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_WIDTH (32U)
#define GMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT)) & GMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_MASK)
/*! @} */

/*! @name MTL_RXP_BYPASS_CNT -  */
/*! @{ */

#define GMAC_MTL_RXP_BYPASS_CNT_RXPBC_MASK       (0x7FFFFFFFU)
#define GMAC_MTL_RXP_BYPASS_CNT_RXPBC_SHIFT      (0U)
#define GMAC_MTL_RXP_BYPASS_CNT_RXPBC_WIDTH      (31U)
#define GMAC_MTL_RXP_BYPASS_CNT_RXPBC(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_BYPASS_CNT_RXPBC_SHIFT)) & GMAC_MTL_RXP_BYPASS_CNT_RXPBC_MASK)

#define GMAC_MTL_RXP_BYPASS_CNT_RXPBCOF_MASK     (0x80000000U)
#define GMAC_MTL_RXP_BYPASS_CNT_RXPBCOF_SHIFT    (31U)
#define GMAC_MTL_RXP_BYPASS_CNT_RXPBCOF_WIDTH    (1U)
#define GMAC_MTL_RXP_BYPASS_CNT_RXPBCOF(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXP_BYPASS_CNT_RXPBCOF_SHIFT)) & GMAC_MTL_RXP_BYPASS_CNT_RXPBCOF_MASK)
/*! @} */

/*! @name MTL_ECC_CONTROL -  */
/*! @{ */

#define GMAC_MTL_ECC_CONTROL_MTXEE_MASK          (0x1U)
#define GMAC_MTL_ECC_CONTROL_MTXEE_SHIFT         (0U)
#define GMAC_MTL_ECC_CONTROL_MTXEE_WIDTH         (1U)
#define GMAC_MTL_ECC_CONTROL_MTXEE(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_MTXEE_SHIFT)) & GMAC_MTL_ECC_CONTROL_MTXEE_MASK)

#define GMAC_MTL_ECC_CONTROL_MRXEE_MASK          (0x2U)
#define GMAC_MTL_ECC_CONTROL_MRXEE_SHIFT         (1U)
#define GMAC_MTL_ECC_CONTROL_MRXEE_WIDTH         (1U)
#define GMAC_MTL_ECC_CONTROL_MRXEE(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_MRXEE_SHIFT)) & GMAC_MTL_ECC_CONTROL_MRXEE_MASK)

#define GMAC_MTL_ECC_CONTROL_MESTEE_MASK         (0x4U)
#define GMAC_MTL_ECC_CONTROL_MESTEE_SHIFT        (2U)
#define GMAC_MTL_ECC_CONTROL_MESTEE_WIDTH        (1U)
#define GMAC_MTL_ECC_CONTROL_MESTEE(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_MESTEE_SHIFT)) & GMAC_MTL_ECC_CONTROL_MESTEE_MASK)

#define GMAC_MTL_ECC_CONTROL_MRXPEE_MASK         (0x8U)
#define GMAC_MTL_ECC_CONTROL_MRXPEE_SHIFT        (3U)
#define GMAC_MTL_ECC_CONTROL_MRXPEE_WIDTH        (1U)
#define GMAC_MTL_ECC_CONTROL_MRXPEE(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_MRXPEE_SHIFT)) & GMAC_MTL_ECC_CONTROL_MRXPEE_MASK)

#define GMAC_MTL_ECC_CONTROL_Reserved_TSOEE_MASK (0x10U)
#define GMAC_MTL_ECC_CONTROL_Reserved_TSOEE_SHIFT (4U)
#define GMAC_MTL_ECC_CONTROL_Reserved_TSOEE_WIDTH (1U)
#define GMAC_MTL_ECC_CONTROL_Reserved_TSOEE(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_Reserved_TSOEE_SHIFT)) & GMAC_MTL_ECC_CONTROL_Reserved_TSOEE_MASK)

#define GMAC_MTL_ECC_CONTROL_Reserved_DSCEE_MASK (0x20U)
#define GMAC_MTL_ECC_CONTROL_Reserved_DSCEE_SHIFT (5U)
#define GMAC_MTL_ECC_CONTROL_Reserved_DSCEE_WIDTH (1U)
#define GMAC_MTL_ECC_CONTROL_Reserved_DSCEE(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_Reserved_DSCEE_SHIFT)) & GMAC_MTL_ECC_CONTROL_Reserved_DSCEE_MASK)

#define GMAC_MTL_ECC_CONTROL_Reserved_7_6_MASK   (0xC0U)
#define GMAC_MTL_ECC_CONTROL_Reserved_7_6_SHIFT  (6U)
#define GMAC_MTL_ECC_CONTROL_Reserved_7_6_WIDTH  (2U)
#define GMAC_MTL_ECC_CONTROL_Reserved_7_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_Reserved_7_6_SHIFT)) & GMAC_MTL_ECC_CONTROL_Reserved_7_6_MASK)

#define GMAC_MTL_ECC_CONTROL_MEEAO_MASK          (0x100U)
#define GMAC_MTL_ECC_CONTROL_MEEAO_SHIFT         (8U)
#define GMAC_MTL_ECC_CONTROL_MEEAO_WIDTH         (1U)
#define GMAC_MTL_ECC_CONTROL_MEEAO(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_MEEAO_SHIFT)) & GMAC_MTL_ECC_CONTROL_MEEAO_MASK)

#define GMAC_MTL_ECC_CONTROL_Reserved_31_9_MASK  (0xFFFFFE00U)
#define GMAC_MTL_ECC_CONTROL_Reserved_31_9_SHIFT (9U)
#define GMAC_MTL_ECC_CONTROL_Reserved_31_9_WIDTH (23U)
#define GMAC_MTL_ECC_CONTROL_Reserved_31_9(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_CONTROL_Reserved_31_9_SHIFT)) & GMAC_MTL_ECC_CONTROL_Reserved_31_9_MASK)
/*! @} */

/*! @name MTL_SAFETY_INTERRUPT_STATUS -  */
/*! @{ */

#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_MASK (0x1U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_SHIFT (0U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_WIDTH (1U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_SHIFT)) & GMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_MASK)

#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_MASK (0x2U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_SHIFT (1U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_WIDTH (1U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_SHIFT)) & GMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_MASK)

#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_30_2_MASK (0x7FFFFFFCU)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_30_2_SHIFT (2U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_30_2_WIDTH (29U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_30_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_30_2_SHIFT)) & GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_30_2_MASK)

#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_MCSIS_MASK (0x80000000U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_MCSIS_SHIFT (31U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_MCSIS_WIDTH (1U)
#define GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_MCSIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_MCSIS_SHIFT)) & GMAC_MTL_SAFETY_INTERRUPT_STATUS_Reserved_MCSIS_MASK)
/*! @} */

/*! @name MTL_ECC_INTERRUPT_ENABLE -  */
/*! @{ */

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_MASK (0x1U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_SHIFT (0U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_MASK)

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_3_1_MASK (0xEU)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_3_1_SHIFT (1U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_3_1_WIDTH (3U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_3_1(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_3_1_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_3_1_MASK)

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_MASK (0x10U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_SHIFT (4U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_MASK)

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_7_5_MASK (0xE0U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_7_5_SHIFT (5U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_7_5_WIDTH (3U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_7_5(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_7_5_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_7_5_MASK)

