zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_MASK (0x100U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_SHIFT (8U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_MASK)

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_11_9_MASK (0xE00U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_11_9_SHIFT (9U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_11_9_WIDTH (3U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_11_9(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_11_9_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_11_9_MASK)

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_MASK (0x1000U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_SHIFT (12U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_MASK)

#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_31_13_MASK (0xFFFFE000U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_31_13_SHIFT (13U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_31_13_WIDTH (19U)
#define GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_31_13(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_31_13_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_ENABLE_Reserved_31_13_MASK)
/*! @} */

/*! @name MTL_ECC_INTERRUPT_STATUS -  */
/*! @{ */

#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_MASK (0x1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_SHIFT (0U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXCES(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_MASK (0x2U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_SHIFT (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_MASK (0x4U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_SHIFT (2U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_TXUES(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_3_MASK (0x8U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_3_SHIFT (3U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_3_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_3_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_3_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_MASK (0x10U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_SHIFT (4U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXCES(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_MASK (0x20U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_SHIFT (5U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_MASK (0x40U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_SHIFT (6U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RXUES(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_7_MASK (0x80U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_7_SHIFT (7U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_7_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_7(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_7_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_7_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_ECES_MASK  (0x100U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_ECES_SHIFT (8U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_ECES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_ECES(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_ECES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_ECES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_MASK  (0x200U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_SHIFT (9U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_EAMS(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_EUES_MASK  (0x400U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_EUES_SHIFT (10U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_EUES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_EUES(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_EUES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_EUES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_11_MASK (0x800U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_11_SHIFT (11U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_11_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_11(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_11_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_11_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_MASK (0x1000U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_SHIFT (12U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPCES(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_MASK (0x2000U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_SHIFT (13U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_MASK (0x4000U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_SHIFT (14U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_WIDTH (1U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_RPUES(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_MASK)

#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_31_15_MASK (0xFFFF8000U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_31_15_SHIFT (15U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_31_15_WIDTH (17U)
#define GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_31_15(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_31_15_SHIFT)) & GMAC_MTL_ECC_INTERRUPT_STATUS_Reserved_31_15_MASK)
/*! @} */

/*! @name MTL_ECC_ERR_STS_RCTL -  */
/*! @{ */

#define GMAC_MTL_ECC_ERR_STS_RCTL_EESRE_MASK     (0x1U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_EESRE_SHIFT    (0U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_EESRE_WIDTH    (1U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_EESRE(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_STS_RCTL_EESRE_SHIFT)) & GMAC_MTL_ECC_ERR_STS_RCTL_EESRE_MASK)

#define GMAC_MTL_ECC_ERR_STS_RCTL_EMS_MASK       (0xEU)
#define GMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT      (1U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_EMS_WIDTH      (3U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_EMS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT)) & GMAC_MTL_ECC_ERR_STS_RCTL_EMS_MASK)

#define GMAC_MTL_ECC_ERR_STS_RCTL_CCES_MASK      (0x10U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_CCES_SHIFT     (4U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_CCES_WIDTH     (1U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_CCES(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_STS_RCTL_CCES_SHIFT)) & GMAC_MTL_ECC_ERR_STS_RCTL_CCES_MASK)

#define GMAC_MTL_ECC_ERR_STS_RCTL_CUES_MASK      (0x20U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_CUES_SHIFT     (5U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_CUES_WIDTH     (1U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_CUES(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_STS_RCTL_CUES_SHIFT)) & GMAC_MTL_ECC_ERR_STS_RCTL_CUES_MASK)

#define GMAC_MTL_ECC_ERR_STS_RCTL_Reserved_31_6_MASK (0xFFFFFFC0U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_Reserved_31_6_SHIFT (6U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_Reserved_31_6_WIDTH (26U)
#define GMAC_MTL_ECC_ERR_STS_RCTL_Reserved_31_6(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_ECC_ERR_STS_RCTL_Reserved_31_6_SHIFT)) & GMAC_MTL_ECC_ERR_STS_RCTL_Reserved_31_6_MASK)
/*! @} */

