zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEDC_MASK (0x10000U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEDC_SHIFT (16U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEDC_WIDTH (1U)
#define GMAC_MTL_DPP_CONTROL_Reserved_IPEDC(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_IPEDC_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_IPEDC_MASK)

#define GMAC_MTL_DPP_CONTROL_Reserved_31_17_MASK (0xFFFE0000U)
#define GMAC_MTL_DPP_CONTROL_Reserved_31_17_SHIFT (17U)
#define GMAC_MTL_DPP_CONTROL_Reserved_31_17_WIDTH (15U)
#define GMAC_MTL_DPP_CONTROL_Reserved_31_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_CONTROL_Reserved_31_17_SHIFT)) & GMAC_MTL_DPP_CONTROL_Reserved_31_17_MASK)
/*! @} */

/*! @name MTL_DPP_ECC_EIC -  */
/*! @{ */

#define GMAC_MTL_DPP_ECC_EIC_BLEI_MASK           (0xFFU)
#define GMAC_MTL_DPP_ECC_EIC_BLEI_SHIFT          (0U)
#define GMAC_MTL_DPP_ECC_EIC_BLEI_WIDTH          (8U)
#define GMAC_MTL_DPP_ECC_EIC_BLEI(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_ECC_EIC_BLEI_SHIFT)) & GMAC_MTL_DPP_ECC_EIC_BLEI_MASK)

#define GMAC_MTL_DPP_ECC_EIC_Reserved_15_8_MASK  (0xFF00U)
#define GMAC_MTL_DPP_ECC_EIC_Reserved_15_8_SHIFT (8U)
#define GMAC_MTL_DPP_ECC_EIC_Reserved_15_8_WIDTH (8U)
#define GMAC_MTL_DPP_ECC_EIC_Reserved_15_8(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_ECC_EIC_Reserved_15_8_SHIFT)) & GMAC_MTL_DPP_ECC_EIC_Reserved_15_8_MASK)

#define GMAC_MTL_DPP_ECC_EIC_EIM_MASK            (0x10000U)
#define GMAC_MTL_DPP_ECC_EIC_EIM_SHIFT           (16U)
#define GMAC_MTL_DPP_ECC_EIC_EIM_WIDTH           (1U)
#define GMAC_MTL_DPP_ECC_EIC_EIM(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_ECC_EIC_EIM_SHIFT)) & GMAC_MTL_DPP_ECC_EIC_EIM_MASK)

#define GMAC_MTL_DPP_ECC_EIC_Reserved_31_17_MASK (0xFFFE0000U)
#define GMAC_MTL_DPP_ECC_EIC_Reserved_31_17_SHIFT (17U)
#define GMAC_MTL_DPP_ECC_EIC_Reserved_31_17_WIDTH (15U)
#define GMAC_MTL_DPP_ECC_EIC_Reserved_31_17(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_DPP_ECC_EIC_Reserved_31_17_SHIFT)) & GMAC_MTL_DPP_ECC_EIC_Reserved_31_17_MASK)
/*! @} */

/*! @name MTL_TXQ0_OPERATION_MODE -  */
/*! @{ */

#define GMAC_MTL_TXQ0_OPERATION_MODE_FTQ_MASK    (0x1U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_FTQ_SHIFT   (0U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_FTQ_WIDTH   (1U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_FTQ(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_FTQ_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_FTQ_MASK)

#define GMAC_MTL_TXQ0_OPERATION_MODE_TSF_MASK    (0x2U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TSF_SHIFT   (1U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TSF_WIDTH   (1U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TSF(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_TSF_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_TSF_MASK)

#define GMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK  (0xCU)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT (2U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_WIDTH (2U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK)

#define GMAC_MTL_TXQ0_OPERATION_MODE_TTC_MASK    (0x70U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT   (4U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TTC_WIDTH   (3U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_TTC_MASK)

#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_15_7_MASK (0xFF80U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_15_7_SHIFT (7U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_15_7_WIDTH (9U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_15_7(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_15_7_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_15_7_MASK)

#define GMAC_MTL_TXQ0_OPERATION_MODE_TQS_MASK    (0x3F0000U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT   (16U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TQS_WIDTH   (6U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_TQS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_TQS_MASK)

#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_31_y_MASK (0xFFC00000U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_31_y_SHIFT (22U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_31_y_WIDTH (10U)
#define GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_31_y_SHIFT)) & GMAC_MTL_TXQ0_OPERATION_MODE_Reserved_31_y_MASK)
/*! @} */

/*! @name MTL_TXQ0_UNDERFLOW -  */
/*! @{ */

#define GMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MASK    (0x7FFU)
#define GMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT   (0U)
#define GMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_WIDTH   (11U)
#define GMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT)) & GMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MASK)

#define GMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_MASK    (0x800U)
#define GMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_SHIFT   (11U)
#define GMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_WIDTH   (1U)
#define GMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_SHIFT)) & GMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_MASK)

#define GMAC_MTL_TXQ0_UNDERFLOW_Reserved_31_12_MASK (0xFFFFF000U)
#define GMAC_MTL_TXQ0_UNDERFLOW_Reserved_31_12_SHIFT (12U)
#define GMAC_MTL_TXQ0_UNDERFLOW_Reserved_31_12_WIDTH (20U)
#define GMAC_MTL_TXQ0_UNDERFLOW_Reserved_31_12(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_UNDERFLOW_Reserved_31_12_SHIFT)) & GMAC_MTL_TXQ0_UNDERFLOW_Reserved_31_12_MASK)
/*! @} */

/*! @name MTL_TXQ0_DEBUG -  */
/*! @{ */

#define GMAC_MTL_TXQ0_DEBUG_TXQPAUSED_MASK       (0x1U)
#define GMAC_MTL_TXQ0_DEBUG_TXQPAUSED_SHIFT      (0U)
#define GMAC_MTL_TXQ0_DEBUG_TXQPAUSED_WIDTH      (1U)
#define GMAC_MTL_TXQ0_DEBUG_TXQPAUSED(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_TXQPAUSED_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_TXQPAUSED_MASK)

#define GMAC_MTL_TXQ0_DEBUG_TRCSTS_MASK          (0x6U)
#define GMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT         (1U)
#define GMAC_MTL_TXQ0_DEBUG_TRCSTS_WIDTH         (2U)
#define GMAC_MTL_TXQ0_DEBUG_TRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_TRCSTS_MASK)

#define GMAC_MTL_TXQ0_DEBUG_TWCSTS_MASK          (0x8U)
#define GMAC_MTL_TXQ0_DEBUG_TWCSTS_SHIFT         (3U)
#define GMAC_MTL_TXQ0_DEBUG_TWCSTS_WIDTH         (1U)
#define GMAC_MTL_TXQ0_DEBUG_TWCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_TWCSTS_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_TWCSTS_MASK)

#define GMAC_MTL_TXQ0_DEBUG_TXQSTS_MASK          (0x10U)
#define GMAC_MTL_TXQ0_DEBUG_TXQSTS_SHIFT         (4U)
#define GMAC_MTL_TXQ0_DEBUG_TXQSTS_WIDTH         (1U)
#define GMAC_MTL_TXQ0_DEBUG_TXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_TXQSTS_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_TXQSTS_MASK)

#define GMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_MASK       (0x20U)
#define GMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_SHIFT      (5U)
#define GMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_WIDTH      (1U)
#define GMAC_MTL_TXQ0_DEBUG_TXSTSFSTS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_MASK)

#define GMAC_MTL_TXQ0_DEBUG_Reserved_15_6_MASK   (0xFFC0U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_15_6_SHIFT  (6U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_15_6_WIDTH  (10U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_15_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_Reserved_15_6_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_Reserved_15_6_MASK)

#define GMAC_MTL_TXQ0_DEBUG_PTXQ_MASK            (0x70000U)
#define GMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT           (16U)
#define GMAC_MTL_TXQ0_DEBUG_PTXQ_WIDTH           (3U)
#define GMAC_MTL_TXQ0_DEBUG_PTXQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_PTXQ_MASK)

#define GMAC_MTL_TXQ0_DEBUG_Reserved_19_MASK     (0x80000U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_19_SHIFT    (19U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_19_WIDTH    (1U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_Reserved_19_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_Reserved_19_MASK)

#define GMAC_MTL_TXQ0_DEBUG_STXSTSF_MASK         (0x700000U)
#define GMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT        (20U)
#define GMAC_MTL_TXQ0_DEBUG_STXSTSF_WIDTH        (3U)
#define GMAC_MTL_TXQ0_DEBUG_STXSTSF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_STXSTSF_MASK)

#define GMAC_MTL_TXQ0_DEBUG_Reserved_31_23_MASK  (0xFF800000U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_31_23_SHIFT (23U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_31_23_WIDTH (9U)
#define GMAC_MTL_TXQ0_DEBUG_Reserved_31_23(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_DEBUG_Reserved_31_23_SHIFT)) & GMAC_MTL_TXQ0_DEBUG_Reserved_31_23_MASK)
/*! @} */

/*! @name MTL_TXQ0_ETS_STATUS -  */
/*! @{ */

#define GMAC_MTL_TXQ0_ETS_STATUS_ABS_MASK        (0xFFFFFFU)
#define GMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT       (0U)
#define GMAC_MTL_TXQ0_ETS_STATUS_ABS_WIDTH       (24U)
#define GMAC_MTL_TXQ0_ETS_STATUS_ABS(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT)) & GMAC_MTL_TXQ0_ETS_STATUS_ABS_MASK)

