zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_TXQ1_DEBUG_PTXQ_MASK            (0x70000U)
#define GMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT           (16U)
#define GMAC_MTL_TXQ1_DEBUG_PTXQ_WIDTH           (3U)
#define GMAC_MTL_TXQ1_DEBUG_PTXQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_PTXQ_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_PTXQ_MASK)

#define GMAC_MTL_TXQ1_DEBUG_Reserved_19_MASK     (0x80000U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_19_SHIFT    (19U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_19_WIDTH    (1U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_Reserved_19_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_Reserved_19_MASK)

#define GMAC_MTL_TXQ1_DEBUG_STXSTSF_MASK         (0x700000U)
#define GMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT        (20U)
#define GMAC_MTL_TXQ1_DEBUG_STXSTSF_WIDTH        (3U)
#define GMAC_MTL_TXQ1_DEBUG_STXSTSF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_STXSTSF_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_STXSTSF_MASK)

#define GMAC_MTL_TXQ1_DEBUG_Reserved_31_23_MASK  (0xFF800000U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_31_23_SHIFT (23U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_31_23_WIDTH (9U)
#define GMAC_MTL_TXQ1_DEBUG_Reserved_31_23(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_DEBUG_Reserved_31_23_SHIFT)) & GMAC_MTL_TXQ1_DEBUG_Reserved_31_23_MASK)
/*! @} */

/*! @name MTL_TXQ1_ETS_CONTROL -  */
/*! @{ */

#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_1_0_MASK (0x3U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_1_0_SHIFT (0U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_1_0_WIDTH (2U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_1_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_1_0_SHIFT)) & GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_1_0_MASK)

#define GMAC_MTL_TXQ1_ETS_CONTROL_AVALG_MASK     (0x4U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_AVALG_SHIFT    (2U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_AVALG_WIDTH    (1U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_AVALG(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_CONTROL_AVALG_SHIFT)) & GMAC_MTL_TXQ1_ETS_CONTROL_AVALG_MASK)

#define GMAC_MTL_TXQ1_ETS_CONTROL_CC_MASK        (0x8U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_CC_SHIFT       (3U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_CC_WIDTH       (1U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_CC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_CONTROL_CC_SHIFT)) & GMAC_MTL_TXQ1_ETS_CONTROL_CC_MASK)

#define GMAC_MTL_TXQ1_ETS_CONTROL_SLC_MASK       (0x70U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT      (4U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_SLC_WIDTH      (3U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_SLC(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_CONTROL_SLC_SHIFT)) & GMAC_MTL_TXQ1_ETS_CONTROL_SLC_MASK)

#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_31_7_MASK (0xFFFFFF80U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_31_7_SHIFT (7U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_31_7_WIDTH (25U)
#define GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_31_7(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_31_7_SHIFT)) & GMAC_MTL_TXQ1_ETS_CONTROL_Reserved_31_7_MASK)
/*! @} */

/*! @name MTL_TXQ1_ETS_STATUS -  */
/*! @{ */

#define GMAC_MTL_TXQ1_ETS_STATUS_ABS_MASK        (0xFFFFFFU)
#define GMAC_MTL_TXQ1_ETS_STATUS_ABS_SHIFT       (0U)
#define GMAC_MTL_TXQ1_ETS_STATUS_ABS_WIDTH       (24U)
#define GMAC_MTL_TXQ1_ETS_STATUS_ABS(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_STATUS_ABS_SHIFT)) & GMAC_MTL_TXQ1_ETS_STATUS_ABS_MASK)

#define GMAC_MTL_TXQ1_ETS_STATUS_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MTL_TXQ1_ETS_STATUS_Reserved_31_24_SHIFT (24U)
#define GMAC_MTL_TXQ1_ETS_STATUS_Reserved_31_24_WIDTH (8U)
#define GMAC_MTL_TXQ1_ETS_STATUS_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_ETS_STATUS_Reserved_31_24_SHIFT)) & GMAC_MTL_TXQ1_ETS_STATUS_Reserved_31_24_MASK)
/*! @} */

/*! @name MTL_TXQ1_QUANTUM_WEIGHT -  */
/*! @{ */

#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_MASK  (0x1FFFFFU)
#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_SHIFT (0U)
#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_WIDTH (21U)
#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_SHIFT)) & GMAC_MTL_TXQ1_QUANTUM_WEIGHT_ISCQW_MASK)

#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_Reserved_31_21_MASK (0xFFE00000U)
#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_Reserved_31_21_SHIFT (21U)
#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_Reserved_31_21_WIDTH (11U)
#define GMAC_MTL_TXQ1_QUANTUM_WEIGHT_Reserved_31_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_QUANTUM_WEIGHT_Reserved_31_21_SHIFT)) & GMAC_MTL_TXQ1_QUANTUM_WEIGHT_Reserved_31_21_MASK)
/*! @} */

/*! @name MTL_TXQ1_SENDSLOPECREDIT -  */
/*! @{ */

#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_MASK   (0x3FFFU)
#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_SHIFT  (0U)
#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_WIDTH  (14U)
#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_SHIFT)) & GMAC_MTL_TXQ1_SENDSLOPECREDIT_SSC_MASK)

#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_Reserved_31_14_MASK (0xFFFFC000U)
#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_Reserved_31_14_SHIFT (14U)
#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_Reserved_31_14_WIDTH (18U)
#define GMAC_MTL_TXQ1_SENDSLOPECREDIT_Reserved_31_14(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_SENDSLOPECREDIT_Reserved_31_14_SHIFT)) & GMAC_MTL_TXQ1_SENDSLOPECREDIT_Reserved_31_14_MASK)
/*! @} */

/*! @name MTL_TXQ1_HICREDIT -  */
/*! @{ */

#define GMAC_MTL_TXQ1_HICREDIT_HC_MASK           (0x1FFFFFFFU)
#define GMAC_MTL_TXQ1_HICREDIT_HC_SHIFT          (0U)
#define GMAC_MTL_TXQ1_HICREDIT_HC_WIDTH          (29U)
#define GMAC_MTL_TXQ1_HICREDIT_HC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_HICREDIT_HC_SHIFT)) & GMAC_MTL_TXQ1_HICREDIT_HC_MASK)

#define GMAC_MTL_TXQ1_HICREDIT_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MTL_TXQ1_HICREDIT_Reserved_31_29_SHIFT (29U)
#define GMAC_MTL_TXQ1_HICREDIT_Reserved_31_29_WIDTH (3U)
#define GMAC_MTL_TXQ1_HICREDIT_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_HICREDIT_Reserved_31_29_SHIFT)) & GMAC_MTL_TXQ1_HICREDIT_Reserved_31_29_MASK)
/*! @} */

/*! @name MTL_TXQ1_LOCREDIT -  */
/*! @{ */

#define GMAC_MTL_TXQ1_LOCREDIT_LC_MASK           (0x1FFFFFFFU)
#define GMAC_MTL_TXQ1_LOCREDIT_LC_SHIFT          (0U)
#define GMAC_MTL_TXQ1_LOCREDIT_LC_WIDTH          (29U)
#define GMAC_MTL_TXQ1_LOCREDIT_LC(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_LOCREDIT_LC_SHIFT)) & GMAC_MTL_TXQ1_LOCREDIT_LC_MASK)

#define GMAC_MTL_TXQ1_LOCREDIT_Reserved_31_29_MASK (0xE0000000U)
#define GMAC_MTL_TXQ1_LOCREDIT_Reserved_31_29_SHIFT (29U)
#define GMAC_MTL_TXQ1_LOCREDIT_Reserved_31_29_WIDTH (3U)
#define GMAC_MTL_TXQ1_LOCREDIT_Reserved_31_29(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ1_LOCREDIT_Reserved_31_29_SHIFT)) & GMAC_MTL_TXQ1_LOCREDIT_Reserved_31_29_MASK)
/*! @} */

/*! @name MTL_Q1_INTERRUPT_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK (0x1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT (0U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS_WIDTH (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK (0x2U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS_WIDTH (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_7_2_MASK (0xFCU)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_7_2_SHIFT (2U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_7_2_WIDTH (6U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_7_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_7_2_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_7_2_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE_MASK (0x100U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT (8U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE_WIDTH (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_TXUIE_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE_MASK (0x200U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE_SHIFT (9U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE_WIDTH (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_ABPSIE_MASK)

