zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_15_10_MASK (0xFC00U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_15_10_SHIFT (10U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_15_10_WIDTH (6U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_15_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_15_10_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_15_10_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS_MASK (0x10000U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS_SHIFT (16U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS_WIDTH (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOVFIS_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_23_17_MASK (0xFE0000U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_23_17_SHIFT (17U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_23_17_WIDTH (7U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_23_17(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_23_17_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_23_17_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE_MASK (0x1000000U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE_SHIFT (24U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE_WIDTH (1U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_RXOIE_MASK)

#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_31_25_MASK (0xFE000000U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_31_25_SHIFT (25U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_31_25_WIDTH (7U)
#define GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_31_25(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_31_25_SHIFT)) & GMAC_MTL_Q1_INTERRUPT_CONTROL_STATUS_Reserved_31_25_MASK)
/*! @} */

/*! @name MTL_RXQ1_OPERATION_MODE -  */
/*! @{ */

#define GMAC_MTL_RXQ1_OPERATION_MODE_RTC_MASK    (0x3U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RTC_SHIFT   (0U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RTC_WIDTH   (2U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RTC(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_RTC_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_RTC_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_2_MASK (0x4U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_2_SHIFT (2U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_2_WIDTH (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_2_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_2_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_FUP_MASK    (0x8U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_FUP_SHIFT   (3U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_FUP_WIDTH   (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_FUP(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_FUP_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_FUP_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_FEP_MASK    (0x10U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_FEP_SHIFT   (4U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_FEP_WIDTH   (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_FEP(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_FEP_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_FEP_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_RSF_MASK    (0x20U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RSF_SHIFT   (5U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RSF_WIDTH   (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RSF(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_RSF_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_RSF_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF_MASK (0x40U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF_SHIFT (6U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF_WIDTH (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_DIS_TCP_EF_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_EHFC_MASK   (0x80U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_EHFC_SHIFT  (7U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_EHFC_WIDTH  (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_EHFC(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_EHFC_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_EHFC_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_RFA_MASK    (0x1F00U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RFA_SHIFT   (8U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RFA_WIDTH   (5U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RFA(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_RFA_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_RFA_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_13_y_MASK (0x2000U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_13_y_SHIFT (13U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_13_y_WIDTH (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_13_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_13_y_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_13_y_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_RFD_MASK    (0x7C000U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RFD_SHIFT   (14U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RFD_WIDTH   (5U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RFD(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_RFD_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_RFD_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_19_y_MASK (0x80000U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_19_y_SHIFT (19U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_19_y_WIDTH (1U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_19_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_19_y_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_19_y_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_RQS_MASK    (0x3F00000U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RQS_SHIFT   (20U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RQS_WIDTH   (6U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_RQS(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_RQS_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_RQS_MASK)

#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_31_y_MASK (0xFC000000U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_31_y_SHIFT (26U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_31_y_WIDTH (6U)
#define GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_31_y(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_31_y_SHIFT)) & GMAC_MTL_RXQ1_OPERATION_MODE_Reserved_31_y_MASK)
/*! @} */

