zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_MTL_TXQ2_UNDERFLOW_Reserved_31_12_MASK (0xFFFFF000U)
#define GMAC_MTL_TXQ2_UNDERFLOW_Reserved_31_12_SHIFT (12U)
#define GMAC_MTL_TXQ2_UNDERFLOW_Reserved_31_12_WIDTH (20U)
#define GMAC_MTL_TXQ2_UNDERFLOW_Reserved_31_12(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_UNDERFLOW_Reserved_31_12_SHIFT)) & GMAC_MTL_TXQ2_UNDERFLOW_Reserved_31_12_MASK)
/*! @} */

/*! @name MTL_TXQ2_DEBUG -  */
/*! @{ */

#define GMAC_MTL_TXQ2_DEBUG_TXQPAUSED_MASK       (0x1U)
#define GMAC_MTL_TXQ2_DEBUG_TXQPAUSED_SHIFT      (0U)
#define GMAC_MTL_TXQ2_DEBUG_TXQPAUSED_WIDTH      (1U)
#define GMAC_MTL_TXQ2_DEBUG_TXQPAUSED(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_TXQPAUSED_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_TXQPAUSED_MASK)

#define GMAC_MTL_TXQ2_DEBUG_TRCSTS_MASK          (0x6U)
#define GMAC_MTL_TXQ2_DEBUG_TRCSTS_SHIFT         (1U)
#define GMAC_MTL_TXQ2_DEBUG_TRCSTS_WIDTH         (2U)
#define GMAC_MTL_TXQ2_DEBUG_TRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_TRCSTS_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_TRCSTS_MASK)

#define GMAC_MTL_TXQ2_DEBUG_TWCSTS_MASK          (0x8U)
#define GMAC_MTL_TXQ2_DEBUG_TWCSTS_SHIFT         (3U)
#define GMAC_MTL_TXQ2_DEBUG_TWCSTS_WIDTH         (1U)
#define GMAC_MTL_TXQ2_DEBUG_TWCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_TWCSTS_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_TWCSTS_MASK)

#define GMAC_MTL_TXQ2_DEBUG_TXQSTS_MASK          (0x10U)
#define GMAC_MTL_TXQ2_DEBUG_TXQSTS_SHIFT         (4U)
#define GMAC_MTL_TXQ2_DEBUG_TXQSTS_WIDTH         (1U)
#define GMAC_MTL_TXQ2_DEBUG_TXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_TXQSTS_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_TXQSTS_MASK)

#define GMAC_MTL_TXQ2_DEBUG_TXSTSFSTS_MASK       (0x20U)
#define GMAC_MTL_TXQ2_DEBUG_TXSTSFSTS_SHIFT      (5U)
#define GMAC_MTL_TXQ2_DEBUG_TXSTSFSTS_WIDTH      (1U)
#define GMAC_MTL_TXQ2_DEBUG_TXSTSFSTS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_TXSTSFSTS_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_TXSTSFSTS_MASK)

#define GMAC_MTL_TXQ2_DEBUG_Reserved_15_6_MASK   (0xFFC0U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_15_6_SHIFT  (6U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_15_6_WIDTH  (10U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_15_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_Reserved_15_6_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_Reserved_15_6_MASK)

#define GMAC_MTL_TXQ2_DEBUG_PTXQ_MASK            (0x70000U)
#define GMAC_MTL_TXQ2_DEBUG_PTXQ_SHIFT           (16U)
#define GMAC_MTL_TXQ2_DEBUG_PTXQ_WIDTH           (3U)
#define GMAC_MTL_TXQ2_DEBUG_PTXQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_PTXQ_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_PTXQ_MASK)

#define GMAC_MTL_TXQ2_DEBUG_Reserved_19_MASK     (0x80000U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_19_SHIFT    (19U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_19_WIDTH    (1U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_19(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_Reserved_19_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_Reserved_19_MASK)

#define GMAC_MTL_TXQ2_DEBUG_STXSTSF_MASK         (0x700000U)
#define GMAC_MTL_TXQ2_DEBUG_STXSTSF_SHIFT        (20U)
#define GMAC_MTL_TXQ2_DEBUG_STXSTSF_WIDTH        (3U)
#define GMAC_MTL_TXQ2_DEBUG_STXSTSF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_STXSTSF_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_STXSTSF_MASK)

#define GMAC_MTL_TXQ2_DEBUG_Reserved_31_23_MASK  (0xFF800000U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_31_23_SHIFT (23U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_31_23_WIDTH (9U)
#define GMAC_MTL_TXQ2_DEBUG_Reserved_31_23(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_DEBUG_Reserved_31_23_SHIFT)) & GMAC_MTL_TXQ2_DEBUG_Reserved_31_23_MASK)
/*! @} */

/*! @name MTL_TXQ2_ETS_CONTROL -  */
/*! @{ */

#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_1_0_MASK (0x3U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_1_0_SHIFT (0U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_1_0_WIDTH (2U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_1_0(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_1_0_SHIFT)) & GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_1_0_MASK)

#define GMAC_MTL_TXQ2_ETS_CONTROL_AVALG_MASK     (0x4U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_AVALG_SHIFT    (2U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_AVALG_WIDTH    (1U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_AVALG(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_CONTROL_AVALG_SHIFT)) & GMAC_MTL_TXQ2_ETS_CONTROL_AVALG_MASK)

#define GMAC_MTL_TXQ2_ETS_CONTROL_CC_MASK        (0x8U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_CC_SHIFT       (3U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_CC_WIDTH       (1U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_CC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_CONTROL_CC_SHIFT)) & GMAC_MTL_TXQ2_ETS_CONTROL_CC_MASK)

#define GMAC_MTL_TXQ2_ETS_CONTROL_SLC_MASK       (0x70U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_SLC_SHIFT      (4U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_SLC_WIDTH      (3U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_SLC(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_CONTROL_SLC_SHIFT)) & GMAC_MTL_TXQ2_ETS_CONTROL_SLC_MASK)

#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_31_7_MASK (0xFFFFFF80U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_31_7_SHIFT (7U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_31_7_WIDTH (25U)
#define GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_31_7(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_31_7_SHIFT)) & GMAC_MTL_TXQ2_ETS_CONTROL_Reserved_31_7_MASK)
/*! @} */

/*! @name MTL_TXQ2_ETS_STATUS -  */
/*! @{ */

#define GMAC_MTL_TXQ2_ETS_STATUS_ABS_MASK        (0xFFFFFFU)
#define GMAC_MTL_TXQ2_ETS_STATUS_ABS_SHIFT       (0U)
#define GMAC_MTL_TXQ2_ETS_STATUS_ABS_WIDTH       (24U)
#define GMAC_MTL_TXQ2_ETS_STATUS_ABS(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_STATUS_ABS_SHIFT)) & GMAC_MTL_TXQ2_ETS_STATUS_ABS_MASK)

#define GMAC_MTL_TXQ2_ETS_STATUS_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_MTL_TXQ2_ETS_STATUS_Reserved_31_24_SHIFT (24U)
#define GMAC_MTL_TXQ2_ETS_STATUS_Reserved_31_24_WIDTH (8U)
#define GMAC_MTL_TXQ2_ETS_STATUS_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_ETS_STATUS_Reserved_31_24_SHIFT)) & GMAC_MTL_TXQ2_ETS_STATUS_Reserved_31_24_MASK)
/*! @} */

/*! @name MTL_TXQ2_QUANTUM_WEIGHT -  */
/*! @{ */

#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_ISCQW_MASK  (0x1FFFFFU)
#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_ISCQW_SHIFT (0U)
#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_ISCQW_WIDTH (21U)
#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_ISCQW(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_QUANTUM_WEIGHT_ISCQW_SHIFT)) & GMAC_MTL_TXQ2_QUANTUM_WEIGHT_ISCQW_MASK)

#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_Reserved_31_21_MASK (0xFFE00000U)
#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_Reserved_31_21_SHIFT (21U)
#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_Reserved_31_21_WIDTH (11U)
#define GMAC_MTL_TXQ2_QUANTUM_WEIGHT_Reserved_31_21(x) (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_TXQ2_QUANTUM_WEIGHT_Reserved_31_21_SHIFT)) & GMAC_MTL_TXQ2_QUANTUM_WEIGHT_Reserved_31_21_MASK)
/*! @} */

