zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name MTL_RXQ2_DEBUG -  */
/*! @{ */

#define GMAC_MTL_RXQ2_DEBUG_RWCSTS_MASK          (0x1U)
#define GMAC_MTL_RXQ2_DEBUG_RWCSTS_SHIFT         (0U)
#define GMAC_MTL_RXQ2_DEBUG_RWCSTS_WIDTH         (1U)
#define GMAC_MTL_RXQ2_DEBUG_RWCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_RWCSTS_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_RWCSTS_MASK)

#define GMAC_MTL_RXQ2_DEBUG_RRCSTS_MASK          (0x6U)
#define GMAC_MTL_RXQ2_DEBUG_RRCSTS_SHIFT         (1U)
#define GMAC_MTL_RXQ2_DEBUG_RRCSTS_WIDTH         (2U)
#define GMAC_MTL_RXQ2_DEBUG_RRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_RRCSTS_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_RRCSTS_MASK)

#define GMAC_MTL_RXQ2_DEBUG_Reserved_3_MASK      (0x8U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_3_SHIFT     (3U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_3_WIDTH     (1U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_3(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_Reserved_3_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_Reserved_3_MASK)

#define GMAC_MTL_RXQ2_DEBUG_RXQSTS_MASK          (0x30U)
#define GMAC_MTL_RXQ2_DEBUG_RXQSTS_SHIFT         (4U)
#define GMAC_MTL_RXQ2_DEBUG_RXQSTS_WIDTH         (2U)
#define GMAC_MTL_RXQ2_DEBUG_RXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_RXQSTS_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_RXQSTS_MASK)

#define GMAC_MTL_RXQ2_DEBUG_Reserved_15_6_MASK   (0xFFC0U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_15_6_SHIFT  (6U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_15_6_WIDTH  (10U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_15_6(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_Reserved_15_6_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_Reserved_15_6_MASK)

#define GMAC_MTL_RXQ2_DEBUG_PRXQ_MASK            (0x3FFF0000U)
#define GMAC_MTL_RXQ2_DEBUG_PRXQ_SHIFT           (16U)
#define GMAC_MTL_RXQ2_DEBUG_PRXQ_WIDTH           (14U)
#define GMAC_MTL_RXQ2_DEBUG_PRXQ(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_PRXQ_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_PRXQ_MASK)

#define GMAC_MTL_RXQ2_DEBUG_Reserved_31_30_MASK  (0xC0000000U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_31_30_SHIFT (30U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_31_30_WIDTH (2U)
#define GMAC_MTL_RXQ2_DEBUG_Reserved_31_30(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_DEBUG_Reserved_31_30_SHIFT)) & GMAC_MTL_RXQ2_DEBUG_Reserved_31_30_MASK)
/*! @} */

/*! @name MTL_RXQ2_CONTROL -  */
/*! @{ */

#define GMAC_MTL_RXQ2_CONTROL_RXQ_WEGT_MASK      (0x7U)
#define GMAC_MTL_RXQ2_CONTROL_RXQ_WEGT_SHIFT     (0U)
#define GMAC_MTL_RXQ2_CONTROL_RXQ_WEGT_WIDTH     (3U)
#define GMAC_MTL_RXQ2_CONTROL_RXQ_WEGT(x)        (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_CONTROL_RXQ_WEGT_SHIFT)) & GMAC_MTL_RXQ2_CONTROL_RXQ_WEGT_MASK)

#define GMAC_MTL_RXQ2_CONTROL_RXQ_FRM_ARBIT_MASK (0x8U)
#define GMAC_MTL_RXQ2_CONTROL_RXQ_FRM_ARBIT_SHIFT (3U)
#define GMAC_MTL_RXQ2_CONTROL_RXQ_FRM_ARBIT_WIDTH (1U)
#define GMAC_MTL_RXQ2_CONTROL_RXQ_FRM_ARBIT(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_CONTROL_RXQ_FRM_ARBIT_SHIFT)) & GMAC_MTL_RXQ2_CONTROL_RXQ_FRM_ARBIT_MASK)

#define GMAC_MTL_RXQ2_CONTROL_Reserved_31_4_MASK (0xFFFFFFF0U)
#define GMAC_MTL_RXQ2_CONTROL_Reserved_31_4_SHIFT (4U)
#define GMAC_MTL_RXQ2_CONTROL_Reserved_31_4_WIDTH (28U)
#define GMAC_MTL_RXQ2_CONTROL_Reserved_31_4(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_MTL_RXQ2_CONTROL_Reserved_31_4_SHIFT)) & GMAC_MTL_RXQ2_CONTROL_Reserved_31_4_MASK)
/*! @} */

/*! @name DMA_MODE -  */
/*! @{ */

#define GMAC_DMA_MODE_SWR_MASK                   (0x1U)
#define GMAC_DMA_MODE_SWR_SHIFT                  (0U)
#define GMAC_DMA_MODE_SWR_WIDTH                  (1U)
#define GMAC_DMA_MODE_SWR(x)                     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_SWR_SHIFT)) & GMAC_DMA_MODE_SWR_MASK)

#define GMAC_DMA_MODE_DA_MASK                    (0x2U)
#define GMAC_DMA_MODE_DA_SHIFT                   (1U)
#define GMAC_DMA_MODE_DA_WIDTH                   (1U)
#define GMAC_DMA_MODE_DA(x)                      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_DA_SHIFT)) & GMAC_DMA_MODE_DA_MASK)

#define GMAC_DMA_MODE_TAA_MASK                   (0x1CU)
#define GMAC_DMA_MODE_TAA_SHIFT                  (2U)
#define GMAC_DMA_MODE_TAA_WIDTH                  (3U)
#define GMAC_DMA_MODE_TAA(x)                     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_TAA_SHIFT)) & GMAC_DMA_MODE_TAA_MASK)

#define GMAC_DMA_MODE_Reserved_7_5_MASK          (0xE0U)
#define GMAC_DMA_MODE_Reserved_7_5_SHIFT         (5U)
#define GMAC_DMA_MODE_Reserved_7_5_WIDTH         (3U)
#define GMAC_DMA_MODE_Reserved_7_5(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_7_5_SHIFT)) & GMAC_DMA_MODE_Reserved_7_5_MASK)

#define GMAC_DMA_MODE_Reserved_DSPW_MASK         (0x100U)
#define GMAC_DMA_MODE_Reserved_DSPW_SHIFT        (8U)
#define GMAC_DMA_MODE_Reserved_DSPW_WIDTH        (1U)
#define GMAC_DMA_MODE_Reserved_DSPW(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_DSPW_SHIFT)) & GMAC_DMA_MODE_Reserved_DSPW_MASK)

#define GMAC_DMA_MODE_ARBC_MASK                  (0x200U)
#define GMAC_DMA_MODE_ARBC_SHIFT                 (9U)
#define GMAC_DMA_MODE_ARBC_WIDTH                 (1U)
#define GMAC_DMA_MODE_ARBC(x)                    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_ARBC_SHIFT)) & GMAC_DMA_MODE_ARBC_MASK)

#define GMAC_DMA_MODE_Reserved_SCSW_MASK         (0x400U)
#define GMAC_DMA_MODE_Reserved_SCSW_SHIFT        (10U)
#define GMAC_DMA_MODE_Reserved_SCSW_WIDTH        (1U)
#define GMAC_DMA_MODE_Reserved_SCSW(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_SCSW_SHIFT)) & GMAC_DMA_MODE_Reserved_SCSW_MASK)

#define GMAC_DMA_MODE_TXPR_MASK                  (0x800U)
#define GMAC_DMA_MODE_TXPR_SHIFT                 (11U)
#define GMAC_DMA_MODE_TXPR_WIDTH                 (1U)
#define GMAC_DMA_MODE_TXPR(x)                    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_TXPR_SHIFT)) & GMAC_DMA_MODE_TXPR_MASK)

#define GMAC_DMA_MODE_PR_MASK                    (0x7000U)
#define GMAC_DMA_MODE_PR_SHIFT                   (12U)
#define GMAC_DMA_MODE_PR_WIDTH                   (3U)
#define GMAC_DMA_MODE_PR(x)                      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_PR_SHIFT)) & GMAC_DMA_MODE_PR_MASK)

#define GMAC_DMA_MODE_Reserved_15_MASK           (0x8000U)
#define GMAC_DMA_MODE_Reserved_15_SHIFT          (15U)
#define GMAC_DMA_MODE_Reserved_15_WIDTH          (1U)
#define GMAC_DMA_MODE_Reserved_15(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_15_SHIFT)) & GMAC_DMA_MODE_Reserved_15_MASK)

#define GMAC_DMA_MODE_INTM_MASK                  (0x30000U)
#define GMAC_DMA_MODE_INTM_SHIFT                 (16U)
#define GMAC_DMA_MODE_INTM_WIDTH                 (2U)
#define GMAC_DMA_MODE_INTM(x)                    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_INTM_SHIFT)) & GMAC_DMA_MODE_INTM_MASK)

#define GMAC_DMA_MODE_Reserved_18_MASK           (0x40000U)
#define GMAC_DMA_MODE_Reserved_18_SHIFT          (18U)
#define GMAC_DMA_MODE_Reserved_18_WIDTH          (1U)
#define GMAC_DMA_MODE_Reserved_18(x)             (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_18_SHIFT)) & GMAC_DMA_MODE_Reserved_18_MASK)

#define GMAC_DMA_MODE_Reserved_DCHE_MASK         (0x80000U)
#define GMAC_DMA_MODE_Reserved_DCHE_SHIFT        (19U)
#define GMAC_DMA_MODE_Reserved_DCHE_WIDTH        (1U)
#define GMAC_DMA_MODE_Reserved_DCHE(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_DCHE_SHIFT)) & GMAC_DMA_MODE_Reserved_DCHE_MASK)

