zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_DMA_MODE_Reserved_TNDF_MASK         (0x300000U)
#define GMAC_DMA_MODE_Reserved_TNDF_SHIFT        (20U)
#define GMAC_DMA_MODE_Reserved_TNDF_WIDTH        (2U)
#define GMAC_DMA_MODE_Reserved_TNDF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_TNDF_SHIFT)) & GMAC_DMA_MODE_Reserved_TNDF_MASK)

#define GMAC_DMA_MODE_Reserved_RNDF_MASK         (0xC00000U)
#define GMAC_DMA_MODE_Reserved_RNDF_SHIFT        (22U)
#define GMAC_DMA_MODE_Reserved_RNDF_WIDTH        (2U)
#define GMAC_DMA_MODE_Reserved_RNDF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_RNDF_SHIFT)) & GMAC_DMA_MODE_Reserved_RNDF_MASK)

#define GMAC_DMA_MODE_Reserved_31_24_MASK        (0xFF000000U)
#define GMAC_DMA_MODE_Reserved_31_24_SHIFT       (24U)
#define GMAC_DMA_MODE_Reserved_31_24_WIDTH       (8U)
#define GMAC_DMA_MODE_Reserved_31_24(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_MODE_Reserved_31_24_SHIFT)) & GMAC_DMA_MODE_Reserved_31_24_MASK)
/*! @} */

/*! @name DMA_SYSBUS_MODE -  */
/*! @{ */

#define GMAC_DMA_SYSBUS_MODE_FB_MASK             (0x1U)
#define GMAC_DMA_SYSBUS_MODE_FB_SHIFT            (0U)
#define GMAC_DMA_SYSBUS_MODE_FB_WIDTH            (1U)
#define GMAC_DMA_SYSBUS_MODE_FB(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_FB_SHIFT)) & GMAC_DMA_SYSBUS_MODE_FB_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN4_MASK (0x2U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN4_SHIFT (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN4_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN4(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN4_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN4_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN8_MASK (0x4U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN8_SHIFT (2U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN8_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN8(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN8_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN8_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN16_MASK (0x8U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN16_SHIFT (3U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN16_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN16(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN16_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN16_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN32_MASK (0x10U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN32_SHIFT (4U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN32_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN32(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN32_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN32_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN64_MASK (0x20U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN64_SHIFT (5U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN64_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN64(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN64_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN64_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN128_MASK (0x40U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN128_SHIFT (6U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN128_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN128(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN128_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN128_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN256_MASK (0x80U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN256_SHIFT (7U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN256_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_BLEN256(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_BLEN256_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_BLEN256_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_9_8_MASK   (0x300U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_9_8_SHIFT  (8U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_9_8_WIDTH  (2U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_9_8(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_9_8_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_9_8_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_AALE_MASK  (0x400U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_AALE_SHIFT (10U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_AALE_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_AALE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_AALE_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_AALE_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_EAME_MASK  (0x800U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_EAME_SHIFT (11U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_EAME_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_EAME(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_EAME_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_EAME_MASK)

#define GMAC_DMA_SYSBUS_MODE_AAL_MASK            (0x1000U)
#define GMAC_DMA_SYSBUS_MODE_AAL_SHIFT           (12U)
#define GMAC_DMA_SYSBUS_MODE_AAL_WIDTH           (1U)
#define GMAC_DMA_SYSBUS_MODE_AAL(x)              (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_AAL_SHIFT)) & GMAC_DMA_SYSBUS_MODE_AAL_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_ONEKBBE_MASK (0x2000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_ONEKBBE_SHIFT (13U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_ONEKBBE_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_ONEKBBE(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_ONEKBBE_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_ONEKBBE_MASK)

#define GMAC_DMA_SYSBUS_MODE_MB_MASK             (0x4000U)
#define GMAC_DMA_SYSBUS_MODE_MB_SHIFT            (14U)
#define GMAC_DMA_SYSBUS_MODE_MB_WIDTH            (1U)
#define GMAC_DMA_SYSBUS_MODE_MB(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_MB_SHIFT)) & GMAC_DMA_SYSBUS_MODE_MB_MASK)

#define GMAC_DMA_SYSBUS_MODE_RB_MASK             (0x8000U)
#define GMAC_DMA_SYSBUS_MODE_RB_SHIFT            (15U)
#define GMAC_DMA_SYSBUS_MODE_RB_WIDTH            (1U)
#define GMAC_DMA_SYSBUS_MODE_RB(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_RB_SHIFT)) & GMAC_DMA_SYSBUS_MODE_RB_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_RD_OSR_LMT_MASK (0x70000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_RD_OSR_LMT_SHIFT (16U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_RD_OSR_LMT_WIDTH (3U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_RD_OSR_LMT(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_RD_OSR_LMT_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_RD_OSR_LMT_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_23_y_MASK  (0xF80000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_23_y_SHIFT (19U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_23_y_WIDTH (5U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_23_y(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_23_y_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_23_y_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_WR_OSR_LMT_MASK (0x7000000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_WR_OSR_LMT_SHIFT (24U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_WR_OSR_LMT_WIDTH (3U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_WR_OSR_LMT(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_WR_OSR_LMT_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_WR_OSR_LMT_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_29_y_MASK  (0x38000000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_29_y_SHIFT (27U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_29_y_WIDTH (3U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_29_y(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_29_y_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_29_y_MASK)

#define GMAC_DMA_SYSBUS_MODE_Reserved_LPI_XIT_PKT_MASK (0x40000000U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_LPI_XIT_PKT_SHIFT (30U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_LPI_XIT_PKT_WIDTH (1U)
#define GMAC_DMA_SYSBUS_MODE_Reserved_LPI_XIT_PKT(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_SYSBUS_MODE_Reserved_LPI_XIT_PKT_SHIFT)) & GMAC_DMA_SYSBUS_MODE_Reserved_LPI_XIT_PKT_MASK)

