zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_DMA_TBS_CTRL0_Reserved_3_1_MASK     (0xEU)
#define GMAC_DMA_TBS_CTRL0_Reserved_3_1_SHIFT    (1U)
#define GMAC_DMA_TBS_CTRL0_Reserved_3_1_WIDTH    (3U)
#define GMAC_DMA_TBS_CTRL0_Reserved_3_1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL0_Reserved_3_1_SHIFT)) & GMAC_DMA_TBS_CTRL0_Reserved_3_1_MASK)

#define GMAC_DMA_TBS_CTRL0_FGOS_MASK             (0x70U)
#define GMAC_DMA_TBS_CTRL0_FGOS_SHIFT            (4U)
#define GMAC_DMA_TBS_CTRL0_FGOS_WIDTH            (3U)
#define GMAC_DMA_TBS_CTRL0_FGOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL0_FGOS_SHIFT)) & GMAC_DMA_TBS_CTRL0_FGOS_MASK)

#define GMAC_DMA_TBS_CTRL0_Reserved_7_MASK       (0x80U)
#define GMAC_DMA_TBS_CTRL0_Reserved_7_SHIFT      (7U)
#define GMAC_DMA_TBS_CTRL0_Reserved_7_WIDTH      (1U)
#define GMAC_DMA_TBS_CTRL0_Reserved_7(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL0_Reserved_7_SHIFT)) & GMAC_DMA_TBS_CTRL0_Reserved_7_MASK)

#define GMAC_DMA_TBS_CTRL0_FTOS_MASK             (0xFFFFFF00U)
#define GMAC_DMA_TBS_CTRL0_FTOS_SHIFT            (8U)
#define GMAC_DMA_TBS_CTRL0_FTOS_WIDTH            (24U)
#define GMAC_DMA_TBS_CTRL0_FTOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL0_FTOS_SHIFT)) & GMAC_DMA_TBS_CTRL0_FTOS_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL1 -  */
/*! @{ */

#define GMAC_DMA_TBS_CTRL1_FTOV_MASK             (0x1U)
#define GMAC_DMA_TBS_CTRL1_FTOV_SHIFT            (0U)
#define GMAC_DMA_TBS_CTRL1_FTOV_WIDTH            (1U)
#define GMAC_DMA_TBS_CTRL1_FTOV(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL1_FTOV_SHIFT)) & GMAC_DMA_TBS_CTRL1_FTOV_MASK)

#define GMAC_DMA_TBS_CTRL1_Reserved_3_1_MASK     (0xEU)
#define GMAC_DMA_TBS_CTRL1_Reserved_3_1_SHIFT    (1U)
#define GMAC_DMA_TBS_CTRL1_Reserved_3_1_WIDTH    (3U)
#define GMAC_DMA_TBS_CTRL1_Reserved_3_1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL1_Reserved_3_1_SHIFT)) & GMAC_DMA_TBS_CTRL1_Reserved_3_1_MASK)

#define GMAC_DMA_TBS_CTRL1_FGOS_MASK             (0x70U)
#define GMAC_DMA_TBS_CTRL1_FGOS_SHIFT            (4U)
#define GMAC_DMA_TBS_CTRL1_FGOS_WIDTH            (3U)
#define GMAC_DMA_TBS_CTRL1_FGOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL1_FGOS_SHIFT)) & GMAC_DMA_TBS_CTRL1_FGOS_MASK)

#define GMAC_DMA_TBS_CTRL1_Reserved_7_MASK       (0x80U)
#define GMAC_DMA_TBS_CTRL1_Reserved_7_SHIFT      (7U)
#define GMAC_DMA_TBS_CTRL1_Reserved_7_WIDTH      (1U)
#define GMAC_DMA_TBS_CTRL1_Reserved_7(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL1_Reserved_7_SHIFT)) & GMAC_DMA_TBS_CTRL1_Reserved_7_MASK)

#define GMAC_DMA_TBS_CTRL1_FTOS_MASK             (0xFFFFFF00U)
#define GMAC_DMA_TBS_CTRL1_FTOS_SHIFT            (8U)
#define GMAC_DMA_TBS_CTRL1_FTOS_WIDTH            (24U)
#define GMAC_DMA_TBS_CTRL1_FTOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL1_FTOS_SHIFT)) & GMAC_DMA_TBS_CTRL1_FTOS_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL2 -  */
/*! @{ */

#define GMAC_DMA_TBS_CTRL2_FTOV_MASK             (0x1U)
#define GMAC_DMA_TBS_CTRL2_FTOV_SHIFT            (0U)
#define GMAC_DMA_TBS_CTRL2_FTOV_WIDTH            (1U)
#define GMAC_DMA_TBS_CTRL2_FTOV(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL2_FTOV_SHIFT)) & GMAC_DMA_TBS_CTRL2_FTOV_MASK)

#define GMAC_DMA_TBS_CTRL2_Reserved_3_1_MASK     (0xEU)
#define GMAC_DMA_TBS_CTRL2_Reserved_3_1_SHIFT    (1U)
#define GMAC_DMA_TBS_CTRL2_Reserved_3_1_WIDTH    (3U)
#define GMAC_DMA_TBS_CTRL2_Reserved_3_1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL2_Reserved_3_1_SHIFT)) & GMAC_DMA_TBS_CTRL2_Reserved_3_1_MASK)

#define GMAC_DMA_TBS_CTRL2_FGOS_MASK             (0x70U)
#define GMAC_DMA_TBS_CTRL2_FGOS_SHIFT            (4U)
#define GMAC_DMA_TBS_CTRL2_FGOS_WIDTH            (3U)
#define GMAC_DMA_TBS_CTRL2_FGOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL2_FGOS_SHIFT)) & GMAC_DMA_TBS_CTRL2_FGOS_MASK)

#define GMAC_DMA_TBS_CTRL2_Reserved_7_MASK       (0x80U)
#define GMAC_DMA_TBS_CTRL2_Reserved_7_SHIFT      (7U)
#define GMAC_DMA_TBS_CTRL2_Reserved_7_WIDTH      (1U)
#define GMAC_DMA_TBS_CTRL2_Reserved_7(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL2_Reserved_7_SHIFT)) & GMAC_DMA_TBS_CTRL2_Reserved_7_MASK)

#define GMAC_DMA_TBS_CTRL2_FTOS_MASK             (0xFFFFFF00U)
#define GMAC_DMA_TBS_CTRL2_FTOS_SHIFT            (8U)
#define GMAC_DMA_TBS_CTRL2_FTOS_WIDTH            (24U)
#define GMAC_DMA_TBS_CTRL2_FTOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL2_FTOS_SHIFT)) & GMAC_DMA_TBS_CTRL2_FTOS_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL3 -  */
/*! @{ */

#define GMAC_DMA_TBS_CTRL3_FTOV_MASK             (0x1U)
#define GMAC_DMA_TBS_CTRL3_FTOV_SHIFT            (0U)
#define GMAC_DMA_TBS_CTRL3_FTOV_WIDTH            (1U)
#define GMAC_DMA_TBS_CTRL3_FTOV(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL3_FTOV_SHIFT)) & GMAC_DMA_TBS_CTRL3_FTOV_MASK)

#define GMAC_DMA_TBS_CTRL3_Reserved_3_1_MASK     (0xEU)
#define GMAC_DMA_TBS_CTRL3_Reserved_3_1_SHIFT    (1U)
#define GMAC_DMA_TBS_CTRL3_Reserved_3_1_WIDTH    (3U)
#define GMAC_DMA_TBS_CTRL3_Reserved_3_1(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL3_Reserved_3_1_SHIFT)) & GMAC_DMA_TBS_CTRL3_Reserved_3_1_MASK)

#define GMAC_DMA_TBS_CTRL3_FGOS_MASK             (0x70U)
#define GMAC_DMA_TBS_CTRL3_FGOS_SHIFT            (4U)
#define GMAC_DMA_TBS_CTRL3_FGOS_WIDTH            (3U)
#define GMAC_DMA_TBS_CTRL3_FGOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL3_FGOS_SHIFT)) & GMAC_DMA_TBS_CTRL3_FGOS_MASK)

#define GMAC_DMA_TBS_CTRL3_Reserved_7_MASK       (0x80U)
#define GMAC_DMA_TBS_CTRL3_Reserved_7_SHIFT      (7U)
#define GMAC_DMA_TBS_CTRL3_Reserved_7_WIDTH      (1U)
#define GMAC_DMA_TBS_CTRL3_Reserved_7(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL3_Reserved_7_SHIFT)) & GMAC_DMA_TBS_CTRL3_Reserved_7_MASK)

#define GMAC_DMA_TBS_CTRL3_FTOS_MASK             (0xFFFFFF00U)
#define GMAC_DMA_TBS_CTRL3_FTOS_SHIFT            (8U)
#define GMAC_DMA_TBS_CTRL3_FTOS_WIDTH            (24U)
#define GMAC_DMA_TBS_CTRL3_FTOS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_TBS_CTRL3_FTOS_SHIFT)) & GMAC_DMA_TBS_CTRL3_FTOS_MASK)
/*! @} */

/*! @name DMA_SAFETY_INTERRUPT_STATUS -  */
/*! @{ */

