zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_DMA_CH0_STATUS_TI_MASK              (0x1U)
#define GMAC_DMA_CH0_STATUS_TI_SHIFT             (0U)
#define GMAC_DMA_CH0_STATUS_TI_WIDTH             (1U)
#define GMAC_DMA_CH0_STATUS_TI(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_TI_SHIFT)) & GMAC_DMA_CH0_STATUS_TI_MASK)

#define GMAC_DMA_CH0_STATUS_TPS_MASK             (0x2U)
#define GMAC_DMA_CH0_STATUS_TPS_SHIFT            (1U)
#define GMAC_DMA_CH0_STATUS_TPS_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_TPS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_TPS_SHIFT)) & GMAC_DMA_CH0_STATUS_TPS_MASK)

#define GMAC_DMA_CH0_STATUS_TBU_MASK             (0x4U)
#define GMAC_DMA_CH0_STATUS_TBU_SHIFT            (2U)
#define GMAC_DMA_CH0_STATUS_TBU_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_TBU(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_TBU_SHIFT)) & GMAC_DMA_CH0_STATUS_TBU_MASK)

#define GMAC_DMA_CH0_STATUS_Reserved_5_3_MASK    (0x38U)
#define GMAC_DMA_CH0_STATUS_Reserved_5_3_SHIFT   (3U)
#define GMAC_DMA_CH0_STATUS_Reserved_5_3_WIDTH   (3U)
#define GMAC_DMA_CH0_STATUS_Reserved_5_3(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_Reserved_5_3_SHIFT)) & GMAC_DMA_CH0_STATUS_Reserved_5_3_MASK)

#define GMAC_DMA_CH0_STATUS_RI_MASK              (0x40U)
#define GMAC_DMA_CH0_STATUS_RI_SHIFT             (6U)
#define GMAC_DMA_CH0_STATUS_RI_WIDTH             (1U)
#define GMAC_DMA_CH0_STATUS_RI(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_RI_SHIFT)) & GMAC_DMA_CH0_STATUS_RI_MASK)

#define GMAC_DMA_CH0_STATUS_RBU_MASK             (0x80U)
#define GMAC_DMA_CH0_STATUS_RBU_SHIFT            (7U)
#define GMAC_DMA_CH0_STATUS_RBU_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_RBU(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_RBU_SHIFT)) & GMAC_DMA_CH0_STATUS_RBU_MASK)

#define GMAC_DMA_CH0_STATUS_RPS_MASK             (0x100U)
#define GMAC_DMA_CH0_STATUS_RPS_SHIFT            (8U)
#define GMAC_DMA_CH0_STATUS_RPS_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_RPS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_RPS_SHIFT)) & GMAC_DMA_CH0_STATUS_RPS_MASK)

#define GMAC_DMA_CH0_STATUS_RWT_MASK             (0x200U)
#define GMAC_DMA_CH0_STATUS_RWT_SHIFT            (9U)
#define GMAC_DMA_CH0_STATUS_RWT_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_RWT(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_RWT_SHIFT)) & GMAC_DMA_CH0_STATUS_RWT_MASK)

#define GMAC_DMA_CH0_STATUS_ETI_MASK             (0x400U)
#define GMAC_DMA_CH0_STATUS_ETI_SHIFT            (10U)
#define GMAC_DMA_CH0_STATUS_ETI_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_ETI(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_ETI_SHIFT)) & GMAC_DMA_CH0_STATUS_ETI_MASK)

#define GMAC_DMA_CH0_STATUS_ERI_MASK             (0x800U)
#define GMAC_DMA_CH0_STATUS_ERI_SHIFT            (11U)
#define GMAC_DMA_CH0_STATUS_ERI_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_ERI(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_ERI_SHIFT)) & GMAC_DMA_CH0_STATUS_ERI_MASK)

#define GMAC_DMA_CH0_STATUS_FBE_MASK             (0x1000U)
#define GMAC_DMA_CH0_STATUS_FBE_SHIFT            (12U)
#define GMAC_DMA_CH0_STATUS_FBE_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_FBE(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_FBE_SHIFT)) & GMAC_DMA_CH0_STATUS_FBE_MASK)

#define GMAC_DMA_CH0_STATUS_CDE_MASK             (0x2000U)
#define GMAC_DMA_CH0_STATUS_CDE_SHIFT            (13U)
#define GMAC_DMA_CH0_STATUS_CDE_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_CDE(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_CDE_SHIFT)) & GMAC_DMA_CH0_STATUS_CDE_MASK)

#define GMAC_DMA_CH0_STATUS_AIS_MASK             (0x4000U)
#define GMAC_DMA_CH0_STATUS_AIS_SHIFT            (14U)
#define GMAC_DMA_CH0_STATUS_AIS_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_AIS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_AIS_SHIFT)) & GMAC_DMA_CH0_STATUS_AIS_MASK)

#define GMAC_DMA_CH0_STATUS_NIS_MASK             (0x8000U)
#define GMAC_DMA_CH0_STATUS_NIS_SHIFT            (15U)
#define GMAC_DMA_CH0_STATUS_NIS_WIDTH            (1U)
#define GMAC_DMA_CH0_STATUS_NIS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_NIS_SHIFT)) & GMAC_DMA_CH0_STATUS_NIS_MASK)

#define GMAC_DMA_CH0_STATUS_TEB_MASK             (0x70000U)
#define GMAC_DMA_CH0_STATUS_TEB_SHIFT            (16U)
#define GMAC_DMA_CH0_STATUS_TEB_WIDTH            (3U)
#define GMAC_DMA_CH0_STATUS_TEB(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_TEB_SHIFT)) & GMAC_DMA_CH0_STATUS_TEB_MASK)

#define GMAC_DMA_CH0_STATUS_REB_MASK             (0x380000U)
#define GMAC_DMA_CH0_STATUS_REB_SHIFT            (19U)
#define GMAC_DMA_CH0_STATUS_REB_WIDTH            (3U)
#define GMAC_DMA_CH0_STATUS_REB(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_REB_SHIFT)) & GMAC_DMA_CH0_STATUS_REB_MASK)

#define GMAC_DMA_CH0_STATUS_Reserved_31_22_MASK  (0xFFC00000U)
#define GMAC_DMA_CH0_STATUS_Reserved_31_22_SHIFT (22U)
#define GMAC_DMA_CH0_STATUS_Reserved_31_22_WIDTH (10U)
#define GMAC_DMA_CH0_STATUS_Reserved_31_22(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_STATUS_Reserved_31_22_SHIFT)) & GMAC_DMA_CH0_STATUS_Reserved_31_22_MASK)
/*! @} */

/*! @name DMA_CH0_MISS_FRAME_CNT -  */
/*! @{ */

#define GMAC_DMA_CH0_MISS_FRAME_CNT_MFC_MASK     (0x7FFU)
#define GMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT    (0U)
#define GMAC_DMA_CH0_MISS_FRAME_CNT_MFC_WIDTH    (11U)
#define GMAC_DMA_CH0_MISS_FRAME_CNT_MFC(x)       (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_MISS_FRAME_CNT_MFC_SHIFT)) & GMAC_DMA_CH0_MISS_FRAME_CNT_MFC_MASK)

#define GMAC_DMA_CH0_MISS_FRAME_CNT_Reserved_14_11_MASK (0x7800U)
#define GMAC_DMA_CH0_MISS_FRAME_CNT_Reserved_14_11_SHIFT (11U)
#define GMAC_DMA_CH0_MISS_FRAME_CNT_Reserved_14_11_WIDTH (4U)
#define GMAC_DMA_CH0_MISS_FRAME_CNT_Reserved_14_11(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH0_MISS_FRAME_CNT_Reserved_14_11_SHIFT)) & GMAC_DMA_CH0_MISS_FRAME_CNT_Reserved_14_11_MASK)

