zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_MASK (0xFFFC0000U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_SHIFT (18U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_WIDTH (14U)
#define GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_SHIFT)) & GMAC_DMA_CH1_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_MASK)
/*! @} */

/*! @name DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ESC_MASK (0x1U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ESC_SHIFT (0U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ESC_WIDTH (1U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ESC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ESC_SHIFT)) & GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ESC_MASK)

#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ASC_MASK (0x2U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ASC_SHIFT (1U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ASC_WIDTH (1U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ASC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ASC_SHIFT)) & GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_ASC_MASK)

#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_MASK (0xCU)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_SHIFT (2U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_WIDTH (2U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_SHIFT)) & GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_MASK)

#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_SIV_MASK (0xFFF0U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT (4U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_SIV_WIDTH (12U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_SIV(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT)) & GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_SIV_MASK)

#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_RSN_MASK (0xF0000U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT (16U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_RSN_WIDTH (4U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_RSN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT)) & GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_RSN_MASK)

#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_MASK (0xFFF00000U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_SHIFT (20U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_WIDTH (12U)
#define GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_SHIFT)) & GMAC_DMA_CH1_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_MASK)
/*! @} */

/*! @name DMA_CH1_CURRENT_APP_TXDESC -  */
/*! @{ */

#define GMAC_DMA_CH1_CURRENT_APP_TXDESC_CURTDESAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH1_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT (0U)
#define GMAC_DMA_CH1_CURRENT_APP_TXDESC_CURTDESAPTR_WIDTH (32U)
#define GMAC_DMA_CH1_CURRENT_APP_TXDESC_CURTDESAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT)) & GMAC_DMA_CH1_CURRENT_APP_TXDESC_CURTDESAPTR_MASK)
/*! @} */

/*! @name DMA_CH1_CURRENT_APP_RXDESC -  */
/*! @{ */

#define GMAC_DMA_CH1_CURRENT_APP_RXDESC_CURRDESAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH1_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT (0U)
#define GMAC_DMA_CH1_CURRENT_APP_RXDESC_CURRDESAPTR_WIDTH (32U)
#define GMAC_DMA_CH1_CURRENT_APP_RXDESC_CURRDESAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT)) & GMAC_DMA_CH1_CURRENT_APP_RXDESC_CURRDESAPTR_MASK)
/*! @} */

/*! @name DMA_CH1_CURRENT_APP_TXBUFFER -  */
/*! @{ */

#define GMAC_DMA_CH1_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH1_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT (0U)
#define GMAC_DMA_CH1_CURRENT_APP_TXBUFFER_CURTBUFAPTR_WIDTH (32U)
#define GMAC_DMA_CH1_CURRENT_APP_TXBUFFER_CURTBUFAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT)) & GMAC_DMA_CH1_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MASK)
/*! @} */

/*! @name DMA_CH1_CURRENT_APP_RXBUFFER -  */
/*! @{ */

#define GMAC_DMA_CH1_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH1_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT (0U)
#define GMAC_DMA_CH1_CURRENT_APP_RXBUFFER_CURRBUFAPTR_WIDTH (32U)
#define GMAC_DMA_CH1_CURRENT_APP_RXBUFFER_CURRBUFAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT)) & GMAC_DMA_CH1_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MASK)
/*! @} */

/*! @name DMA_CH1_STATUS -  */
/*! @{ */

#define GMAC_DMA_CH1_STATUS_TI_MASK              (0x1U)
#define GMAC_DMA_CH1_STATUS_TI_SHIFT             (0U)
#define GMAC_DMA_CH1_STATUS_TI_WIDTH             (1U)
#define GMAC_DMA_CH1_STATUS_TI(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_STATUS_TI_SHIFT)) & GMAC_DMA_CH1_STATUS_TI_MASK)

#define GMAC_DMA_CH1_STATUS_TPS_MASK             (0x2U)
#define GMAC_DMA_CH1_STATUS_TPS_SHIFT            (1U)
#define GMAC_DMA_CH1_STATUS_TPS_WIDTH            (1U)
#define GMAC_DMA_CH1_STATUS_TPS(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_STATUS_TPS_SHIFT)) & GMAC_DMA_CH1_STATUS_TPS_MASK)

#define GMAC_DMA_CH1_STATUS_TBU_MASK             (0x4U)
#define GMAC_DMA_CH1_STATUS_TBU_SHIFT            (2U)
#define GMAC_DMA_CH1_STATUS_TBU_WIDTH            (1U)
#define GMAC_DMA_CH1_STATUS_TBU(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_STATUS_TBU_SHIFT)) & GMAC_DMA_CH1_STATUS_TBU_MASK)

#define GMAC_DMA_CH1_STATUS_Reserved_5_3_MASK    (0x38U)
#define GMAC_DMA_CH1_STATUS_Reserved_5_3_SHIFT   (3U)
#define GMAC_DMA_CH1_STATUS_Reserved_5_3_WIDTH   (3U)
#define GMAC_DMA_CH1_STATUS_Reserved_5_3(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_STATUS_Reserved_5_3_SHIFT)) & GMAC_DMA_CH1_STATUS_Reserved_5_3_MASK)

#define GMAC_DMA_CH1_STATUS_RI_MASK              (0x40U)
#define GMAC_DMA_CH1_STATUS_RI_SHIFT             (6U)
#define GMAC_DMA_CH1_STATUS_RI_WIDTH             (1U)
#define GMAC_DMA_CH1_STATUS_RI(x)                (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_STATUS_RI_SHIFT)) & GMAC_DMA_CH1_STATUS_RI_MASK)

#define GMAC_DMA_CH1_STATUS_RBU_MASK             (0x80U)
#define GMAC_DMA_CH1_STATUS_RBU_SHIFT            (7U)
#define GMAC_DMA_CH1_STATUS_RBU_WIDTH            (1U)
#define GMAC_DMA_CH1_STATUS_RBU(x)               (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH1_STATUS_RBU_SHIFT)) & GMAC_DMA_CH1_STATUS_RBU_MASK)

