zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TQOS_MASK (0xF000000U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TQOS_SHIFT (24U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TQOS_WIDTH (4U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_TQOS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_TQOS_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_TQOS_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_EDSE_MASK        (0x10000000U)
#define GMAC_DMA_CH2_TX_CONTROL_EDSE_SHIFT       (28U)
#define GMAC_DMA_CH2_TX_CONTROL_EDSE_WIDTH       (1U)
#define GMAC_DMA_CH2_TX_CONTROL_EDSE(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_EDSE_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_EDSE_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_TFSEL_MASK       (0x60000000U)
#define GMAC_DMA_CH2_TX_CONTROL_TFSEL_SHIFT      (29U)
#define GMAC_DMA_CH2_TX_CONTROL_TFSEL_WIDTH      (2U)
#define GMAC_DMA_CH2_TX_CONTROL_TFSEL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_TFSEL_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_TFSEL_MASK)

#define GMAC_DMA_CH2_TX_CONTROL_Reserved_31_MASK (0x80000000U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_31_SHIFT (31U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_31_WIDTH (1U)
#define GMAC_DMA_CH2_TX_CONTROL_Reserved_31(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TX_CONTROL_Reserved_31_SHIFT)) & GMAC_DMA_CH2_TX_CONTROL_Reserved_31_MASK)
/*! @} */

/*! @name DMA_CH2_RX_CONTROL -  */
/*! @{ */

#define GMAC_DMA_CH2_RX_CONTROL_SR_MASK          (0x1U)
#define GMAC_DMA_CH2_RX_CONTROL_SR_SHIFT         (0U)
#define GMAC_DMA_CH2_RX_CONTROL_SR_WIDTH         (1U)
#define GMAC_DMA_CH2_RX_CONTROL_SR(x)            (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_SR_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_SR_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_x_0_MASK    (0xEU)
#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_x_0_SHIFT   (1U)
#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_x_0_WIDTH   (3U)
#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_x_0(x)      (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_RBSZ_x_0_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_RBSZ_x_0_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_13_y_MASK   (0x7FF0U)
#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_13_y_SHIFT  (4U)
#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_13_y_WIDTH  (11U)
#define GMAC_DMA_CH2_RX_CONTROL_RBSZ_13_y(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_RBSZ_13_y_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_RBSZ_13_y_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_Reserved_15_MASK (0x8000U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_15_SHIFT (15U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_15_WIDTH (1U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_15(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_Reserved_15_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_Reserved_15_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_RxPBL_MASK       (0x3F0000U)
#define GMAC_DMA_CH2_RX_CONTROL_RxPBL_SHIFT      (16U)
#define GMAC_DMA_CH2_RX_CONTROL_RxPBL_WIDTH      (6U)
#define GMAC_DMA_CH2_RX_CONTROL_RxPBL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_RxPBL_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_RxPBL_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_ERIC_MASK        (0x400000U)
#define GMAC_DMA_CH2_RX_CONTROL_ERIC_SHIFT       (22U)
#define GMAC_DMA_CH2_RX_CONTROL_ERIC_WIDTH       (1U)
#define GMAC_DMA_CH2_RX_CONTROL_ERIC(x)          (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_ERIC_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_ERIC_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_Reserved_23_MASK (0x800000U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_23_SHIFT (23U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_23_WIDTH (1U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_23(x)   (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_Reserved_23_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_Reserved_23_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_Reserved_RQOS_MASK (0xF000000U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_RQOS_SHIFT (24U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_RQOS_WIDTH (4U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_RQOS(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_Reserved_RQOS_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_Reserved_RQOS_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_Reserved_30_28_MASK (0x70000000U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_30_28_SHIFT (28U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_30_28_WIDTH (3U)
#define GMAC_DMA_CH2_RX_CONTROL_Reserved_30_28(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_Reserved_30_28_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_Reserved_30_28_MASK)

#define GMAC_DMA_CH2_RX_CONTROL_RPF_MASK         (0x80000000U)
#define GMAC_DMA_CH2_RX_CONTROL_RPF_SHIFT        (31U)
#define GMAC_DMA_CH2_RX_CONTROL_RPF_WIDTH        (1U)
#define GMAC_DMA_CH2_RX_CONTROL_RPF(x)           (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL_RPF_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL_RPF_MASK)
/*! @} */

/*! @name DMA_CH2_TXDESC_LIST_ADDRESS -  */
/*! @{ */

#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT)) & GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_Reserved_LSb_MASK)

#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_TDESLA_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_TDESLA_SHIFT (3U)
#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_TDESLA_WIDTH (29U)
#define GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_TDESLA(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_TDESLA_SHIFT)) & GMAC_DMA_CH2_TXDESC_LIST_ADDRESS_TDESLA_MASK)
/*! @} */

/*! @name DMA_CH2_RXDESC_LIST_ADDRESS -  */
/*! @{ */

#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_Reserved_LSb_SHIFT)) & GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_Reserved_LSb_MASK)

#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_RDESLA_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_RDESLA_SHIFT (3U)
#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_RDESLA_WIDTH (29U)
#define GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_RDESLA(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_RDESLA_SHIFT)) & GMAC_DMA_CH2_RXDESC_LIST_ADDRESS_RDESLA_MASK)
/*! @} */

/*! @name DMA_CH2_TXDESC_TAIL_POINTER -  */
/*! @{ */

#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TXDESC_TAIL_POINTER_Reserved_LSb_SHIFT)) & GMAC_DMA_CH2_TXDESC_TAIL_POINTER_Reserved_LSb_MASK)

#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_TDTP_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_TDTP_SHIFT (3U)
#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_TDTP_WIDTH (29U)
#define GMAC_DMA_CH2_TXDESC_TAIL_POINTER_TDTP(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TXDESC_TAIL_POINTER_TDTP_SHIFT)) & GMAC_DMA_CH2_TXDESC_TAIL_POINTER_TDTP_MASK)
/*! @} */

