zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
/*! @name DMA_CH2_RXDESC_TAIL_POINTER -  */
/*! @{ */

#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_Reserved_LSb_MASK (0x7U)
#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_Reserved_LSb_SHIFT (0U)
#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_Reserved_LSb_WIDTH (3U)
#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_Reserved_LSb(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RXDESC_TAIL_POINTER_Reserved_LSb_SHIFT)) & GMAC_DMA_CH2_RXDESC_TAIL_POINTER_Reserved_LSb_MASK)

#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_RDTP_MASK (0xFFFFFFF8U)
#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_RDTP_SHIFT (3U)
#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_RDTP_WIDTH (29U)
#define GMAC_DMA_CH2_RXDESC_TAIL_POINTER_RDTP(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RXDESC_TAIL_POINTER_RDTP_SHIFT)) & GMAC_DMA_CH2_RXDESC_TAIL_POINTER_RDTP_MASK)
/*! @} */

/*! @name DMA_CH2_TXDESC_RING_LENGTH -  */
/*! @{ */

#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_TDRL_MASK (0x3FFU)
#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_TDRL_SHIFT (0U)
#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_TDRL_WIDTH (10U)
#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_TDRL(x)  (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TXDESC_RING_LENGTH_TDRL_SHIFT)) & GMAC_DMA_CH2_TXDESC_RING_LENGTH_TDRL_MASK)

#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_Reserved_31_10_MASK (0xFFFFFC00U)
#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_Reserved_31_10_SHIFT (10U)
#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_Reserved_31_10_WIDTH (22U)
#define GMAC_DMA_CH2_TXDESC_RING_LENGTH_Reserved_31_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_TXDESC_RING_LENGTH_Reserved_31_10_SHIFT)) & GMAC_DMA_CH2_TXDESC_RING_LENGTH_Reserved_31_10_MASK)
/*! @} */

/*! @name DMA_CH2_RX_CONTROL2 -  */
/*! @{ */

#define GMAC_DMA_CH2_RX_CONTROL2_RDRL_MASK       (0x3FFU)
#define GMAC_DMA_CH2_RX_CONTROL2_RDRL_SHIFT      (0U)
#define GMAC_DMA_CH2_RX_CONTROL2_RDRL_WIDTH      (10U)
#define GMAC_DMA_CH2_RX_CONTROL2_RDRL(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL2_RDRL_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL2_RDRL_MASK)

#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_x_10_MASK (0x1FC00U)
#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_x_10_SHIFT (10U)
#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_x_10_WIDTH (7U)
#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_x_10(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL2_Reserved_x_10_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL2_Reserved_x_10_MASK)

#define GMAC_DMA_CH2_RX_CONTROL2_ARBS_MASK       (0xFE0000U)
#define GMAC_DMA_CH2_RX_CONTROL2_ARBS_SHIFT      (17U)
#define GMAC_DMA_CH2_RX_CONTROL2_ARBS_WIDTH      (7U)
#define GMAC_DMA_CH2_RX_CONTROL2_ARBS(x)         (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL2_ARBS_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL2_ARBS_MASK)

#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_31_24_MASK (0xFF000000U)
#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_31_24_SHIFT (24U)
#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_31_24_WIDTH (8U)
#define GMAC_DMA_CH2_RX_CONTROL2_Reserved_31_24(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_CONTROL2_Reserved_31_24_SHIFT)) & GMAC_DMA_CH2_RX_CONTROL2_Reserved_31_24_MASK)
/*! @} */

/*! @name DMA_CH2_INTERRUPT_ENABLE -  */
/*! @{ */

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TIE_MASK   (0x1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TIE_SHIFT  (0U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TIE_WIDTH  (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_TIE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_TIE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TXSE_MASK  (0x2U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TXSE_SHIFT (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TXSE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TXSE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_TXSE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_TXSE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TBUE_MASK  (0x4U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TBUE_SHIFT (2U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TBUE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_TBUE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_TBUE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_TBUE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_5_3_MASK (0x38U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_5_3_SHIFT (3U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_5_3_WIDTH (3U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_5_3(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_5_3_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_5_3_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RIE_MASK   (0x40U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RIE_SHIFT  (6U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RIE_WIDTH  (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_RIE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_RIE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RBUE_MASK  (0x80U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RBUE_SHIFT (7U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RBUE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RBUE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_RBUE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_RBUE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RSE_MASK   (0x100U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RSE_SHIFT  (8U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RSE_WIDTH  (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RSE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_RSE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_RSE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RWTE_MASK  (0x200U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RWTE_SHIFT (9U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RWTE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_RWTE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_RWTE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_RWTE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ETIE_MASK  (0x400U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ETIE_SHIFT (10U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ETIE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ETIE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_ETIE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_ETIE_MASK)

