zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_GMAC.h
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ERIE_MASK  (0x800U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ERIE_SHIFT (11U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ERIE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_ERIE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_ERIE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_ERIE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_FBEE_MASK  (0x1000U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_FBEE_SHIFT (12U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_FBEE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_FBEE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_FBEE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_FBEE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_CDEE_MASK  (0x2000U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_CDEE_SHIFT (13U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_CDEE_WIDTH (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_CDEE(x)    (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_CDEE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_CDEE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_AIE_MASK   (0x4000U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_AIE_SHIFT  (14U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_AIE_WIDTH  (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_AIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_AIE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_AIE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_NIE_MASK   (0x8000U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_NIE_SHIFT  (15U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_NIE_WIDTH  (1U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_NIE(x)     (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_NIE_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_NIE_MASK)

#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_31_16_MASK (0xFFFF0000U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_31_16_SHIFT (16U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_31_16_WIDTH (16U)
#define GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_31_16(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_31_16_SHIFT)) & GMAC_DMA_CH2_INTERRUPT_ENABLE_Reserved_31_16_MASK)
/*! @} */

/*! @name DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER -  */
/*! @{ */

#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MASK (0xFFU)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT (0U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWT_WIDTH (8U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWT(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWT_SHIFT)) & GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWT_MASK)

#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_MASK (0xFF00U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_SHIFT (8U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_WIDTH (8U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_SHIFT)) & GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_15_8_MASK)

#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MASK (0x30000U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT (16U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_WIDTH (2U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWTU(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_SHIFT)) & GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_RWTU_MASK)

#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_MASK (0xFFFC0000U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_SHIFT (18U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_WIDTH (14U)
#define GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_SHIFT)) & GMAC_DMA_CH2_RX_INTERRUPT_WATCHDOG_TIMER_Reserved_31_18_MASK)
/*! @} */

/*! @name DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS -  */
/*! @{ */

#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ESC_MASK (0x1U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ESC_SHIFT (0U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ESC_WIDTH (1U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ESC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ESC_SHIFT)) & GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ESC_MASK)

#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ASC_MASK (0x2U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ASC_SHIFT (1U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ASC_WIDTH (1U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ASC(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ASC_SHIFT)) & GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_ASC_MASK)

#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_MASK (0xCU)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_SHIFT (2U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_WIDTH (2U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_SHIFT)) & GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_3_2_MASK)

#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_SIV_MASK (0xFFF0U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT (4U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_SIV_WIDTH (12U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_SIV(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_SIV_SHIFT)) & GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_SIV_MASK)

#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_RSN_MASK (0xF0000U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT (16U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_RSN_WIDTH (4U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_RSN(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_RSN_SHIFT)) & GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_RSN_MASK)

#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_MASK (0xFFF00000U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_SHIFT (20U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_WIDTH (12U)
#define GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_SHIFT)) & GMAC_DMA_CH2_SLOT_FUNCTION_CONTROL_STATUS_Reserved_31_20_MASK)
/*! @} */

/*! @name DMA_CH2_CURRENT_APP_TXDESC -  */
/*! @{ */

#define GMAC_DMA_CH2_CURRENT_APP_TXDESC_CURTDESAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH2_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT (0U)
#define GMAC_DMA_CH2_CURRENT_APP_TXDESC_CURTDESAPTR_WIDTH (32U)
#define GMAC_DMA_CH2_CURRENT_APP_TXDESC_CURTDESAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CURRENT_APP_TXDESC_CURTDESAPTR_SHIFT)) & GMAC_DMA_CH2_CURRENT_APP_TXDESC_CURTDESAPTR_MASK)
/*! @} */

/*! @name DMA_CH2_CURRENT_APP_RXDESC -  */
/*! @{ */

#define GMAC_DMA_CH2_CURRENT_APP_RXDESC_CURRDESAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH2_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT (0U)
#define GMAC_DMA_CH2_CURRENT_APP_RXDESC_CURRDESAPTR_WIDTH (32U)
#define GMAC_DMA_CH2_CURRENT_APP_RXDESC_CURRDESAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CURRENT_APP_RXDESC_CURRDESAPTR_SHIFT)) & GMAC_DMA_CH2_CURRENT_APP_RXDESC_CURRDESAPTR_MASK)
/*! @} */

/*! @name DMA_CH2_CURRENT_APP_TXBUFFER -  */
/*! @{ */

#define GMAC_DMA_CH2_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH2_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT (0U)
#define GMAC_DMA_CH2_CURRENT_APP_TXBUFFER_CURTBUFAPTR_WIDTH (32U)
#define GMAC_DMA_CH2_CURRENT_APP_TXBUFFER_CURTBUFAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CURRENT_APP_TXBUFFER_CURTBUFAPTR_SHIFT)) & GMAC_DMA_CH2_CURRENT_APP_TXBUFFER_CURTBUFAPTR_MASK)
/*! @} */

/*! @name DMA_CH2_CURRENT_APP_RXBUFFER -  */
/*! @{ */

#define GMAC_DMA_CH2_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MASK (0xFFFFFFFFU)
#define GMAC_DMA_CH2_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT (0U)
#define GMAC_DMA_CH2_CURRENT_APP_RXBUFFER_CURRBUFAPTR_WIDTH (32U)
#define GMAC_DMA_CH2_CURRENT_APP_RXBUFFER_CURRBUFAPTR(x) (((uint32_t)(((uint32_t)(x)) << GMAC_DMA_CH2_CURRENT_APP_RXBUFFER_CURRBUFAPTR_SHIFT)) & GMAC_DMA_CH2_CURRENT_APP_RXBUFFER_CURRBUFAPTR_MASK)
/*! @} */

